#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AbleCore

#include "Basic.hpp"

#include "AbleCore_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AIModule_structs.hpp"
#include "AIModule_classes.hpp"


namespace SDK
{

// Class AbleCore.AblBranchCondition
// 0x0008 (0x0030 - 0x0028)
class UAblBranchCondition : public UObject
{
public:
	bool                                          m_Negate;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblBranchCondition")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblBranchCondition")
	}
	static class UAblBranchCondition* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblBranchCondition>();
	}
};
DUMPER7_ASSERTS_UAblBranchCondition;

// Class AbleCore.AblAbility
// 0x00D8 (0x0100 - 0x0028)
class UAblAbility final : public UObject
{
public:
	float                                         m_Length;                                          // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         m_Cooldown;                                        // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         m_PlayRate;                                        // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_IsPassive;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         m_MaxStacks;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_RefreshDurationOnNewStack;                       // 0x003C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_AlwaysRefreshDuration;                           // 0x003D(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_OnlyRefreshLoopTime;                             // 0x003E(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_Loop;                                            // 0x003F(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         m_LoopStart;                                       // 0x0040(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         m_LoopEnd;                                         // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        m_LoopMaxIterations;                               // 0x0048(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_RequiresTarget;                                  // 0x004C(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_4D[0x3];                                       // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAblTargetingBase*                      m_Targeting;                                       // 0x0050(0x0008)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_IsChanneled;                                     // 0x0058(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAblChannelingBase*>             m_ChannelConditions;                               // 0x0060(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          m_MustPassAllChannelConditions;                    // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAblAbilityTaskResult                         m_FailedChannelResult;                             // 0x0071(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  m_TagContainer;                                    // 0x0078(0x0060)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<class UAblAbilityTask*>                m_Tasks;                                           // 0x00D8(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint32                                        m_AbilityNameHash;                                 // 0x00E8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	EAblAbilityTaskRealm                          m_AbilityRealm;                                    // 0x00EC(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAblAbilityTask*>                m_AllDependentTasks;                               // 0x00F0(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	bool AlwaysRefreshDuration() const;
	float CalculateCooldown(const class UAblAbilityContext* Context) const;
	float CalculateDamageForActor(const class UAblAbilityContext* Context, const class FName& EventName, float BaseDamage, class AActor* Actor) const;
	bool CanInterruptAbility(const class UAblAbilityContext* Context, const class UAblAbility* CurrentAbility) const;
	bool CheckCustomChannelConditional(const class UAblAbilityContext* Context, const class FName& EventName) const;
	bool CustomCanAbilityExecute(const class UAblAbilityContext* Context) const;
	bool CustomCanBranchTo(const class UAblAbilityContext* Context, const class UAblAbility* BranchAbility) const;
	bool CustomCanLoopExecute(const class UAblAbilityContext* Context) const;
	bool CustomFilterCondition(const class UAblAbilityContext* Context, const class FName& EventName, class AActor* Actor) const;
	void CustomTargetingFindTargets(const class UAblAbilityContext* Context, TArray<class AActor*>* FoundTargets) const;
	struct FGameplayTagContainer GetAbilityTagContainer() const;
	float GetBaseCooldown() const;
	int32 GetBaseMaxStacks() const;
	float GetBasePlayRate() const;
	float GetCooldown() const;
	class FString GetDisplayName() const;
	float GetLength() const;
	int32 GetLoopMaxIterationsBP() const;
	struct FVector2D GetLoopRange() const;
	int32 GetMaxStacks(const class UAblAbilityContext* Context) const;
	float GetPlayRate(const class UAblAbilityContext* Context) const;
	float GetRange() const;
	bool IsChanneled() const;
	bool IsLooping() const;
	bool IsPassive() const;
	bool MustPassAllChannelConditions() const;
	void OnAbilityBranch(const class UAblAbilityContext* Context) const;
	void OnAbilityEnd(const class UAblAbilityContext* Context) const;
	void OnAbilityInterrupt(const class UAblAbilityContext* Context) const;
	void OnAbilityStart(const class UAblAbilityContext* Context) const;
	void OnCollisionEvent(const class UAblAbilityContext* Context, const class FName& EventName, const TArray<struct FAblQueryResult>& HitEntities) const;
	void OnCustomEvent(const class UAblAbilityContext* Context, const class FName& EventName) const;
	class UAblAbility* OnGetBranchAbility(const class UAblAbilityContext* Context, const class FName& EventName) const;
	void OnRaycastEvent(const class UAblAbilityContext* Context, const class FName& EventName, const TArray<struct FHitResult>& HitResults) const;
	void OnSpawnedActorEvent(const class UAblAbilityContext* Context, const class FName& EventName, class AActor* SpawnedActor) const;
	bool RefreshDurationOnNewStack() const;
	bool RefreshLoopTimeOnly() const;
	bool RequiresTarget() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbility")
	}
	static class UAblAbility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbility>();
	}
};
DUMPER7_ASSERTS_UAblAbility;

// Class AbleCore.AblAbilityBlueprint
// 0x0000 (0x00A0 - 0x00A0)
class UAblAbilityBlueprint final : public UBlueprint
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityBlueprint")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityBlueprint")
	}
	static class UAblAbilityBlueprint* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityBlueprint>();
	}
};
DUMPER7_ASSERTS_UAblAbilityBlueprint;

// Class AbleCore.AblAbilityBlueprintGeneratedClass
// 0x0000 (0x0350 - 0x0350)
class UAblAbilityBlueprintGeneratedClass final : public UBlueprintGeneratedClass
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityBlueprintGeneratedClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityBlueprintGeneratedClass")
	}
	static class UAblAbilityBlueprintGeneratedClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityBlueprintGeneratedClass>();
	}
};
DUMPER7_ASSERTS_UAblAbilityBlueprintGeneratedClass;

// Class AbleCore.AblAbilityBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UAblAbilityBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static EAblAbilityStartResult ActivateAbility(class UAblAbilityContext* Context);
	static class UAblAbilityContext* CreateAbilityContext(const class UAblAbility* Ability, class UAblAbilityComponent* AbilityComponent, class AActor* Owner, class AActor* Instigator);
	static class UAblCustomTaskScratchPad* CreateCustomScratchPad(class UAblAbilityContext* Context, TSubclassOf<class UAblCustomTaskScratchPad> ScratchPadClass);
	static class UAblAbility* GetAbilityObjectFromClass(class UClass* Class_0);
	static bool GetDrawCollisionQueries();
	static bool IsSuccessfulStartResult(EAblAbilityStartResult Result);
	static bool SetDrawCollisionQueries(bool Enable);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityBlueprintLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityBlueprintLibrary")
	}
	static class UAblAbilityBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityBlueprintLibrary>();
	}
};
DUMPER7_ASSERTS_UAblAbilityBlueprintLibrary;

// Class AbleCore.AblAbilityComponent
// 0x01C8 (0x02E0 - 0x0118)
class UAblAbilityComponent final : public UActorComponent
{
public:
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAblAbilityInstance*                    m_ActiveAbilityInstance;                           // 0x0120(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityInstance*>            m_PassiveAbilityInstances;                         // 0x0128(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class UAbleSettings>           m_Settings;                                        // 0x0138(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<uint32, struct FAblAbilityCooldown>      m_ActiveCooldowns;                                 // 0x0140(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityContext*>             m_PendingContext;                                  // 0x0190(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<EAblAbilityTaskResult>                 m_PendingResult;                                   // 0x01A0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityContext*>             m_AsyncContexts;                                   // 0x01B0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTagContainer                  m_TagContainer;                                    // 0x01C0(0x0060)(Transient, Protected, NativeAccessSpecifierProtected)
	bool                                          m_IsProcessingUpdate;                              // 0x0220(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_221[0x67];                                     // 0x0221(0x0067)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAblAbilityNetworkContext              m_ServerActive;                                    // 0x0288(0x0038)(Net, Transient, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<struct FAblAbilityNetworkContext>      m_ServerPassiveAbilities;                          // 0x02C0(0x0010)(Net, ZeroConstructor, Transient, RepNotify, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<uint32>                                m_RefreshLoopAbilitiesHash;                        // 0x02D0(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	EAblAbilityStartResult ActivateAbility(class UAblAbilityContext* Context);
	void AddTag(const struct FGameplayTag& Tag);
	EAblAbilityStartResult BranchAbility(class UAblAbilityContext* Context);
	void CancelAbility(const class UAblAbility* Ability, EAblAbilityTaskResult ResultToUse);
	void OnServerActiveAbilityChanged();
	void OnServerPassiveAbilitiesChanged();
	void RemoveTag(const struct FGameplayTag& Tag);
	void ServerActivateAbility(const struct FAblAbilityNetworkContext& Context);
	void ServerBranchAbility(const struct FAblAbilityNetworkContext& Context);
	void ServerCancelAbility(uint32 AbilityNameHash, EAblAbilityTaskResult ResultToUse);

	EAblAbilityStartResult CanActivateAbility(class UAblAbilityContext* Context) const;
	float GetAbilityCooldownRatio(const class UAblAbility* Ability) const;
	float GetAbilityCooldownTotal(const class UAblAbility* Ability) const;
	class UAblAbility* GetActiveAbility() const;
	void GetCurrentPassiveAbilities(TArray<class UAblAbility*>* OutPassives) const;
	int32 GetCurrentStackCountForPassiveAbility(const class UAblAbility* Ability) const;
	struct FGameplayTagContainer GetGameplayTagContainerBP() const;
	int32 GetTotalNumberOfPassives() const;
	bool HasAbilityAnimation() const;
	bool HasTag(const struct FGameplayTag& Tag) const;
	bool IsAbilityOnCooldown(const class UAblAbility* Ability) const;
	bool IsPassiveActive(const class UAblAbility* Ability) const;
	bool IsPlayingAbility() const;
	bool MatchesAllTags(const struct FGameplayTagContainer& Container) const;
	bool MatchesAnyTag(const struct FGameplayTagContainer& Container) const;
	bool MatchesQuery(const struct FGameplayTagQuery& Query) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityComponent")
	}
	static class UAblAbilityComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityComponent>();
	}
};
DUMPER7_ASSERTS_UAblAbilityComponent;

// Class AbleCore.AblAbilityContext
// 0x00C8 (0x00F0 - 0x0028)
class UAblAbilityContext final : public UObject
{
public:
	class UAblAbility*                            m_Ability;                                         // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAblAbilityComponent*                   m_AbilityComponent;                                // 0x0030(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         m_StackCount;                                      // 0x0038(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_CurrentTime;                                     // 0x003C(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_LastDelta;                                       // 0x0040(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  m_Owner;                                           // 0x0044(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TWeakObjectPtr<class AActor>                  m_Instigator;                                      // 0x004C(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TWeakObjectPtr<class AActor>>          m_TargetActors;                                    // 0x0058(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<uint32, class UAblAbilityTaskScratchPad*> m_TaskScratchPadMap;                              // 0x0068(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_B8[0x8];                                       // 0x00B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             m_AsyncQueryTransform;                             // 0x00C0(0x0030)(Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	void SetStackCount(int32 Stack);

	int32 GetCurrentStackCount() const;
	float GetCurrentTime() const;
	float GetCurrentTimeRatio() const;
	class AActor* GetInstigator() const;
	float GetLastDeltaTime() const;
	class AActor* GetOwner() const;
	class UAblAbilityComponent* GetSelfAbilityComponent() const;
	class AActor* GetSelfActor() const;
	const TArray<class AActor*> GetTargetActors() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityContext")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityContext")
	}
	static class UAblAbilityContext* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityContext>();
	}
};
DUMPER7_ASSERTS_UAblAbilityContext;

// Class AbleCore.AblAbilityTask
// 0x0030 (0x0058 - 0x0028)
class UAblAbilityTask : public UObject
{
public:
	float                                         m_StartTime;                                       // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_EndTime;                                         // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<EAblAbilityTargetType>                 m_TaskTargets;                                     // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityTask*>                m_Dependencies;                                    // 0x0040(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_Verbose;                                         // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityTask")
	}
	static class UAblAbilityTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityTask>();
	}
};
DUMPER7_ASSERTS_UAblAbilityTask;

// Class AbleCore.AblSetCollisionChannelTask
// 0x0008 (0x0060 - 0x0058)
class UAblSetCollisionChannelTask final : public UAblAbilityTask
{
public:
	ECollisionChannel                             m_Channel;                                         // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_RestoreOnEnd;                                    // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblSetCollisionChannelTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblSetCollisionChannelTask")
	}
	static class UAblSetCollisionChannelTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblSetCollisionChannelTask>();
	}
};
DUMPER7_ASSERTS_UAblSetCollisionChannelTask;

// Class AbleCore.AblAbilityInstance
// 0x0128 (0x0150 - 0x0028)
class UAblAbilityInstance final : public UObject
{
public:
	uint32                                        m_CurrentIteration;                                // 0x0028(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAblAbilityTask*>                m_AsyncTasks;                                      // 0x0030(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityTask*>                m_ActiveAsyncTasks;                                // 0x0040(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityTask*>                m_FinishedAyncTasks;                               // 0x0050(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityTask*>                m_SyncTasks;                                       // 0x0060(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityTask*>                m_ActiveSyncTasks;                                 // 0x0070(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblAbilityTask*>                m_FinishedSyncTasks;                               // 0x0080(0x0010)(ZeroConstructor, Transient, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAblAbility*                            m_Ability;                                         // 0x0090(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAblAbilityContext*                     m_Context;                                         // 0x0098(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TWeakObjectPtr<class AActor>>          m_AdditionalTargets;                               // 0x00A0(0x0010)(ZeroConstructor, Transient, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class UAblAbilityTask*, bool>            m_TaskDependencyMap;                               // 0x00B0(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_100[0x50];                                     // 0x0100(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityInstance")
	}
	static class UAblAbilityInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityInstance>();
	}
};
DUMPER7_ASSERTS_UAblAbilityInstance;

// Class AbleCore.AblBranchConditionOnInput
// 0x0018 (0x0048 - 0x0030)
class UAblBranchConditionOnInput final : public UAblBranchCondition
{
public:
	TArray<class FName>                           m_InputActions;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_MustBeRecentlyPressed;                           // 0x0040(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_RecentlyPressedTimeLimit;                        // 0x0044(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblBranchConditionOnInput")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblBranchConditionOnInput")
	}
	static class UAblBranchConditionOnInput* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblBranchConditionOnInput>();
	}
};
DUMPER7_ASSERTS_UAblBranchConditionOnInput;

// Class AbleCore.AblBranchConditionAlways
// 0x0000 (0x0030 - 0x0030)
class UAblBranchConditionAlways final : public UAblBranchCondition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblBranchConditionAlways")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblBranchConditionAlways")
	}
	static class UAblBranchConditionAlways* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblBranchConditionAlways>();
	}
};
DUMPER7_ASSERTS_UAblBranchConditionAlways;

// Class AbleCore.AblBranchConditionCustom
// 0x0000 (0x0030 - 0x0030)
class UAblBranchConditionCustom final : public UAblBranchCondition
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblBranchConditionCustom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblBranchConditionCustom")
	}
	static class UAblBranchConditionCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblBranchConditionCustom>();
	}
};
DUMPER7_ASSERTS_UAblBranchConditionCustom;

// Class AbleCore.AblAbilityTaskScratchPad
// 0x0000 (0x0028 - 0x0028)
class UAblAbilityTaskScratchPad : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblAbilityTaskScratchPad")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblAbilityTaskScratchPad")
	}
	static class UAblAbilityTaskScratchPad* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblAbilityTaskScratchPad>();
	}
};
DUMPER7_ASSERTS_UAblAbilityTaskScratchPad;

// Class AbleCore.AblSetCollisionChannelResponseTask
// 0x0008 (0x0060 - 0x0058)
class UAblSetCollisionChannelResponseTask final : public UAblAbilityTask
{
public:
	ECollisionChannel                             m_Channel;                                         // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	ECollisionResponse                            m_Response;                                        // 0x0059(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_SetAllChannelsToResponse;                        // 0x005A(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_RestoreOnEnd;                                    // 0x005B(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblSetCollisionChannelResponseTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblSetCollisionChannelResponseTask")
	}
	static class UAblSetCollisionChannelResponseTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblSetCollisionChannelResponseTask>();
	}
};
DUMPER7_ASSERTS_UAblSetCollisionChannelResponseTask;

// Class AbleCore.AblBranchTaskScratchPad
// 0x0018 (0x0040 - 0x0028)
class UAblBranchTaskScratchPad final : public UAblAbilityTaskScratchPad
{
public:
	class UAblAbility*                            BranchAbility;                                     // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FKey>                           CachedKeys;                                        // 0x0030(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblBranchTaskScratchPad")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblBranchTaskScratchPad")
	}
	static class UAblBranchTaskScratchPad* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblBranchTaskScratchPad>();
	}
};
DUMPER7_ASSERTS_UAblBranchTaskScratchPad;

// Class AbleCore.AblBranchTask
// 0x0030 (0x0088 - 0x0058)
class UAblBranchTask final : public UAblAbilityTask
{
public:
	TSubclassOf<class UAblAbility>                m_BranchAbility;                                   // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_DynamicBranchAbility;                            // 0x0060(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_DynamicBranchEventName;                          // 0x0064(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAblBranchCondition*>            m_Conditions;                                      // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_MustPassAllConditions;                           // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_CopyTargetsOnBranch;                             // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblBranchTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblBranchTask")
	}
	static class UAblBranchTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblBranchTask>();
	}
};
DUMPER7_ASSERTS_UAblBranchTask;

// Class AbleCore.AblChannelingBase
// 0x0008 (0x0030 - 0x0028)
class UAblChannelingBase : public UObject
{
public:
	bool                                          m_Negate;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblChannelingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblChannelingBase")
	}
	static class UAblChannelingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblChannelingBase>();
	}
};
DUMPER7_ASSERTS_UAblChannelingBase;

// Class AbleCore.AblChannelingInputConditional
// 0x0020 (0x0050 - 0x0030)
class UAblChannelingInputConditional final : public UAblChannelingBase
{
public:
	TArray<class FName>                           m_InputActions;                                    // 0x0030(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblChannelingInputConditional")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblChannelingInputConditional")
	}
	static class UAblChannelingInputConditional* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblChannelingInputConditional>();
	}
};
DUMPER7_ASSERTS_UAblChannelingInputConditional;

// Class AbleCore.AblChannelingVelocityConditional
// 0x0008 (0x0038 - 0x0030)
class UAblChannelingVelocityConditional final : public UAblChannelingBase
{
public:
	float                                         m_VelocityThreshold;                               // 0x0030(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_UseXYSpeed;                                      // 0x0034(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblChannelingVelocityConditional")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblChannelingVelocityConditional")
	}
	static class UAblChannelingVelocityConditional* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblChannelingVelocityConditional>();
	}
};
DUMPER7_ASSERTS_UAblChannelingVelocityConditional;

// Class AbleCore.AblChannelingCustomConditional
// 0x0008 (0x0038 - 0x0030)
class UAblChannelingCustomConditional final : public UAblChannelingBase
{
public:
	class FName                                   m_EventName;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblChannelingCustomConditional")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblChannelingCustomConditional")
	}
	static class UAblChannelingCustomConditional* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblChannelingCustomConditional>();
	}
};
DUMPER7_ASSERTS_UAblChannelingCustomConditional;

// Class AbleCore.AblCollisionFilter
// 0x0000 (0x0028 - 0x0028)
class UAblCollisionFilter : public UObject
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilter")
	}
	static class UAblCollisionFilter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilter>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilter;

// Class AbleCore.AblCollisionFilterSelf
// 0x0000 (0x0028 - 0x0028)
class UAblCollisionFilterSelf final : public UAblCollisionFilter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterSelf")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterSelf")
	}
	static class UAblCollisionFilterSelf* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterSelf>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterSelf;

// Class AbleCore.AblCollisionFilterOwner
// 0x0000 (0x0028 - 0x0028)
class UAblCollisionFilterOwner final : public UAblCollisionFilter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterOwner")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterOwner")
	}
	static class UAblCollisionFilterOwner* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterOwner>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterOwner;

// Class AbleCore.AblCollisionFilterInstigator
// 0x0000 (0x0028 - 0x0028)
class UAblCollisionFilterInstigator final : public UAblCollisionFilter
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterInstigator")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterInstigator")
	}
	static class UAblCollisionFilterInstigator* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterInstigator>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterInstigator;

// Class AbleCore.AblCollisionFilterByClass
// 0x0010 (0x0038 - 0x0028)
class UAblCollisionFilterByClass final : public UAblCollisionFilter
{
public:
	class UClass*                                 m_Class;                                           // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_Negate;                                          // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterByClass")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterByClass")
	}
	static class UAblCollisionFilterByClass* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterByClass>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterByClass;

// Class AbleCore.AblCollisionFilterSortByDistance
// 0x0030 (0x0058 - 0x0028)
class UAblCollisionFilterSortByDistance final : public UAblCollisionFilter
{
public:
	EAblCollisionFilterSort                       m_SortDirection;                                   // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAblAbilityTargetTypeLocation          m_Location;                                        // 0x002C(0x0028)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          m_Use2DDistance;                                   // 0x0054(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterSortByDistance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterSortByDistance")
	}
	static class UAblCollisionFilterSortByDistance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterSortByDistance>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterSortByDistance;

// Class AbleCore.AblCollisionFilterMaxResults
// 0x0008 (0x0030 - 0x0028)
class UAblCollisionFilterMaxResults final : public UAblCollisionFilter
{
public:
	int32                                         m_MaxEntities;                                     // 0x0028(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterMaxResults")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterMaxResults")
	}
	static class UAblCollisionFilterMaxResults* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterMaxResults>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterMaxResults;

// Class AbleCore.AblCollisionFilterCustom
// 0x0010 (0x0038 - 0x0028)
class UAblCollisionFilterCustom final : public UAblCollisionFilter
{
public:
	class FName                                   m_EventName;                                       // 0x0028(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_UseAsync;                                        // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionFilterCustom")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionFilterCustom")
	}
	static class UAblCollisionFilterCustom* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionFilterCustom>();
	}
};
DUMPER7_ASSERTS_UAblCollisionFilterCustom;

// Class AbleCore.AblCollisionQueryTaskScratchPad
// 0x0048 (0x0070 - 0x0028)
class UAblCollisionQueryTaskScratchPad final : public UAblAbilityTaskScratchPad
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             QueryTransform;                                    // 0x0030(0x0030)(Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_60[0x8];                                       // 0x0060(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          AsyncProcessed;                                    // 0x0068(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionQueryTaskScratchPad")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionQueryTaskScratchPad")
	}
	static class UAblCollisionQueryTaskScratchPad* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionQueryTaskScratchPad>();
	}
};
DUMPER7_ASSERTS_UAblCollisionQueryTaskScratchPad;

// Class AbleCore.AblCollisionQueryTask
// 0x0030 (0x0088 - 0x0058)
class UAblCollisionQueryTask final : public UAblAbilityTask
{
public:
	bool                                          m_FireEvent;                                       // 0x0058(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   m_Name;                                            // 0x005C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAblCollisionShape*                     m_QueryShape;                                      // 0x0068(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAblCollisionFilter*>            m_Filters;                                         // 0x0070(0x0010)(Edit, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_CopyResultsToContext;                            // 0x0080(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_AllowDuplicateEntries;                           // 0x0081(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EAblAbilityTaskRealm                          m_TaskRealm;                                       // 0x0082(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_83[0x5];                                       // 0x0083(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionQueryTask")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionQueryTask")
	}
	static class UAblCollisionQueryTask* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionQueryTask>();
	}
};
DUMPER7_ASSERTS_UAblCollisionQueryTask;

// Class AbleCore.AblCollisionShape
// 0x0030 (0x0058 - 0x0028)
class UAblCollisionShape : public UObject
{
public:
	struct FAblAbilityTargetTypeLocation          m_QueryLocation;                                   // 0x0028(0x0028)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ECollisionChannel                             m_CollisionChannel;                                // 0x0050(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_UseAsyncQuery;                                   // 0x0051(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionShape")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionShape")
	}
	static class UAblCollisionShape* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionShape>();
	}
};
DUMPER7_ASSERTS_UAblCollisionShape;

// Class AbleCore.AblTargetingBase
// 0x0050 (0x0078 - 0x0028)
class UAblTargetingBase : public UObject
{
public:
	bool                                          m_AutoCalculateRange;                              // 0x0028(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         m_Range;                                           // 0x002C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_CalculateAs2DRange;                              // 0x0030(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAblAbilityTargetTypeLocation          m_Location;                                        // 0x0034(0x0028)(Edit, DisableEditOnTemplate, NoDestructor, Protected, NativeAccessSpecifierProtected)
	ECollisionChannel                             m_CollisionChannel;                                // 0x005C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAblAbilityTargetingFilter*>     m_Filters;                                         // 0x0060(0x0010)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_UseAsync;                                        // 0x0070(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblTargetingBase")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblTargetingBase")
	}
	static class UAblTargetingBase* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblTargetingBase>();
	}
};
DUMPER7_ASSERTS_UAblTargetingBase;

// Class AbleCore.AblTargetingSelf
// 0x0000 (0x0078 - 0x0078)
class UAblTargetingSelf final : public UAblTargetingBase
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblTargetingSelf")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblTargetingSelf")
	}
	static class UAblTargetingSelf* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblTargetingSelf>();
	}
};
DUMPER7_ASSERTS_UAblTargetingSelf;

// Class AbleCore.AblCollisionShapeBox
// 0x0010 (0x0068 - 0x0058)
class UAblCollisionShapeBox final : public UAblCollisionShape
{
public:
	struct FVector                                m_HalfExtents;                                     // 0x0058(0x000C)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionShapeBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionShapeBox")
	}
	static class UAblCollisionShapeBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionShapeBox>();
	}
};
DUMPER7_ASSERTS_UAblCollisionShapeBox;

// Class AbleCore.AblCollisionShapeSphere
// 0x0008 (0x0060 - 0x0058)
class UAblCollisionShapeSphere final : public UAblCollisionShape
{
public:
	float                                         m_Radius;                                          // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionShapeSphere")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionShapeSphere")
	}
	static class UAblCollisionShapeSphere* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionShapeSphere>();
	}
};
DUMPER7_ASSERTS_UAblCollisionShapeSphere;

// Class AbleCore.AblCollisionShapeCapsule
// 0x0008 (0x0060 - 0x0058)
class UAblCollisionShapeCapsule final : public UAblCollisionShape
{
public:
	float                                         m_Height;                                          // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_Radius;                                          // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionShapeCapsule")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionShapeCapsule")
	}
	static class UAblCollisionShapeCapsule* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionShapeCapsule>();
	}
};
DUMPER7_ASSERTS_UAblCollisionShapeCapsule;

// Class AbleCore.AblCollisionShapeCone
// 0x0010 (0x0068 - 0x0058)
class UAblCollisionShapeCone final : public UAblCollisionShape
{
public:
	float                                         m_FOV;                                             // 0x0058(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_Length;                                          // 0x005C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         m_Height;                                          // 0x0060(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          m_Is2DQuery;                                       // 0x0064(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AblCollisionShapeCone")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AblCollisionShapeCone")
	}
	static class UAblCollisionShapeCone* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAblCollisionShapeCone>();
	}
};
DUMPER7_ASSERTS_UAblCollisionShapeCone;

// Class AbleCore.AblTargetingSphere
// 0x0008 (0x0080 - 0x0078)
class UAblTargetingSphere final : public UAblTargetingBase
{
public:
	float                                         m_Radius;                                          // 0x0078(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
