#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AkAudio

#include "Basic.hpp"

#include "WwiseResourceLoader_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_classes.hpp"
#include "MovieScene_structs.hpp"
#include "MovieScene_classes.hpp"


namespace SDK
{

// Class AkAudio.AkAmbientSound
// 0x0060 (0x0330 - 0x02D0)
class AAkAmbientSound : public AActor
{
public:
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x02D0(0x0008)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkComponent*                           AkComponent;                                       // 0x02D8(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerIsDestroyed;                          // 0x02E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoPost;                                          // 0x02E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E2[0x2];                                      // 0x02E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         LoopDuration;                                      // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxDuration;                                       // 0x02E8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2EC[0x4];                                      // 0x02EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          StopAmbientSoundEvent;                             // 0x02F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, SimpleDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F8[0x38];                                     // 0x02F8(0x0038)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void StartAmbientSound();
	void StopAmbientSound();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAmbientSound")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAmbientSound")
	}
	static class AAkAmbientSound* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound>();
	}
};
DUMPER7_ASSERTS_AAkAmbientSound;

// Class AkAudio.AkAmbientSound_MultiBoxRange
// 0x0078 (0x03A8 - 0x0330)
class AAkAmbientSound_MultiBoxRange final : public AAkAmbientSound
{
public:
	TArray<struct FTransform>                     BoxPos;                                            // 0x0330(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        BoxExtent;                                         // 0x0340(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PlayerInOutRtpcName;                               // 0x0350(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayOnlyPlayerEnter;                              // 0x0358(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         PlayerInValue;                                     // 0x035C(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlayerOutValue;                                    // 0x0360(0x0004)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_364[0x4];                                      // 0x0364(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FTransform>                     MultiPos;                                          // 0x0368(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkMultiPositionType                          MultiPositionType;                                 // 0x0378(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_379[0x2F];                                     // 0x0379(0x002F)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAmbientSound_MultiBoxRange")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAmbientSound_MultiBoxRange")
	}
	static class AAkAmbientSound_MultiBoxRange* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound_MultiBoxRange>();
	}
};
DUMPER7_ASSERTS_AAkAmbientSound_MultiBoxRange;

// Class AkAudio.AkProjectileConfig
// 0x0068 (0x0090 - 0x0028)
class UAkProjectileConfig final : public UObject
{
public:
	class UAkAudioEvent*                          ExplosionEvent;                                    // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          FlyingEvent;                                       // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                          DefaultHitEvent;                                   // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<EPhysicalSurface, class UAkAudioEvent*>  HitEventMap;                                       // 0x0040(0x0050)(Edit, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkProjectileConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkProjectileConfig")
	}
	static class UAkProjectileConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkProjectileConfig>();
	}
};
DUMPER7_ASSERTS_UAkProjectileConfig;

// Class AkAudio.AkPortalComponent
// 0x00C0 (0x0320 - 0x0260)
class UAkPortalComponent final : public USceneComponent
{
public:
	uint8                                         Pad_258[0x1];                                      // 0x0258(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bDynamic;                                          // 0x0259(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x025A(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25B[0x1];                                      // 0x025B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ObstructionRefreshInterval;                        // 0x025C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ObstructionCollisionChannel;                       // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_261[0xBF];                                     // 0x0261(0x00BF)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal();
	void OpenPortal();
	void SetDynamic(bool bInDynamic);

	EAkAcousticPortalState GetCurrentState() const;
	class UPrimitiveComponent* GetPrimitiveParent() const;
	bool PortalPlacementValid() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPortalComponent")
	}
	static class UAkPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPortalComponent>();
	}
};
DUMPER7_ASSERTS_UAkPortalComponent;

// Class AkAudio.AkPS5InitializationSettings
// 0x00E0 (0x0108 - 0x0028)
class UAkPS5InitializationSettings : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettings        CommonSettings;                                    // 0x0030(0x0068)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x0098(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkPS5AdvancedInitializationSettings   AdvancedSettings;                                  // 0x00B8(0x0050)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPS5InitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPS5InitializationSettings")
	}
	static class UAkPS5InitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPS5InitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkPS5InitializationSettings;

// Class AkAudio.AkAcousticPortal
// 0x0018 (0x0320 - 0x0308)
class AAkAcousticPortal final : public AVolume
{
public:
	class UAkPortalComponent*                     Portal;                                            // 0x0308(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkAcousticPortalState                        InitialState;                                      // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bRequiresStateMigration;                           // 0x0311(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ToggleablePortalTag;                               // 0x0314(0x0008)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bToggleablePortalDefaultOpen;                      // 0x031C(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ClosePortal();
	void OpenPortal();

	EAkAcousticPortalState GetCurrentState() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticPortal")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticPortal")
	}
	static class AAkAcousticPortal* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAcousticPortal>();
	}
};
DUMPER7_ASSERTS_AAkAcousticPortal;

// Class AkAudio.AkAudioType
// 0x0028 (0x0050 - 0x0028)
class UAkAudioType : public UObject
{
public:
	bool                                          bAutoLoad;                                         // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UObject*>                        UserData;                                          // 0x0030(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_40[0x10];                                      // 0x0040(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void LoadData();
	void UnloadData(bool bAsync);

	int32 GetWwiseShortID() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioType")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioType")
	}
	static class UAkAudioType* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioType>();
	}
};
DUMPER7_ASSERTS_UAkAudioType;

// Class AkAudio.AkAcousticTexture
// 0x0010 (0x0060 - 0x0050)
class UAkAcousticTexture final : public UAkAudioType
{
public:
	struct FWwiseAcousticTextureCookedData        AcousticTextureCookedData;                         // 0x0050(0x000C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTexture")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTexture")
	}
	static class UAkAcousticTexture* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTexture>();
	}
};
DUMPER7_ASSERTS_UAkAcousticTexture;

// Class AkAudio.AkAcousticTextureSetComponent
// 0x0010 (0x0270 - 0x0260)
#pragma pack(push, 0x1)
class alignas(0x10) UAkAcousticTextureSetComponent : public USceneComponent
{
public:
	uint8                                         Pad_258[0x10];                                     // 0x0258(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAcousticTextureSetComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAcousticTextureSetComponent")
	}
	static class UAkAcousticTextureSetComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAcousticTextureSetComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkAcousticTextureSetComponent;

// Class AkAudio.AkAmbientSound_MultiPos
// 0x0018 (0x0348 - 0x0330)
class AAkAmbientSound_MultiPos final : public AAkAmbientSound
{
public:
	TArray<struct FTransform>                     MultiPos;                                          // 0x0330(0x0010)(Edit, ZeroConstructor, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EAkMultiPositionType                          MultiPositionType;                                 // 0x0340(0x0001)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_341[0x7];                                      // 0x0341(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAmbientSound_MultiPos")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAmbientSound_MultiPos")
	}
	static class AAkAmbientSound_MultiPos* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkAmbientSound_MultiPos>();
	}
};
DUMPER7_ASSERTS_AAkAmbientSound_MultiPos;

// Class AkAudio.AkAndroidInitializationSettings
// 0x00E0 (0x0108 - 0x0028)
class UAkAndroidInitializationSettings final : public UObject
{
public:
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkCommonInitializationSettingsWithSampleRate CommonSettings;                             // 0x0030(0x0070)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkCommunicationSettingsWithSystemInitialization CommunicationSettings;                   // 0x00A0(0x0020)(Edit, Config, NativeAccessSpecifierPublic)
	struct FAkAndroidAdvancedInitializationSettings AdvancedSettings;                                // 0x00C0(0x0044)(Edit, Config, NoDestructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void MigrateMultiCoreRendering(bool NewValue);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidInitializationSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidInitializationSettings")
	}
	static class UAkAndroidInitializationSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidInitializationSettings>();
	}
};
DUMPER7_ASSERTS_UAkAndroidInitializationSettings;

// Class AkAudio.AkPlatformInfo
// 0x0048 (0x0070 - 0x0028)
class UAkPlatformInfo : public UObject
{
public:
	uint8                                         Pad_28[0x48];                                      // 0x0028(0x0048)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkPlatformInfo")
	}
	static class UAkPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkPlatformInfo;

// Class AkAudio.AkAndroidPlatformInfo
// 0x0000 (0x0070 - 0x0070)
class UAkAndroidPlatformInfo final : public UAkPlatformInfo
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAndroidPlatformInfo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAndroidPlatformInfo")
	}
	static class UAkAndroidPlatformInfo* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAndroidPlatformInfo>();
	}
};
DUMPER7_ASSERTS_UAkAndroidPlatformInfo;

// Class AkAudio.AkAudioBank
// 0x0038 (0x0088 - 0x0050)
class UAkAudioBank final : public UAkAudioType
{
public:
	bool                                          MultiLanguage;                                     // 0x0050(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAkAudioEvent*>                  LinkedAkEvents;                                    // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         LinkedAkEventsNum;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_6C[0x1C];                                      // 0x006C(0x001C)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioBank")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioBank")
	}
	static class UAkAudioBank* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioBank>();
	}
};
DUMPER7_ASSERTS_UAkAudioBank;

// Class AkAudio.AkAudioDeviceShareSet
// 0x0010 (0x0060 - 0x0050)
class UAkAudioDeviceShareSet final : public UAkAudioType
{
public:
	struct FWwiseAudioDeviceShareSetCookedData    AudioDeviceShareSetCookedData;                     // 0x0050(0x000C)(Edit, Transient, EditConst, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioDeviceShareSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioDeviceShareSet")
	}
	static class UAkAudioDeviceShareSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioDeviceShareSet>();
	}
};
DUMPER7_ASSERTS_UAkAudioDeviceShareSet;

// Class AkAudio.AkAudioEvent
// 0x00A8 (0x00F8 - 0x0050)
class UAkAudioEvent final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsInfinite;                                        // 0x0054(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          MultiLanguage;                                     // 0x0055(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_56[0x2];                                       // 0x0056(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         MinimumDuration;                                   // 0x0058(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaximumDuration;                                   // 0x005C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 MultiMinimumDuration;                              // 0x0060(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                 MultiMaximumDuration;                              // 0x0070(0x0010)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bHavePrefetchSize;                                 // 0x0080(0x0001)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwiseLocalizedEventCookedData         EventCookedData;                                   // 0x0088(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                        FadeOutTime;                                       // 0x00F0(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_F4[0x4];                                       // 0x00F4(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 ExecuteAction(const EAkActionOnEventType ActionType, const class AActor* Actor, const int32 PlayingID, const int32 TransitionDuration, const EAkCurveInterpolation FadeCurve);
	int32 PostAtLocation(const struct FVector& Location, const struct FRotator& Orientation, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Callback, const int32 CallbackMask, const class UObject* WorldContextObject);
	int32 PostOnActor(const class AActor* Actor, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnActorAndWait(const class AActor* Actor, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnComponent(class UAkComponent* Component, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask, const bool bStopWhenAttachedObjectDestroyed);
	int32 PostOnComponentAndWait(class UAkComponent* Component, const bool bStopWhenAttachedObjectDestroyed, const struct FLatentActionInfo& LatentActionInfo);
	int32 PostOnGameObject(class UAkGameObject* GameObject, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& Delegate, const int32 CallbackMask);
	int32 PostOnGameObjectAndWait(class UAkGameObject* GameObject, const struct FLatentActionInfo& LatentActionInfo);

	bool GetIsInfinite() const;
	float GetMaxAttenuationRadius() const;
	float GetMaximumDuration() const;
	float GetMinimumDuration() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioEvent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioEvent")
	}
	static class UAkAudioEvent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioEvent>();
	}
};
DUMPER7_ASSERTS_UAkAudioEvent;

// Class AkAudio.AkGameObject
// 0x0020 (0x0280 - 0x0260)
class UAkGameObject : public USceneComponent
{
public:
	float                                         AttenuationScalingFactor;                          // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkAudioEvent;                                      // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EventName;                                         // 0x0268(0x0010)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_278[0x2];                                      // 0x0278(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	bool                                          bAttenuationScalingMigrated;                       // 0x027A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_27B[0x5];                                      // 0x027B(0x0005)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAkEvent(class UAkAudioEvent* AkEvent, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const class FString& InEventName);
	void PostAkEventAsync(const class UObject* WorldContextObject, class UAkAudioEvent* AkEvent, int32* PlayingID, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo);
	int32 PostAssociatedAkEvent(int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	void PostAssociatedAkEventAsync(const class UObject* WorldContextObject, int32 CallbackMask, const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback, const struct FLatentActionInfo& LatentInfo, int32* PlayingID);
	void SetAttenuationScalingFactor(float InAttenuationScalingFactor);
	void Stop();

	float GetAttenuationScalingFactor() const;
	void GetRTPCValue(class UAkRtpc* RTPCValue, ERTPCValueType InputValueType, float* Value, ERTPCValueType* OutputValueType, const class FString& Rtpc, int32 PlayingID) const;
	void SetRTPCValue(class UAkRtpc* RTPCValue, float Value, int32 InterpolationTimeMs, const class FString& Rtpc) const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameObject")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameObject")
	}
	static class UAkGameObject* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameObject>();
	}
};
DUMPER7_ASSERTS_UAkGameObject;

// Class AkAudio.AkGameObjectExt
// 0x0160 (0x03E0 - 0x0280)
#pragma pack(push, 0x1)
class alignas(0x10) UAkGameObjectExt : public UAkGameObject
{
public:
	uint8                                         Pad_280[0x158];                                    // 0x0280(0x0158)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkGameObjectExt")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkGameObjectExt")
	}
	static class UAkGameObjectExt* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkGameObjectExt>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkGameObjectExt;

// Class AkAudio.AkComponent
// 0x0200 (0x05E0 - 0x03E0)
#pragma pack(push, 0x1)
class alignas(0x10) UAkComponent : public UAkGameObjectExt
{
public:
	bool                                          bUseSpatialAudio;                                  // 0x03D8(0x0001)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3D9[0x7];                                      // 0x03D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	EAkCollisionChannel                           OcclusionCollisionChannel;                         // 0x03E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EnableSpotReflectors;                              // 0x03E1(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3E2[0x2];                                      // 0x03E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OuterRadius;                                       // 0x03E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InnerRadius;                                       // 0x03E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3EC[0x4];                                      // 0x03EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAuxBus*                              EarlyReflectionAuxBus;                             // 0x03F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                 EarlyReflectionAuxBusName;                         // 0x03F8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         EarlyReflectionOrder;                              // 0x0408(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionBusSendGain;                        // 0x040C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         EarlyReflectionMaxPathLength;                      // 0x0410(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         roomReverbAuxBusGain;                              // 0x0414(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         diffractionMaxEdges;                               // 0x0418(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                         diffractionMaxPaths;                               // 0x041C(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         diffractionMaxPathLength;                          // 0x0420(0x0004)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          DrawFirstOrderReflections;                         // 0x0424(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawSecondOrderReflections;                        // 0x0425(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawHigherOrderReflections;                        // 0x0426(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          DrawDiffraction;                                   // 0x0427(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          StopWhenOwnerDestroyed;                            // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_429[0x3];                                      // 0x0429(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         OcclusionRefreshInterval;                          // 0x042C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseReverbVolumes;                                 // 0x0430(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_431[0x1A7];                                    // 0x0431(0x01A7)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	ECollisionChannel GetOcclusionCollisionChannel();
	int32 PostAkEventAndWaitForEnd(class UAkAudioEvent* AkEvent, const class FString& in_EventName, const struct FLatentActionInfo& LatentInfo);
	void PostAkEventAndWaitForEndAsync(class UAkAudioEvent* AkEvent, int32* PlayingID, const struct FLatentActionInfo& LatentInfo);
	int32 PostAssociatedAkEventAndWaitForEnd(const struct FLatentActionInfo& LatentInfo);
	void PostAssociatedAkEventAndWaitForEndAsync(int32* PlayingID, const struct FLatentActionInfo& LatentInfo);
	void PostTrigger(class UAkTrigger* TriggerValue, const class FString& Trigger);
	void SetEarlyReflectionsAuxBus(const class FString& AuxBusName);
	void SetEarlyReflectionsVolume(float SendVolume);
	void SetEnableSpotReflectors(bool in_enable);
	void SetGameObjectRadius(float in_outerRadius, float in_innerRadius);
	void SetListeners(const TArray<class UAkComponent*>& Listeners);
	void SetOutputBusVolume(float BusVolume);
	void SetStopWhenOwnerDestroyed(bool bStopWhenOwnerDestroyed);
	void SetSwitch(class UAkSwitchValue* SwitchValue, const class FString& SwitchGroup, const class FString& SwitchState);
	void UseEarlyReflections(class UAkAuxBus* AuxBus, int32 Order, float BusSendGain, float MaxPathLength, bool SpotReflectors, const class FString& AuxBusName);
	void UseReverbVolumes(bool inUseReverbVolumes);

	float GetAttenuationRadius() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkComponent")
	}
	static class UAkComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkComponent;

// Class AkAudio.AkAudioInputComponent
// 0x0030 (0x0610 - 0x05E0)
#pragma pack(push, 0x1)
class alignas(0x10) UAkAudioInputComponent : public UAkComponent
{
public:
	uint8                                         Pad_5D8[0x30];                                     // 0x05D8(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	int32 PostAssociatedAudioInputEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAudioInputComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAudioInputComponent")
	}
	static class UAkAudioInputComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAudioInputComponent>();
	}
};
#pragma pack(pop)
DUMPER7_ASSERTS_UAkAudioInputComponent;

// Class AkAudio.AkAutoComponent
// 0x0000 (0x05E0 - 0x05E0)
class UAkAutoComponent final : public UAkComponent
{
public:
	bool                                          bAutoPostEvent;                                    // 0x05D8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bOutGamePostEventBy2D;                             // 0x05D9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5DA[0x6];                                      // 0x05DA(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAutoComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAutoComponent")
	}
	static class UAkAutoComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAutoComponent>();
	}
};
DUMPER7_ASSERTS_UAkAutoComponent;

// Class AkAudio.AkAuxBus
// 0x0078 (0x00C8 - 0x0050)
class UAkAuxBus final : public UAkAudioType
{
public:
	float                                         MaxAttenuationRadius;                              // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwiseLocalizedAuxBusCookedData        AuxBusCookedData;                                  // 0x0058(0x0060)(Edit, Transient, NativeAccessSpecifierPublic)
	class UAkAudioBank*                           RequiredBank;                                      // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C0[0x8];                                       // 0x00C0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAuxBus")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAuxBus")
	}
	static class UAkAuxBus* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAuxBus>();
	}
};
DUMPER7_ASSERTS_UAkAuxBus;

// Class AkAudio.AkCharacterConfig
// 0x0188 (0x01B0 - 0x0028)
class UAkCharacterConfig final : public UObject
{
public:
	class UAkRtpc*                                AkCameraDistance;                                  // 0x0028(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRtpc*                                AkCameraHeight;                                    // 0x0030(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRtpc*                                AkCameraAngle;                                     // 0x0038(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkStateValue*                          AkStateEnterDanger;                                // 0x0040(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkStateValue*                          AkStateExitDanger;                                 // 0x0048(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         ViewTargetLockedSwitchItem;                        // 0x0050(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         ViewTargetLockedFreindSwitchItem;                  // 0x0058(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         ViewTargetUnlockedSwitchItem;                      // 0x0060(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         AimStatusADSSwitchItem;                            // 0x0068(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         AimStatusShoulderSwitchItem;                       // 0x0070(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         RoleStatus2D;                                      // 0x0078(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkSwitchValue*                         RoleStatus3D;                                      // 0x0080(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkRoleStatusEnter2D;                               // 0x0088(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkRoleStatusEnter3D;                               // 0x0090(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkRoleStatusFlyBegin;                              // 0x0098(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkRoleStatusFlying;                                // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkRoleStatusFlyEnd;                                // 0x00A8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkRoleStatusFlyToWall;                             // 0x00B0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkEnterDanger;                                     // 0x00B8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkLowHealth;                                       // 0x00C0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkCureHealth;                                      // 0x00C8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkReborn;                                          // 0x00D0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayAkRebornOnlyViewTarget;                       // 0x00D8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkAudioEvent*                          AkFalling;                                         // 0x00E0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkJump;                                            // 0x00E8(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                          AkDoubleJump;                                      // 0x00F0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAkGetHurt                             AkGetHurt;                                         // 0x00F8(0x0028)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAkHurtCommon                          AkGetHurtCommon;                                   // 0x0120(0x0038)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAkHurtOther                           AkHurtOther;                                       // 0x0158(0x0020)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAkHurtCommon                          AkHurtOtherCommon;                                 // 0x0178(0x0038)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCharacterConfig")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCharacterConfig")
	}
	static class UAkCharacterConfig* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCharacterConfig>();
	}
};
DUMPER7_ASSERTS_UAkCharacterConfig;

// Class AkAudio.AkCheckBox
// 0x0A48 (0x0B70 - 0x0128)
class UAkCheckBox final : public UContentWidget
{
public:
	uint8                                         Pad_128[0x3D8];                                    // 0x0128(0x03D8)(Fixing Size After Last Property [ Dumper-7 ])
	ECheckBoxState                                CheckedState;                                      // 0x0500(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_501[0x3];                                      // 0x0501(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             CheckedStateDelegate;                              // 0x0504(0x0010)(ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_514[0x4];                                      // 0x0514(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FCheckBoxStyle                         WidgetStyle;                                       // 0x0518(0x0580)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	EHorizontalAlignment                          HorizontalAlignment;                               // 0x0A98(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IsFocusable;                                       // 0x0A99(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A9A[0x6];                                      // 0x0A9A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAkBoolPropertyToControl               ThePropertyToControl;                              // 0x0AA0(0x0010)(Edit, NativeAccessSpecifierPublic)
	struct FAkWwiseItemToControl                  ItemToControl;                                     // 0x0AB0(0x0040)(Edit, Config, EditConst, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(bool bIsChecked)> AkOnCheckStateChanged;                           // 0x0AF0(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const struct FGuid& ItemDroppedID)> OnItemDropped;                 // 0x0B00(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void(const class FString& PropertyDropped)> OnPropertyDropped;          // 0x0B10(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         Pad_B20[0x50];                                     // 0x0B20(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void SetAkBoolProperty(const class FString& ItemProperty);
	void SetAkItemId(const struct FGuid& ItemId);
	void SetCheckedState(ECheckBoxState InCheckedState);
	void SetIsChecked(bool InIsChecked);

	const struct FGuid GetAkItemId() const;
	const class FString GetAkProperty() const;
	ECheckBoxState GetCheckedState() const;
	bool IsChecked() const;
	bool IsPressed() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkCheckBox")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkCheckBox")
	}
	static class UAkCheckBox* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkCheckBox>();
	}
};
DUMPER7_ASSERTS_UAkCheckBox;

// Class AkAudio.AkDebugActor
// 0x0028 (0x02F8 - 0x02D0)
class AAkDebugActor final : public AActor
{
public:
	class UAkAudioEvent*                          AkEvent;                                           // 0x02D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LoopTime;                                          // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2DC[0x4];                                      // 0x02DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           AkComponent;                                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2E8[0x10];                                     // 0x02E8(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void PlayAkEvent();
	void RecordLoc();
	void TryPlayAkEvent();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkDebugActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkDebugActor")
	}
	static class AAkDebugActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AAkDebugActor>();
	}
};
DUMPER7_ASSERTS_AAkDebugActor;

// Class AkAudio.AkAssetData
// 0x0020 (0x0048 - 0x0028)
class UAkAssetData final : public UObject
{
public:
	uint8                                         Pad_28[0x20];                                      // 0x0028(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetData")
	}
	static class UAkAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetData>();
	}
};
DUMPER7_ASSERTS_UAkAssetData;

// Class AkAudio.AkAssetPlatformData
// 0x0008 (0x0030 - 0x0028)
class UAkAssetPlatformData final : public UObject
{
public:
	class UAkAssetData*                           CurrentAssetData;                                  // 0x0028(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkAssetPlatformData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkAssetPlatformData")
	}
	static class UAkAssetPlatformData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkAssetPlatformData>();
	}
};
DUMPER7_ASSERTS_UAkAssetPlatformData;

// Class AkAudio.AkMediaAssetData
// 0x0010 (0x0038 - 0x0028)
class UAkMediaAssetData final : public UObject
{
public:
	uint8                                         Pad_28[0x10];                                      // 0x0028(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAssetData")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAssetData")
	}
	static class UAkMediaAssetData* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAssetData>();
	}
};
DUMPER7_ASSERTS_UAkMediaAssetData;

// Class AkAudio.AkMediaAsset
// 0x0050 (0x0078 - 0x0028)
class UAkMediaAsset : public UObject
{
public:
	TMap<class FString, class UAkMediaAssetData*> MediaAssetDataPerPlatform;                         // 0x0028(0x0050)(Edit, Transient, EditConst, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkMediaAsset")
	}
	static class UAkMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkMediaAsset;

// Class AkAudio.AkLocalizedMediaAsset
// 0x0000 (0x0078 - 0x0078)
class UAkLocalizedMediaAsset final : public UAkMediaAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkLocalizedMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkLocalizedMediaAsset")
	}
	static class UAkLocalizedMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkLocalizedMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkLocalizedMediaAsset;

// Class AkAudio.AkExternalMediaAsset
// 0x0000 (0x0078 - 0x0078)
class UAkExternalMediaAsset final : public UAkMediaAsset
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkExternalMediaAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkExternalMediaAsset")
	}
	static class UAkExternalMediaAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkExternalMediaAsset>();
	}
};
DUMPER7_ASSERTS_UAkExternalMediaAsset;

// Class AkAudio.AkFolder
// 0x0000 (0x0050 - 0x0050)
class UAkFolder final : public UAkAudioType
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkFolder")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkFolder")
	}
	static class UAkFolder* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkFolder>();
	}
};
DUMPER7_ASSERTS_UAkFolder;

// Class AkAudio.DrawPortalComponent
// 0x0000 (0x04A0 - 0x04A0)
class UDrawPortalComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrawPortalComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrawPortalComponent")
	}
	static class UDrawPortalComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawPortalComponent>();
	}
};
DUMPER7_ASSERTS_UDrawPortalComponent;

// Class AkAudio.DrawRoomComponent
// 0x0000 (0x04A0 - 0x04A0)
class UDrawRoomComponent final : public UPrimitiveComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("DrawRoomComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"DrawRoomComponent")
	}
	static class UDrawRoomComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDrawRoomComponent>();
	}
};
DUMPER7_ASSERTS_UDrawRoomComponent;

// Class AkAudio.AkEffectShareSet
// 0x0068 (0x00B8 - 0x0050)
class UAkEffectShareSet final : public UAkAudioType
{
public:
	struct FWwiseLocalizedShareSetCookedData      ShareSetCookedData;                                // 0x0050(0x0060)(Edit, Transient, EditConst, NativeAccessSpecifierPublic)
	uint8                                         Pad_B0[0x8];                                       // 0x00B0(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("AkEffectShareSet")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AkEffectShareSet")
	}
	static class UAkEffectShareSet* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAkEffectShareSet>();
	}
};
DUMPER7_ASSERTS_UAkEffectShareSet;

// Class AkAudio.AkGameplayStatics
// 0x0000 (0x0028 - 0x0028)
class UAkGameplayStatics final : public UBlueprintFunctionLibrary
{
public:
	static void AddOutput(const struct FAkOutputSettings& in_Settings, struct FAkOutputDeviceID* out_DeviceID, TArray<class UAkComponent*>& in_ListenerIDs);
	static void AddOutputCaptureMarker(const class FString& MarkerText);
	static void CancelEventCallback(const TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)>& PostEventCallback);
	static void ClearBanks();
	static void ClearSoundBanksAndMedia();
	static void ExecuteActionOnEvent(class UAkAudioEvent* AkEvent, EAkActionOnEventType ActionType, class AActor* Actor, int32 TransitionDuration, EAkCurveInterpolation FadeCurve, int32 PlayingID);
	static void ExecuteActionOnPlayingID(EAkActionOnEventType ActionType, int32 PlayingID, int32 TransitionDuration, EAkCurveInterpolation FadeCurve);
