#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALSV4_CPP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_structs.hpp"


namespace SDK::Params
{

// Function ALSV4_CPP.CyRagdollComponent.Multicast_RagdollEnd
// 0x000C (0x000C - 0x0000)
struct CyRagdollComponent_Multicast_RagdollEnd final
{
public:
	struct FVector                                CharacterLocation;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRagdollComponent_Multicast_RagdollEnd;

// Function ALSV4_CPP.CyRagdollComponent.OnMovementStateChanged
// 0x0002 (0x0002 - 0x0000)
struct CyRagdollComponent_OnMovementStateChanged final
{
public:
	EALSMovementState                             PreMovementState;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EALSMovementState                             CurMovementState;                                  // 0x0001(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRagdollComponent_OnMovementStateChanged;

// Function ALSV4_CPP.CyRagdollComponent.Server_RagdollEnd
// 0x000C (0x000C - 0x0000)
struct CyRagdollComponent_Server_RagdollEnd final
{
public:
	struct FVector                                CharacterLocation;                                 // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRagdollComponent_Server_RagdollEnd;

// Function ALSV4_CPP.CyRagdollComponent.Server_SetMeshLocationDuringRagdoll
// 0x000C (0x000C - 0x0000)
struct CyRagdollComponent_Server_SetMeshLocationDuringRagdoll final
{
public:
	struct FVector                                MeshLocation;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRagdollComponent_Server_SetMeshLocationDuringRagdoll;

// Function ALSV4_CPP.ALSBaseCharacter.EventOnJumped
// 0x0001 (0x0001 - 0x0000)
struct ALSBaseCharacter_EventOnJumped final
{
public:
	uint8                                         JumpCount;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_EventOnJumped;

// Function ALSV4_CPP.ALSBaseCharacter.GetFirstPersonCameraTarget
// 0x000C (0x000C - 0x0000)
struct ALSBaseCharacter_GetFirstPersonCameraTarget final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetFirstPersonCameraTarget;

// Function ALSV4_CPP.ALSBaseCharacter.GetThirdPersonPivotTarget
// 0x0030 (0x0030 - 0x0000)
struct ALSBaseCharacter_GetThirdPersonPivotTarget final
{
public:
	struct FTransform                             ReturnValue;                                       // 0x0000(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetThirdPersonPivotTarget;

// Function ALSV4_CPP.ALSBaseCharacter.GetThirdPersonTraceParams
// 0x0014 (0x0014 - 0x0000)
struct ALSBaseCharacter_GetThirdPersonTraceParams final
{
public:
	struct FVector                                TraceOrigin;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TraceRadius;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ECollisionChannel                             ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetThirdPersonTraceParams;

// Function ALSV4_CPP.ALSBaseCharacter.Multicast_OnJumped
// 0x0001 (0x0001 - 0x0000)
struct ALSBaseCharacter_Multicast_OnJumped final
{
public:
	uint8                                         JumpCount;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_Multicast_OnJumped;

// Function ALSV4_CPP.ALSBaseCharacter.Multicast_PlayMontage
// 0x0010 (0x0010 - 0x0000)
struct ALSBaseCharacter_Multicast_PlayMontage final
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSBaseCharacter_Multicast_PlayMontage;

// Function ALSV4_CPP.ALSBaseCharacter.Replicated_PlayMontage
// 0x0010 (0x0010 - 0x0000)
struct ALSBaseCharacter_Replicated_PlayMontage final
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSBaseCharacter_Replicated_PlayMontage;

// Function ALSV4_CPP.ALSBaseCharacter.Server_PlayMontage
// 0x0010 (0x0010 - 0x0000)
struct ALSBaseCharacter_Server_PlayMontage final
{
public:
	class UAnimMontage*                           MontageToPlay;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSBaseCharacter_Server_PlayMontage;

// Function ALSV4_CPP.ALSBaseCharacter.SetActorLocationAndTargetRotation
// 0x0018 (0x0018 - 0x0000)
struct ALSBaseCharacter_SetActorLocationAndTargetRotation final
{
public:
	struct FVector                                NewLocation;                                       // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               NewRotation;                                       // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_SetActorLocationAndTargetRotation;

// Function ALSV4_CPP.ALSBaseCharacter.SetRightShoulder
// 0x0001 (0x0001 - 0x0000)
struct ALSBaseCharacter_SetRightShoulder final
{
public:
	bool                                          bNewRightShoulder;                                 // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_SetRightShoulder;

// Function ALSV4_CPP.ALSBaseCharacter.GetAnimCurveValue
// 0x000C (0x000C - 0x0000)
struct ALSBaseCharacter_GetAnimCurveValue final
{
public:
	class FName                                   CurveName;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetAnimCurveValue;

// Function ALSV4_CPP.ALSBaseCharacter.GetControlForwardRightVector
// 0x0018 (0x0018 - 0x0000)
struct ALSBaseCharacter_GetControlForwardRightVector final
{
public:
	struct FVector                                Forward;                                           // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Right;                                             // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetControlForwardRightVector;

// Function ALSV4_CPP.ALSBaseCharacter.GetMyMovementComponent
// 0x0008 (0x0008 - 0x0000)
struct ALSBaseCharacter_GetMyMovementComponent final
{
public:
	class UALSCharacterMovementComponent*         ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetMyMovementComponent;

// Function ALSV4_CPP.ALSBaseCharacter.GetPlayerMovementInput
// 0x000C (0x000C - 0x0000)
struct ALSBaseCharacter_GetPlayerMovementInput final
{
public:
	struct FVector                                ReturnValue;                                       // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetPlayerMovementInput;

// Function ALSV4_CPP.ALSBaseCharacter.GetTargetMovementSettings
// 0x0020 (0x0020 - 0x0000)
struct ALSBaseCharacter_GetTargetMovementSettings final
{
public:
	struct FALSMovementSettings                   ReturnValue;                                       // 0x0000(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_GetTargetMovementSettings;

// Function ALSV4_CPP.ALSBaseCharacter.IsRightShoulder
// 0x0001 (0x0001 - 0x0000)
struct ALSBaseCharacter_IsRightShoulder final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSBaseCharacter_IsRightShoulder;

// Function ALSV4_CPP.ALSCharacter.AttachToHand
// 0x0028 (0x0028 - 0x0000)
struct ALSCharacter_AttachToHand final
{
public:
	class UStaticMesh*                            NewStaticMesh;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                          NewSkeletalMesh;                                   // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 NewAnimClass;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLeftHand;                                         // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                Offset;                                            // 0x001C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacter_AttachToHand;

// Function ALSV4_CPP.ALSCharacterAnimInstance.PlayDynamicTransition
// 0x0010 (0x0010 - 0x0000)
struct ALSCharacterAnimInstance_PlayDynamicTransition final
{
public:
	float                                         ReTriggerDelay;                                    // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           AnimMontage;                                       // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_PlayDynamicTransition;

// Function ALSV4_CPP.ALSCharacterAnimInstance.PlayTransition
// 0x0010 (0x0010 - 0x0000)
struct ALSCharacterAnimInstance_PlayTransition final
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ReTriggerDelay;                                    // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_PlayTransition;

// Function ALSV4_CPP.ALSCharacterAnimInstance.PlayTransitionChecked
// 0x0008 (0x0008 - 0x0000)
struct ALSCharacterAnimInstance_PlayTransitionChecked final
{
public:
	class UAnimMontage*                           AnimMontage;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_PlayTransitionChecked;

// Function ALSV4_CPP.ALSCharacterAnimInstance.SetGroundedEntryState
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_SetGroundedEntryState final
{
public:
	EALSGroundedEntryState                        NewGroundedEntryState;                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_SetGroundedEntryState;

// Function ALSV4_CPP.ALSCharacterAnimInstance.SetTrackedHipsDirection
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_SetTrackedHipsDirection final
{
public:
	EALSHipsDirection                             HipsDirection;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_SetTrackedHipsDirection;

// Function ALSV4_CPP.ALSCharacterAnimInstance.CanDynamicTransition
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_CanDynamicTransition final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_CanDynamicTransition;

// Function ALSV4_CPP.ALSCharacterAnimInstance.CanRotateInPlace
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_CanRotateInPlace final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_CanRotateInPlace;

// Function ALSV4_CPP.ALSCharacterAnimInstance.CanTurnInPlace
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_CanTurnInPlace final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_CanTurnInPlace;

// Function ALSV4_CPP.ALSCharacterAnimInstance.ShouldMoveCheck
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_ShouldMoveCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_ShouldMoveCheck;

// Function ALSV4_CPP.ALSCharacterAnimInstance.ShouldMoveOnKnockedDownCheck
// 0x0001 (0x0001 - 0x0000)
struct ALSCharacterAnimInstance_ShouldMoveOnKnockedDownCheck final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSCharacterAnimInstance_ShouldMoveOnKnockedDownCheck;

// Function ALSV4_CPP.ALSDebugComponent.GetDebugView
// 0x0001 (0x0001 - 0x0000)
struct ALSDebugComponent_GetDebugView final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSDebugComponent_GetDebugView;

// Function ALSV4_CPP.ALSDebugComponent.GetShowDebugShapes
// 0x0001 (0x0001 - 0x0000)
struct ALSDebugComponent_GetShowDebugShapes final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSDebugComponent_GetShowDebugShapes;

// Function ALSV4_CPP.ALSDebugComponent.GetShowLayerColors
// 0x0001 (0x0001 - 0x0000)
struct ALSDebugComponent_GetShowLayerColors final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSDebugComponent_GetShowLayerColors;

// Function ALSV4_CPP.ALSDebugComponent.GetShowTraces
// 0x0001 (0x0001 - 0x0000)
struct ALSDebugComponent_GetShowTraces final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSDebugComponent_GetShowTraces;

// Function ALSV4_CPP.ALSDebugComponent.ToggleGlobalTimeDilationLocal
// 0x0004 (0x0004 - 0x0000)
struct ALSDebugComponent_ToggleGlobalTimeDilationLocal final
{
public:
	float                                         TimeDilation;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSDebugComponent_ToggleGlobalTimeDilationLocal;

// Function ALSV4_CPP.ALSMantleComponent.MantleUpdate
// 0x0004 (0x0004 - 0x0000)
struct ALSMantleComponent_MantleUpdate final
{
public:
	float                                         BlendIn;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSMantleComponent_MantleUpdate;

// Function ALSV4_CPP.ALSMantleComponent.Multicast_MantleStart
// 0x0060 (0x0060 - 0x0000)
struct ALSMantleComponent_Multicast_MantleStart final
{
public:
	float                                         MantleHeight;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FALSComponentAndTransform              MantleLedgeWS;                                     // 0x0010(0x0040)(ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EALSMantleType                                MantleType;                                        // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMantleComponent_Multicast_MantleStart;

// Function ALSV4_CPP.ALSMantleComponent.OnOwnerRagdollStateChanged
// 0x0001 (0x0001 - 0x0000)
struct ALSMantleComponent_OnOwnerRagdollStateChanged final
{
public:
	bool                                          bRagdollState;                                     // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSMantleComponent_OnOwnerRagdollStateChanged;

// Function ALSV4_CPP.ALSMantleComponent.Server_MantleStart
// 0x0060 (0x0060 - 0x0000)
struct ALSMantleComponent_Server_MantleStart final
{
public:
	float                                         MantleHeight;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FALSComponentAndTransform              MantleLedgeWS;                                     // 0x0010(0x0040)(ConstParm, Parm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	EALSMantleType                                MantleType;                                        // 0x0050(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0xF];                                       // 0x0051(0x000F)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMantleComponent_Server_MantleStart;

// Function ALSV4_CPP.ALSMathLibrary.AngleInRange
// 0x0014 (0x0014 - 0x0000)
struct ALSMathLibrary_AngleInRange final
{
public:
	float                                         Angle;                                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAngle;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngle;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Buffer;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncreaseBuffer;                                    // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x2];                                       // 0x0012(0x0002)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMathLibrary_AngleInRange;

// Function ALSV4_CPP.ALSMathLibrary.CalculateQuadrant
// 0x0020 (0x0020 - 0x0000)
struct ALSMathLibrary_CalculateQuadrant final
{
public:
	EALSMovementDirection                         Current;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FRThreshold;                                       // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FLThreshold;                                       // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BRThreshold;                                       // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BLThreshold;                                       // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Buffer;                                            // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Angle;                                             // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EALSMovementDirection                         ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMathLibrary_CalculateQuadrant;

// Function ALSV4_CPP.ALSMathLibrary.CapsuleHasRoomCheck
// 0x0020 (0x0020 - 0x0000)
struct ALSMathLibrary_CapsuleHasRoomCheck final
{
public:
	class UCapsuleComponent*                      Capsule;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         HeightOffset;                                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RadiusOffset;                                      // 0x0018(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x001C(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMathLibrary_CapsuleHasRoomCheck;

// Function ALSV4_CPP.ALSMathLibrary.GetCapsuleBaseLocation
// 0x0020 (0x0020 - 0x0000)
struct ALSMathLibrary_GetCapsuleBaseLocation final
{
public:
	float                                         ZOffset;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCapsuleComponent*                      Capsule;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0010(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMathLibrary_GetCapsuleBaseLocation;

// Function ALSV4_CPP.ALSMathLibrary.GetCapsuleLocationFromBase
// 0x0028 (0x0028 - 0x0000)
struct ALSMathLibrary_GetCapsuleLocationFromBase final
{
public:
	struct FVector                                BaseLocation;                                      // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ZOffset;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCapsuleComponent*                      Capsule;                                           // 0x0010(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0018(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_ALSMathLibrary_GetCapsuleLocationFromBase;

// Function ALSV4_CPP.ALSMathLibrary.MantleComponentLocalToWorld
// 0x0070 (0x0070 - 0x0000)
struct ALSMathLibrary_MantleComponentLocalToWorld final
{
public:
	struct FALSComponentAndTransform              CompAndTransform;                                  // 0x0000(0x0040)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0040(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSMathLibrary_MantleComponentLocalToWorld;

// Function ALSV4_CPP.ALSMathLibrary.TransfromAdd
// 0x0090 (0x0090 - 0x0000)
struct ALSMathLibrary_TransfromAdd final
{
public:
	struct FTransform                             T1;                                                // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             T2;                                                // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSMathLibrary_TransfromAdd;

// Function ALSV4_CPP.ALSMathLibrary.TransfromSub
// 0x0090 (0x0090 - 0x0000)
struct ALSMathLibrary_TransfromSub final
{
public:
	struct FTransform                             T1;                                                // 0x0000(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             T2;                                                // 0x0030(0x0030)(ConstParm, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             ReturnValue;                                       // 0x0060(0x0030)(Parm, OutParm, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSMathLibrary_TransfromSub;

// Function ALSV4_CPP.ALSPlayerCameraManager.CalculateAxisIndependentLag
// 0x0040 (0x0040 - 0x0000)
struct ALSPlayerCameraManager_CalculateAxisIndependentLag final
{
public:
	struct FVector                                CurrentLocation;                                   // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetLocation;                                    // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               CameraRotation;                                    // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                LagSpeeds;                                         // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DeltaTime;                                         // 0x0030(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x0034(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSPlayerCameraManager_CalculateAxisIndependentLag;

// Function ALSV4_CPP.ALSPlayerCameraManager.DrawDebugTargets
// 0x000C (0x000C - 0x0000)
struct ALSPlayerCameraManager_DrawDebugTargets final
{
public:
	struct FVector                                PivotTargetLocation;                               // 0x0000(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_ALSPlayerCameraManager_DrawDebugTargets;

// Function ALSV4_CPP.CyAnimAssetBase.ClearAllAnimations
// 0x0008 (0x0008 - 0x0000)
struct CyAnimAssetBase_ClearAllAnimations final
{
public:
	class UClass*                                 Class_0;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_ClearAllAnimations;

// Function ALSV4_CPP.CyAnimAssetBase.CopyCurves
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_CopyCurves final
{
public:
	TArray<class UAnimSequenceBase*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_CopyCurves;

// Function ALSV4_CPP.CyAnimAssetBase.CreateNecessaryAssets
// 0x0004 (0x0004 - 0x0000)
struct CyAnimAssetBase_CreateNecessaryAssets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_CreateNecessaryAssets;

// Function ALSV4_CPP.CyAnimAssetBase.GetFootAnimations
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_GetFootAnimations final
{
public:
	TArray<class UAnimSequenceBase*>              Animations;                                        // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_GetFootAnimations;

// Function ALSV4_CPP.CyAnimAssetBase.MakeAllAdditives
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_MakeAllAdditives final
{
public:
	TArray<class UAnimSequenceBase*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_MakeAllAdditives;

// Function ALSV4_CPP.CyAnimAssetBase.ReplaceBlendSpaceAnimSequence
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_ReplaceBlendSpaceAnimSequence final
{
public:
	TArray<class UBlendSpaceBase*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_ReplaceBlendSpaceAnimSequence;

// Function ALSV4_CPP.CyAnimAssetBase.UpdateAll
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_UpdateAll final
{
public:
	TArray<class UAnimationAsset*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_UpdateAll;

// Function ALSV4_CPP.CyAnimAssetBase.UpdateMontages
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_UpdateMontages final
{
public:
	TArray<class UAnimationAsset*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_UpdateMontages;

// Function ALSV4_CPP.CyAnimAssetBase.UpdatePreviewMesh
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_UpdatePreviewMesh final
{
public:
	TArray<class UAnimationAsset*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_UpdatePreviewMesh;

// Function ALSV4_CPP.CyAnimAssetBase.UpdateRetargetSource
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_UpdateRetargetSource final
{
public:
	TArray<class UAnimationAsset*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_UpdateRetargetSource;

// Function ALSV4_CPP.CyAnimAssetBase.UpdateRootMotion
// 0x0010 (0x0010 - 0x0000)
struct CyAnimAssetBase_UpdateRootMotion final
{
public:
	TArray<class UAnimSequenceBase*>              ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetBase_UpdateRootMotion;

// Function ALSV4_CPP.CyAnimAssetWeapon.GetActionMap
// 0x0050 (0x0050 - 0x0000)
struct CyAnimAssetWeapon_GetActionMap final
{
public:
	TMap<ECyWeaponActionType, class UAnimMontage*> ReturnValue;                                      // 0x0000(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimAssetWeapon_GetActionMap;

// Function ALSV4_CPP.CyAnimationComponent.MulticastPlayRotateMontage
// 0x0010 (0x0010 - 0x0000)
struct CyAnimationComponent_MulticastPlayRotateMontage final
{
public:
	class UAnimMontage*                           InMontage;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPlayRate;                                        // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InRotationScale;                                   // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_MulticastPlayRotateMontage;

// Function ALSV4_CPP.CyAnimationComponent.MulticastTurnInPlace
// 0x0008 (0x0008 - 0x0000)
struct CyAnimationComponent_MulticastTurnInPlace final
{
public:
	float                                         TurnAngle;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EALSTurnInPlaceAssetType                      InTurnInPlaceAssetType;                            // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyAnimationComponent_MulticastTurnInPlace;

// Function ALSV4_CPP.CyAnimationComponent.OnRep_RotationMode
// 0x0001 (0x0001 - 0x0000)
struct CyAnimationComponent_OnRep_RotationMode final
{
public:
	EALSRotationMode                              PrevRotMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_OnRep_RotationMode;

// Function ALSV4_CPP.CyAnimationComponent.OnRep_ViewMode
// 0x0001 (0x0001 - 0x0000)
struct CyAnimationComponent_OnRep_ViewMode final
{
public:
	EALSViewMode                                  PrevViewMode;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_OnRep_ViewMode;

// Function ALSV4_CPP.CyAnimationComponent.Server_SetDesiredGait
// 0x0001 (0x0001 - 0x0000)
struct CyAnimationComponent_Server_SetDesiredGait final
{
public:
	EALSGait                                      NewGait;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_Server_SetDesiredGait;

// Function ALSV4_CPP.CyAnimationComponent.Server_SetDesiredRotationMode
// 0x0001 (0x0001 - 0x0000)
struct CyAnimationComponent_Server_SetDesiredRotationMode final
{
public:
	EALSRotationMode                              NewRotMode;                                        // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_Server_SetDesiredRotationMode;

// Function ALSV4_CPP.CyAnimationComponent.Server_SetRotationMode
// 0x0001 (0x0001 - 0x0000)
struct CyAnimationComponent_Server_SetRotationMode final
{
public:
	EALSRotationMode                              NewRotationMode;                                   // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_Server_SetRotationMode;

// Function ALSV4_CPP.CyAnimationComponent.Server_SetViewMode
// 0x0001 (0x0001 - 0x0000)
struct CyAnimationComponent_Server_SetViewMode final
{
public:
	EALSViewMode                                  NewViewMode;                                       // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyAnimationComponent_Server_SetViewMode;

// Function ALSV4_CPP.CyBlueprintLibrary.AddSkeletonCurves
// 0x0018 (0x0018 - 0x0000)
struct CyBlueprintLibrary_AddSkeletonCurves final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                           Curves;                                            // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_AddSkeletonCurves;

// Function ALSV4_CPP.CyBlueprintLibrary.AddSkeletonSlotGroups
// 0x0058 (0x0058 - 0x0000)
struct CyBlueprintLibrary_AddSkeletonSlotGroups final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                GroupSlots;                                        // 0x0008(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_AddSkeletonSlotGroups;

// Function ALSV4_CPP.CyBlueprintLibrary.AddVirtualBone
// 0x0020 (0x0020 - 0x0000)
struct CyBlueprintLibrary_AddVirtualBone final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   SourceBoneName;                                    // 0x0008(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   TargetBoneName;                                    // 0x0010(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   InVBName;                                          // 0x0018(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_AddVirtualBone;

// Function ALSV4_CPP.CyBlueprintLibrary.AddVirtualBones
// 0x0010 (0x0010 - 0x0000)
struct CyBlueprintLibrary_AddVirtualBones final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                             DataTable;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_AddVirtualBones;

// Function ALSV4_CPP.CyBlueprintLibrary.CopyAndAddAnimCurves
// 0x0010 (0x0010 - 0x0000)
struct CyBlueprintLibrary_CopyAndAddAnimCurves final
{
public:
	class UAnimSequenceBase*                      SrcAnimSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      DestAnimSequence;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_CopyAndAddAnimCurves;

// Function ALSV4_CPP.CyBlueprintLibrary.CopyAnimCurves
// 0x0010 (0x0010 - 0x0000)
struct CyBlueprintLibrary_CopyAnimCurves final
{
public:
	class UAnimSequenceBase*                      SrcAnimSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                      DestAnimSequence;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_CopyAnimCurves;

// Function ALSV4_CPP.CyBlueprintLibrary.DeleteVirtualBones
// 0x0008 (0x0008 - 0x0000)
struct CyBlueprintLibrary_DeleteVirtualBones final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_DeleteVirtualBones;

// Function ALSV4_CPP.CyBlueprintLibrary.GetSelectedSkeletons
// 0x0010 (0x0010 - 0x0000)
struct CyBlueprintLibrary_GetSelectedSkeletons final
{
public:
	TArray<class USkeleton*>                      ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBlueprintLibrary_GetSelectedSkeletons;

// Function ALSV4_CPP.CyBlueprintLibrary.RebuildLinkUp
// 0x0010 (0x0010 - 0x0000)
struct CyBlueprintLibrary_RebuildLinkUp final
{
public:
	class UObject*                                Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Days;                                              // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyBlueprintLibrary_RebuildLinkUp;

// Function ALSV4_CPP.CyBlueprintLibrary.SetBonesTranslationRetargetingMode
// 0x0020 (0x0020 - 0x0000)
struct CyBlueprintLibrary_SetBonesTranslationRetargetingMode final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         InBoneNames;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneTranslationRetargetingMode               NewRetargetingMode;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecursive;                                        // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyBlueprintLibrary_SetBonesTranslationRetargetingMode;

// Function ALSV4_CPP.CyBlueprintLibrary.SetBoneTranslationRetargetingMode
// 0x0020 (0x0020 - 0x0000)
struct CyBlueprintLibrary_SetBoneTranslationRetargetingMode final
{
public:
	class USkeleton*                              Skeleton;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InBoneName;                                        // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EBoneTranslationRetargetingMode               NewRetargetingMode;                                // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecursive;                                        // 0x0019(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyBlueprintLibrary_SetBoneTranslationRetargetingMode;

// Function ALSV4_CPP.CyBlueprintLibrary.UpdateAnimRootMotion
// 0x0018 (0x0018 - 0x0000)
struct CyBlueprintLibrary_UpdateAnimRootMotion final
{
public:
	class UAnimSequence*                          SrcAnimSequence;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequence*                          DestAnimSequence;                                  // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyBlueprintLibrary_UpdateAnimRootMotion;

// Function ALSV4_CPP.CyRollComponent.OnOwnerLandEvent
// 0x0001 (0x0001 - 0x0000)
struct CyRollComponent_OnOwnerLandEvent final
{
public:
	bool                                          bDisposed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRollComponent_OnOwnerLandEvent;

// Function ALSV4_CPP.CyRollComponent.OnOwnerRollInput
// 0x0001 (0x0001 - 0x0000)
struct CyRollComponent_OnOwnerRollInput final
{
public:
	bool                                          bDisposed;                                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRollComponent_OnOwnerRollInput;

// Function ALSV4_CPP.CyRotationComponent.OnRotationModeChanged
// 0x0001 (0x0001 - 0x0000)
struct CyRotationComponent_OnRotationModeChanged final
{
public:
	EALSRotationMode                              PreviousRotationMode;                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyRotationComponent_OnRotationModeChanged;

}

