#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALSV4_CPP

#include "Basic.hpp"

#include "AIModule_classes.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "ALSV4_CPP_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Class ALSV4_CPP.CySubAnimInstanceWeapon
// 0x0240 (0x0510 - 0x02D0)
class UCySubAnimInstanceWeapon : public UAnimInstance
{
public:
	class UALSCharacterAnimInstance*              MasterAnimInstance;                                // 0x02C8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	EALSOverlayOverrideState                      OverlayOverrideState;                              // 0x02D0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_2D1[0x3];                                      // 0x02D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BasePose_N;                                        // 0x02D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BasePose_CLF;                                      // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         BasePose_K;                                        // 0x02DC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         InAirLandPrediction;                               // 0x02E0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         RelativeAccelerationAmountX;                       // 0x02E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FALSVelocityBlend                      VelocityBlend;                                     // 0x02E8(0x0010)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         AimSweepTime;                                      // 0x02F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ActualAimSweepTime;                                // 0x02FC(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInAir;                                            // 0x0300(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSprinting;                                        // 0x0301(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSprintFromReadyToRelaxed;                         // 0x0302(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMoving;                                           // 0x0303(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRelax;                                            // 0x0304(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReady;                                            // 0x0305(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bAiming;                                           // 0x0306(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bADS;                                              // 0x0307(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWaist;                                            // 0x0308(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bCustom;                                           // 0x0309(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsViewTarget;                                     // 0x030A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMoving;                                         // 0x030B(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFly2D;                                            // 0x030C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWalk2D;                                           // 0x030D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWall2D;                                           // 0x030E(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bForceRelaxed;                                     // 0x030F(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bPrevWalk2D;                                       // 0x0310(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsFiring;                                         // 0x0311(0x0001)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_312[0x2];                                      // 0x0312(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         AttackIndex;                                       // 0x0314(0x0004)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AttackChargingPercent;                             // 0x0318(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsMobile;                                         // 0x031C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_31D[0x3];                                      // 0x031D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FScalableFloat                         EnableADSMotionDuration;                           // 0x0320(0x0030)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableADSMotion;                                  // 0x0350(0x0001)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         BitPad_351_0 : 2;                                  // 0x0351(0x0001)(Fixing Bit-Field Size Between Bits [ Dumper-7 ])
	uint8                                         bDisableSweep : 1;                                 // 0x0351(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         AimUpWeight;                                       // 0x0354(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimDownWeight;                                     // 0x0358(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AimCenterWeight;                                   // 0x035C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_360[0xC];                                      // 0x0360(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AnimMachineName;                                   // 0x036C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   AnimRelaxedName;                                   // 0x0374(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                   AnimAimingName;                                    // 0x037C(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         RelaxedWeight;                                     // 0x0384(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         AimingWeight;                                      // 0x0388(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                          bActiveWeapon;                                     // 0x038C(0x0001)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_38D[0x3];                                      // 0x038D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnableADSMotionElapsedTime;                        // 0x0390(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_394[0x4];                                      // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        TimeOfWalk2D;                                      // 0x0398(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                         CurrentStateTime;                                  // 0x03A0(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_3A4[0x4];                                      // 0x03A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class ICyCharacterAnimInterface> CharacterAnimInterface;                        // 0x03A8(0x0010)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TMap<class FName, struct FAnimInstanceNotifyClassContainer> AnimInstanceNotifyClassMap;          // 0x03B8(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, struct FAnimInstanceNotifyClassContainer> LinkedAnimInstanceNotifyClassMap;    // 0x0408(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FALSRotationMode                       RotationMode;                                      // 0x0458(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TMap<class FName, class UCyAnimInstanceNotify*> AnimInstanceNotifyMap;                           // 0x0460(0x0050)(Transient, Protected, NativeAccessSpecifierProtected)
	class FName                                   LinkedTag;                                         // 0x04B0(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         LinkedStateIndex;                                  // 0x04B8(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         TimeToDisableInstance;                             // 0x04BC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4C0[0x50];                                     // 0x04C0(0x0050)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySubAnimInstanceWeapon")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySubAnimInstanceWeapon")
	}
	static class UCySubAnimInstanceWeapon* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySubAnimInstanceWeapon>();
	}
};
DUMPER7_ASSERTS_UCySubAnimInstanceWeapon;

// Class ALSV4_CPP.CySubAnimInstanceDefault
// 0x0030 (0x0540 - 0x0510)
class UCySubAnimInstanceDefault final : public UCySubAnimInstanceWeapon
{
public:
	struct FCyWeaponAnims                         Relaxed;                                           // 0x0510(0x0030)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySubAnimInstanceDefault")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySubAnimInstanceDefault")
	}
	static class UCySubAnimInstanceDefault* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySubAnimInstanceDefault>();
	}
};
DUMPER7_ASSERTS_UCySubAnimInstanceDefault;

// Class ALSV4_CPP.ALSAnimNotifyGroundedEntryState
// 0x0008 (0x0040 - 0x0038)
class UALSAnimNotifyGroundedEntryState final : public UAnimNotify
{
public:
	EALSGroundedEntryState                        GroundedEntryState;                                // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALSAnimNotifyGroundedEntryState")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALSAnimNotifyGroundedEntryState")
	}
	static class UALSAnimNotifyGroundedEntryState* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALSAnimNotifyGroundedEntryState>();
	}
};
DUMPER7_ASSERTS_UALSAnimNotifyGroundedEntryState;

// Class ALSV4_CPP.CyPhysicsAnimInstance
// 0x0000 (0x02D0 - 0x02D0)
class UCyPhysicsAnimInstance final : public UAnimInstance
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CyPhysicsAnimInstance")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CyPhysicsAnimInstance")
	}
	static class UCyPhysicsAnimInstance* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCyPhysicsAnimInstance>();
	}
};
DUMPER7_ASSERTS_UCyPhysicsAnimInstance;

// Class ALSV4_CPP.ALS_BTTask_GetRandomLocation
// 0x0010 (0x00A8 - 0x0098)
class UALS_BTTask_GetRandomLocation final : public UBTTask_BlackboardBase
{
public:
	float                                         MaxDistance;                                       // 0x0098(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class UNavigationQueryFilter>     Filter;                                            // 0x00A0(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALS_BTTask_GetRandomLocation")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALS_BTTask_GetRandomLocation")
	}
	static class UALS_BTTask_GetRandomLocation* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALS_BTTask_GetRandomLocation>();
	}
};
DUMPER7_ASSERTS_UALS_BTTask_GetRandomLocation;

// Class ALSV4_CPP.CyCharacterComponent
// 0x0008 (0x0120 - 0x0118)
class UCyCharacterComponent : public UActorComponent
{
public:
	class ACharacter*                             OwnerCharacter;                                    // 0x0118(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CyCharacterComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CyCharacterComponent")
	}
	static class UCyCharacterComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCyCharacterComponent>();
	}
};
DUMPER7_ASSERTS_UCyCharacterComponent;

// Class ALSV4_CPP.CyRagdollComponent
// 0x0120 (0x0240 - 0x0120)
class UCyRagdollComponent final : public UCyCharacterComponent
{
public:
	uint8                                         Pad_120[0x18];                                     // 0x0120(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECyWeaponName, class UAnimMontage*>      FaceUpAnimMap;                                     // 0x0138(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<ECyWeaponName, class UAnimMontage*>      FaceDownAnimMap;                                   // 0x0188(0x0050)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	class FName                                   SimulateBoneName;                                  // 0x01D8(0x0008)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bSupportRagdoll;                                   // 0x01E0(0x0001)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRagdollOnLand;                                    // 0x01E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1E2[0x2];                                      // 0x01E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         RagdollOnLandVelocity;                             // 0x01E4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRagdollOnGround;                                  // 0x01E8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRagdollFaceUp;                                    // 0x01E9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1EA[0x2];                                      // 0x01EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                LastRagdollVelocity;                               // 0x01EC(0x000C)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector_NetQuantize10                  TargetRagdollLocation;                             // 0x01F8(0x000C)(BlueprintVisible, Net, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_204[0xC];                                      // 0x0204(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	class UCyAnimationComponent*                  AnimationComponent;                                // 0x0210(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_218[0x28];                                     // 0x0218(0x0028)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Multicast_RagdollEnd(const struct FVector& CharacterLocation);
	void Multicast_RagdollStart();
	void OnMovementStateChanged(EALSMovementState PreMovementState, EALSMovementState CurMovementState);
	void RagdollEnd();
	void RagdollStart();
	void ReplicatedRagdollEnd();
	void ReplicatedRagdollStart();
	void Server_RagdollEnd(const struct FVector& CharacterLocation);
	void Server_RagdollStart();
	void Server_SetMeshLocationDuringRagdoll(const struct FVector& MeshLocation);
	void SwitchRagdoll();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CyRagdollComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CyRagdollComponent")
	}
	static class UCyRagdollComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCyRagdollComponent>();
	}
};
DUMPER7_ASSERTS_UCyRagdollComponent;

// Class ALSV4_CPP.ALS_BTTask_SetFocusToPlayer
// 0x0000 (0x0070 - 0x0070)
class UALS_BTTask_SetFocusToPlayer final : public UBTTaskNode
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALS_BTTask_SetFocusToPlayer")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALS_BTTask_SetFocusToPlayer")
	}
	static class UALS_BTTask_SetFocusToPlayer* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALS_BTTask_SetFocusToPlayer>();
	}
};
DUMPER7_ASSERTS_UALS_BTTask_SetFocusToPlayer;

// Class ALSV4_CPP.CySlaveMeshComponent
// 0x0000 (0x0C20 - 0x0C20)
class UCySlaveMeshComponent final : public USkeletalMeshComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySlaveMeshComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySlaveMeshComponent")
	}
	static class UCySlaveMeshComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySlaveMeshComponent>();
	}
};
DUMPER7_ASSERTS_UCySlaveMeshComponent;

// Class ALSV4_CPP.ALSAIController
// 0x0008 (0x03E0 - 0x03D8)
class AALSAIController final : public AAIController
{
public:
	class UBehaviorTree*                          Behaviour;                                         // 0x03D8(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALSAIController")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALSAIController")
	}
	static class AALSAIController* GetDefaultObj()
	{
		return GetDefaultObjImpl<AALSAIController>();
	}
};
DUMPER7_ASSERTS_AALSAIController;

// Class ALSV4_CPP.CySubAnimInstanceBasicGrenade
// 0x0050 (0x0560 - 0x0510)
class UCySubAnimInstanceBasicGrenade final : public UCySubAnimInstanceWeapon
{
public:
	struct FCyWeaponSweepAnims                    AnimSequences;                                     // 0x0510(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_558[0x8];                                      // 0x0558(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySubAnimInstanceBasicGrenade")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySubAnimInstanceBasicGrenade")
	}
	static class UCySubAnimInstanceBasicGrenade* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySubAnimInstanceBasicGrenade>();
	}
};
DUMPER7_ASSERTS_UCySubAnimInstanceBasicGrenade;

// Class ALSV4_CPP.ALSAnimNotifyCameraShake
// 0x0010 (0x0048 - 0x0038)
class UALSAnimNotifyCameraShake final : public UAnimNotify
{
public:
	TSubclassOf<class UCameraShake>               ShakeClass;                                        // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Scale;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALSAnimNotifyCameraShake")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALSAnimNotifyCameraShake")
	}
	static class UALSAnimNotifyCameraShake* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALSAnimNotifyCameraShake>();
	}
};
DUMPER7_ASSERTS_UALSAnimNotifyCameraShake;

// Class ALSV4_CPP.CySubAnimInstanceBow
// 0x0150 (0x0660 - 0x0510)
class UCySubAnimInstanceBow final : public UCySubAnimInstanceWeapon
{
public:
	struct FCyWeaponMoveAnims                     Relaxed;                                           // 0x0510(0x0040)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FCyWeaponSweepAnims                    Ready;                                             // 0x0550(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FCyWeaponSweepAnims                    Waist;                                             // 0x0598(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FCyWeaponSweepAnims                    Aiming;                                            // 0x05E0(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FCyWeaponOverrideAnims                 OverrideState;                                     // 0x0628(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FCyWeaponChargeAnims                   Charge;                                            // 0x0640(0x0018)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_658[0x8];                                      // 0x0658(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySubAnimInstanceBow")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySubAnimInstanceBow")
	}
	static class UCySubAnimInstanceBow* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySubAnimInstanceBow>();
	}
};
DUMPER7_ASSERTS_UCySubAnimInstanceBow;

// Class ALSV4_CPP.ALSAnimNotifyFootstep
// 0x0020 (0x0058 - 0x0038)
class UALSAnimNotifyFootstep final : public UAnimNotify
{
public:
	class USoundBase*                             Sound;                                             // 0x0038(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   AttachPointName;                                   // 0x0040(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EALSFootstepType                              FootstepType;                                      // 0x0048(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         VolumeMultiplier;                                  // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PitchMultiplier;                                   // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bOverrideMaskCurve;                                // 0x0054(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_55[0x3];                                       // 0x0055(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALSAnimNotifyFootstep")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALSAnimNotifyFootstep")
	}
	static class UALSAnimNotifyFootstep* GetDefaultObj()
	{
		return GetDefaultObjImpl<UALSAnimNotifyFootstep>();
	}
};
DUMPER7_ASSERTS_UALSAnimNotifyFootstep;

// Class ALSV4_CPP.CySubAnimInstancePistol
// 0x0120 (0x0630 - 0x0510)
class UCySubAnimInstancePistol final : public UCySubAnimInstanceWeapon
{
public:
	struct FCyWeaponMoveAnims                     Relaxed;                                           // 0x0510(0x0040)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponAnims                         Ready;                                             // 0x0550(0x0030)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    Waist;                                             // 0x0580(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    Aiming;                                            // 0x05C8(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponOverrideAnims                 OverrideState;                                     // 0x0610(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_628[0x8];                                      // 0x0628(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySubAnimInstancePistol")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySubAnimInstancePistol")
	}
	static class UCySubAnimInstancePistol* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySubAnimInstancePistol>();
	}
};
DUMPER7_ASSERTS_UCySubAnimInstancePistol;

// Class ALSV4_CPP.ALSBaseCharacter
// 0x0240 (0x07B0 - 0x0570)
class AALSBaseCharacter : public ACharacter
{
public:
	uint8                                         Pad_568[0x58];                                     // 0x0568(0x0058)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                DynamicCameraOffset;                               // 0x05C0(0x000C)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5CC[0x4];                                      // 0x05CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UALSCharacterMovementComponent*         ALSCharacterMovementComponent;                     // 0x05D0(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AALSPlayerCameraManager*                PlayerCameraManager;                               // 0x05D8(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LookUpDownRate;                                    // 0x05E0(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         LookLeftRightRate;                                 // 0x05E4(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         ViewModeSwitchHoldTime;                            // 0x05E8(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bRightShoulder;                                    // 0x05EC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_5ED[0x3];                                      // 0x05ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<ECyPOVType, struct FCyPOVParam>          POVParams;                                         // 0x05F0(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FALSMovementSettings                   CurrentMovementSettings;                           // 0x0640(0x0020)(BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                    MovementModel;                                     // 0x0660(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSMovementStateSettings              MovementData;                                      // 0x0670(0x0108)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_778[0x18];                                     // 0x0778(0x0018)(Fixing Size After Last Property [ Dumper-7 ])
	class UCyAnimationComponent*                  AnimationComponent;                                // 0x0790(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCyRotationComponent*                   RotationComponent;                                 // 0x0798(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_7A0[0x10];                                     // 0x07A0(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void DrawDebugSpheres();
	void EventOnJumped(uint8 JumpCount);
	void EventOnLanded();
	struct FVector GetFirstPersonCameraTarget();
	struct FTransform GetThirdPersonPivotTarget();
	ECollisionChannel GetThirdPersonTraceParams(struct FVector* TraceOrigin, float* TraceRadius);
	void Multicast_OnJumped(uint8 JumpCount);
	void Multicast_OnLanded();
	void Multicast_PlayMontage(class UAnimMontage* MontageToPlay, float InPlayRate);
	void Replicated_PlayMontage(class UAnimMontage* MontageToPlay, float InPlayRate);
	void Server_PlayMontage(class UAnimMontage* MontageToPlay, float InPlayRate);
	void SetActorLocationAndTargetRotation(const struct FVector& NewLocation, const struct FRotator& NewRotation);
	void SetRightShoulder(bool bNewRightShoulder);
	void UpdatePOVParam();

	float GetAnimCurveValue(class FName CurveName) const;
	void GetControlForwardRightVector(struct FVector* Forward, struct FVector* Right) const;
	class UALSCharacterMovementComponent* GetMyMovementComponent() const;
	struct FVector GetPlayerMovementInput() const;
	struct FALSMovementSettings GetTargetMovementSettings() const;
	bool IsRightShoulder() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALSBaseCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALSBaseCharacter")
	}
	static class AALSBaseCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AALSBaseCharacter>();
	}
};
DUMPER7_ASSERTS_AALSBaseCharacter;

// Class ALSV4_CPP.CySubAnimInstanceRifle
// 0x01E0 (0x06F0 - 0x0510)
class UCySubAnimInstanceRifle final : public UCySubAnimInstanceWeapon
{
public:
	struct FCyWeaponMoveAnims                     Relaxed;                                           // 0x0510(0x0040)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    Ready;                                             // 0x0550(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    Waist;                                             // 0x0598(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    Aiming;                                            // 0x05E0(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    ADS;                                               // 0x0628(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponSweepAnims                    Custom;                                            // 0x0670(0x0048)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponOverrideAnims                 OverrideState;                                     // 0x06B8(0x0018)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyWeaponRecoilAnims                   Recoil;                                            // 0x06D0(0x0010)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UAnimMontage*                           ReadyToRelaxTransition;                            // 0x06E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_6E8[0x8];                                      // 0x06E8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("CySubAnimInstanceRifle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"CySubAnimInstanceRifle")
	}
	static class UCySubAnimInstanceRifle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCySubAnimInstanceRifle>();
	}
};
DUMPER7_ASSERTS_UCySubAnimInstanceRifle;

// Class ALSV4_CPP.ALSCharacter
// 0x0020 (0x07D0 - 0x07B0)
class AALSCharacter final : public AALSBaseCharacter
{
public:
	class USceneComponent*                        HeldObjectRoot;                                    // 0x07B0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x07B8(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x07C0(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7C8[0x8];                                      // 0x07C8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void AttachToHand(class UStaticMesh* NewStaticMesh, class USkeletalMesh* NewSkeletalMesh, class UClass* NewAnimClass, bool bLeftHand, const struct FVector& Offset);
	void ClearHeldObject();
	void UpdateHeldObject();
	void UpdateHeldObjectAnimations();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ALSCharacter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ALSCharacter")
	}
	static class AALSCharacter* GetDefaultObj()
	{
		return GetDefaultObjImpl<AALSCharacter>();
	}
};
DUMPER7_ASSERTS_AALSCharacter;

// Class ALSV4_CPP.ALSCharacterAnimInstance
// 0x0730 (0x0A00 - 0x02D0)
class UALSCharacterAnimInstance : public UAnimInstance
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UCyAnimationComponent*                  AnimComponent;                                     // 0x02D0(0x0008)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UCySubAnimInstanceWeapon*>       SubAnimInstances;                                  // 0x02D8(0x0010)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FALSAnimCharacterInformation           CharacterInformation;                              // 0x02E8(0x0070)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSMovementState                      MovementState;                                     // 0x0358(0x0006)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSMovementAction                     MovementAction;                                    // 0x035E(0x0006)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSMoveStatus                         MoveStatus;                                        // 0x0364(0x0007)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSRotationMode                       RotationMode;                                      // 0x036B(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSGait                               Gait;                                              // 0x0373(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSStance                             Stance;                                            // 0x0377(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                          bSprintFromReadyToRelaxed;                         // 0x037B(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FALSCharacterPartFlags                 CharacterHideParts;                                // 0x037C(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class FName                                   SubGraphStateName;                                 // 0x0384(0x0008)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCySubGraphState                       SubGraphState;                                     // 0x038C(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimGraphGrounded                  Grounded;                                          // 0x03A4(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         RootRotationScale;                                 // 0x03DC(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCyCurveValue                          CurveValue;                                        // 0x03E0(0x0014)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         LimitRotatingTime;                                 // 0x03F4(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bInWall;                                           // 0x03F8(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bFly2D;                                            // 0x03F9(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bWalk2D;                                           // 0x03FA(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bIsFiring;                                         // 0x03FB(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AttackStateTime;                                   // 0x03FC(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         AttackIndex;                                       // 0x0400(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         AttackChargingPercent;                             // 0x0404(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bViewTarget;                                       // 0x0408(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bReady;                                            // 0x0409(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bLandTransition;                                   // 0x040A(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_40B[0x1];                                      // 0x040B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SpineRotAdditive;                                  // 0x040C(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                         SweepRotAdditive;                                  // 0x0410(0x0004)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         DisableTransitionCount;                            // 0x0414(0x0004)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FALSVelocityBlend                      VelocityBlend;                                     // 0x0418(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSLeanAmount                         LeanAmount;                                        // 0x0428(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                                RelativeAccelerationAmount;                        // 0x0430(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FALSGroundedEntryState                 GroundedEntryState;                                // 0x043C(0x0003)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSMovementDirection                  MovementDirection;                                 // 0x043F(0x0005)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCyBoneNames                           BoneNames;                                         // 0x0444(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimGraphInAir                     InAir;                                             // 0x049C(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimGraphAimingValues              AimingValues;                                      // 0x04AC(0x0038)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector2D                              SmoothedAimingAngle;                               // 0x04E4(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_4EC[0x10];                                     // 0x04EC(0x0010)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FlailRate;                                         // 0x04FC(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FALSAnimGraphOverlaySlot               OverlaySlotValues;                                 // 0x0500(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimGraphLayerBlending             LayerBlendingValues;                               // 0x0510(0x0034)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSModifyCurve                        ModifyCurves;                                      // 0x0544(0x0058)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimGraphFootIK                    FootIKValues;                                      // 0x059C(0x009C)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, EditConst, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimTurnInPlace                    TurnInPlaceValues;                                 // 0x0638(0x0098)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimRotateInPlace                  RotateInPlace;                                     // 0x06D0(0x0060)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FALSAnimConfiguration                  Config;                                            // 0x0730(0x0048)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                         AimDownSightShakingValue;                          // 0x0778(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bEnableFootIK;                                     // 0x077C(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                          bMummyTimeState;                                   // 0x077D(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_77E[0xA];                                      // 0x077E(0x000A)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            DiagonalScaleAmountCurve;                          // 0x0788(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            StrideBlend_N_Walk;                                // 0x0790(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                            StrideBlend_N_Run;                                 // 0x0798(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
