#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ALSV4_CPP

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK
{

// Enum ALSV4_CPP.EALSRotationMode
// NumValues: 0x0009
enum class EALSRotationMode : uint8
{
	None                                     = 0,
	VelocityDirection                        = 1,
	LookingDirection                         = 2,
	Ready                                    = 3,
	Waist                                    = 4,
	Aiming                                   = 5,
	ADS                                      = 6,
	Custom                                   = 7,
	EALSRotationMode_MAX                     = 8,
};

// Enum ALSV4_CPP.EALSTurnInPlaceAssetType
// NumValues: 0x000A
enum class EALSTurnInPlaceAssetType : uint8
{
	None                                     = 0,
	S_Left90                                 = 1,
	S_Left180                                = 2,
	C_Left90                                 = 3,
	C_Left180                                = 4,
	S_Right90                                = 5,
	S_Right180                               = 6,
	C_Right90                                = 7,
	C_Right180                               = 8,
	EALSTurnInPlaceAssetType_MAX             = 9,
};

// Enum ALSV4_CPP.EALSCharacterPartFlags
// NumValues: 0x0004
enum class EALSCharacterPartFlags : uint32
{
	None                                     = 0,
	Head                                     = 1,
	Neck                                     = 2,
	Max                                      = 4294967295,
};

// Enum ALSV4_CPP.EALSOverlayOverrideState
// NumValues: 0x0005
enum class EALSOverlayOverrideState : uint8
{
	Default                                  = 0,
	LowMantle                                = 1,
	Rolling                                  = 2,
	GettingUp                                = 3,
	EALSOverlayOverrideState_MAX             = 4,
};

// Enum ALSV4_CPP.EALSMovementDirection
// NumValues: 0x0005
enum class EALSMovementDirection : uint8
{
	Forward                                  = 0,
	Right                                    = 1,
	Left                                     = 2,
	Backward                                 = 3,
	EALSMovementDirection_MAX                = 4,
};

// Enum ALSV4_CPP.EALSMantleType
// NumValues: 0x0004
enum class EALSMantleType : uint8
{
	HighMantle                               = 0,
	LowMantle                                = 1,
	FallingCatch                             = 2,
	EALSMantleType_MAX                       = 3,
};

// Enum ALSV4_CPP.EALSHipsDirection
// NumValues: 0x0007
enum class EALSHipsDirection : uint8
{
	F                                        = 0,
	B                                        = 1,
	RF                                       = 2,
	RB                                       = 3,
	LF                                       = 4,
	LB                                       = 5,
	EALSHipsDirection_MAX                    = 6,
};

// Enum ALSV4_CPP.EALSGroundedEntryState
// NumValues: 0x0003
enum class EALSGroundedEntryState : uint8
{
	None                                     = 0,
	Roll                                     = 1,
	EALSGroundedEntryState_MAX               = 2,
};

// Enum ALSV4_CPP.EALSFootstepType
// NumValues: 0x0005
enum class EALSFootstepType : uint8
{
	Step                                     = 0,
	WalkRun                                  = 1,
	Jump                                     = 2,
	Land                                     = 3,
	EALSFootstepType_MAX                     = 4,
};

// Enum ALSV4_CPP.EALSAnimFeatureExample
// NumValues: 0x0004
enum class EALSAnimFeatureExample : uint8
{
	StrideBlending                           = 0,
	AdditiveBlending                         = 1,
	SprintImpulse                            = 2,
	EALSAnimFeatureExample_MAX               = 3,
};

// Enum ALSV4_CPP.EALSViewMode
// NumValues: 0x0003
enum class EALSViewMode : uint8
{
	ThirdPerson                              = 0,
	FirstPerson                              = 1,
	EALSViewMode_MAX                         = 2,
};

// Enum ALSV4_CPP.EALSStance
// NumValues: 0x0004
enum class EALSStance : uint8
{
	Standing                                 = 0,
	Crouching                                = 1,
	Kneeling                                 = 2,
	EALSStance_MAX                           = 3,
};

// Enum ALSV4_CPP.EALSMovementState
// NumValues: 0x0006
enum class EALSMovementState : uint8
{
	None                                     = 0,
	Grounded                                 = 1,
	InAir                                    = 2,
	Mantling                                 = 3,
	Ragdoll                                  = 4,
	EALSMovementState_MAX                    = 5,
};

// Enum ALSV4_CPP.EALSMovementAction
// NumValues: 0x0007
enum class EALSMovementAction : uint8
{
	None                                     = 0,
	LowMantle                                = 1,
	HighMantle                               = 2,
	Rolling                                  = 3,
	GettingUp                                = 4,
	Sideways                                 = 5,
	EALSMovementAction_MAX                   = 6,
};

// Enum ALSV4_CPP.EALSGait
// NumValues: 0x0004
enum class EALSGait : uint8
{
	Walking                                  = 0,
	Running                                  = 1,
	Sprinting                                = 2,
	EALSGait_MAX                             = 3,
};

// Enum ALSV4_CPP.EALSMoveStatus
// NumValues: 0x0007
enum class EALSMoveStatus : uint8
{
	None                                     = 0,
	GroundedNoMove                           = 1,
	GroundedMoving                           = 2,
	GroundedFPP                              = 3,
	InAir                                    = 4,
	InAirFPP                                 = 5,
	EALSMoveStatus_MAX                       = 6,
};

// Enum ALSV4_CPP.ENumComparisonType
// NumValues: 0x0006
enum class ENumComparisonType : uint8
{
	LessThan                                 = 0,
	LessThanOrEqual                          = 1,
	Equal                                    = 2,
	GreaterThanOrEqual                       = 3,
	GreaterThan                              = 4,
	ENumComparisonType_MAX                   = 5,
};

// Enum ALSV4_CPP.ECyPOVType
// NumValues: 0x000D
enum class ECyPOVType : uint8
{
	None                                     = 0,
	Default                                  = 1,
	VelocityDirection                        = 2,
	Idle                                     = 3,
	Walk                                     = 4,
	Run                                      = 5,
	Sprint                                   = 6,
	CrouchIdle                               = 7,
	CrouchWalk                               = 8,
	Aiming                                   = 9,
	AimingCrouch                             = 10,
	ADS                                      = 11,
	ECyPOVType_MAX                           = 12,
};

// Enum ALSV4_CPP.ECyMovementState
// NumValues: 0x0007
enum class ECyMovementState : uint8
{
	None                                     = 0,
	Grounded                                 = 1,
	Jump                                     = 2,
	Fall                                     = 3,
	Land                                     = 4,
	LandMovement                             = 5,
	ECyMovementState_MAX                     = 6,
};

// Enum ALSV4_CPP.ECyLocomotionState
// NumValues: 0x0005
enum class ECyLocomotionState : uint8
{
	None                                     = 0,
	Moving                                   = 1,
	NotMoving                                = 2,
	Stop                                     = 3,
	ECyLocomotionState_MAX                   = 4,
};

// Enum ALSV4_CPP.ECyLocomotionCycle
// NumValues: 0x0008
enum class ECyLocomotionCycle : uint8
{
	None                                     = 0,
	MoveF                                    = 1,
	MoveB                                    = 2,
	MoveLF                                   = 3,
	MoveLB                                   = 4,
	MoveRF                                   = 5,
	MoveRB                                   = 6,
	ECyLocomotionCycle_MAX                   = 7,
};

// Enum ALSV4_CPP.ECyWeaponName
// NumValues: 0x00C7
enum class ECyWeaponName : uint8
{
	None                                     = 0,
	Default                                  = 1,
	C4                                       = 2,
	C4Dismantle                              = 3,
	Grenade                                  = 4,
	FlashGrenade                             = 5,
	SmokeGrenade                             = 6,
	ElectroGrenade                           = 7,
	XRay                                     = 8,
	SkillGhost                               = 9,
	USP45                                    = 10,
	Glock18C                                 = 11,
	DesertEagle                              = 12,
	M1897                                    = 13,
	Chiappa                                  = 14,
	M32                                      = 15,
	Super90                                  = 16,
	AA12                                     = 17,
	ShaoBing                                 = 18,
	MP5A5                                    = 19,
	VECTOR                                   = 20,
	M4A1                                     = 21,
	AKM                                      = 22,
	M16A3                                    = 23,
	XM8                                      = 24,
	G28                                      = 25,
	SVD                                      = 26,
	MG42                                     = 27,
	SCARH                                    = 28,
	FAMAS                                    = 29,
	AUG                                      = 30,
	AWM                                      = 31,
	M200                                     = 32,
	M82A1                                    = 33,
	M200A                                    = 34,
	HKG3                                     = 35,
	Katana                                   = 36,
	WeakenField                              = 37,
	RadarDevice                              = 38,
	NekoBot                                  = 39,
	SuperNeko                                = 40,
	PG                                       = 41,
	DesertLauncher                           = 42,
	Duat                                     = 43,
	FlamePistol                              = 44,
	MicroUzi                                 = 45,
	SkillP                                   = 46,
	SkillQ                                   = 47,
	SkillX                                   = 48,
	SkillQ1                                  = 49,
	SkillQ2                                  = 50,
	SkillQ3                                  = 51,
	SkillX1                                  = 52,
	SkillX2                                  = 53,
	SkillX3                                  = 54,
	Fist                                     = 55,
	WaterPolo                                = 56,
	Rescue                                   = 57,
	RescueSelf                               = 58,
	Charge                                   = 59,
	SnowBall                                 = 60,
	Mine                                     = 61,
	UseProps                                 = 62,
	CustomType120                            = 120,
	CustomType121                            = 121,
	CustomType122                            = 122,
	CustomType123                            = 123,
	CustomType124                            = 124,
	CustomType125                            = 125,
	CustomType126                            = 126,
	CustomType127                            = 127,
	CustomType128                            = 128,
	CustomType129                            = 129,
	CustomType130                            = 130,
	CustomType131                            = 131,
	CustomType132                            = 132,
	CustomType133                            = 133,
	CustomType134                            = 134,
	CustomType135                            = 135,
	CustomType136                            = 136,
	CustomType137                            = 137,
	CustomType138                            = 138,
	CustomType139                            = 139,
	CustomType140                            = 140,
	CustomType141                            = 141,
	CustomType142                            = 142,
	CustomType143                            = 143,
	CustomType144                            = 144,
	CustomType145                            = 145,
	CustomType146                            = 146,
	CustomType147                            = 147,
	CustomType148                            = 148,
	CustomType149                            = 149,
	CustomType150                            = 150,
	CustomType151                            = 151,
	CustomType152                            = 152,
	CustomType153                            = 153,
	CustomType154                            = 154,
	CustomType155                            = 155,
	CustomType156                            = 156,
	CustomType157                            = 157,
	CustomType158                            = 158,
	CustomType159                            = 159,
	CustomType160                            = 160,
	CustomType161                            = 161,
	CustomType162                            = 162,
	CustomType163                            = 163,
	CustomType164                            = 164,
	CustomType165                            = 165,
	CustomType166                            = 166,
	CustomType167                            = 167,
	CustomType168                            = 168,
	CustomType169                            = 169,
	CustomType170                            = 170,
	CustomType171                            = 171,
	CustomType172                            = 172,
	CustomType173                            = 173,
	CustomType174                            = 174,
	CustomType175                            = 175,
	CustomType176                            = 176,
	CustomType177                            = 177,
	CustomType178                            = 178,
	CustomType179                            = 179,
	CustomType180                            = 180,
	CustomType181                            = 181,
	CustomType182                            = 182,
	CustomType183                            = 183,
	CustomType184                            = 184,
	CustomType185                            = 185,
	CustomType186                            = 186,
	CustomType187                            = 187,
	CustomType188                            = 188,
	CustomType189                            = 189,
	CustomType190                            = 190,
	CustomType191                            = 191,
	CustomType192                            = 192,
	CustomType193                            = 193,
	CustomType194                            = 194,
	CustomType195                            = 195,
	CustomType196                            = 196,
	CustomType197                            = 197,
	CustomType198                            = 198,
	CustomType199                            = 199,
	CustomType200                            = 200,
	CustomType201                            = 201,
	CustomType202                            = 202,
	CustomType203                            = 203,
	CustomType204                            = 204,
	CustomType205                            = 205,
	CustomType206                            = 206,
	CustomType207                            = 207,
	CustomType208                            = 208,
	CustomType209                            = 209,
	CustomType210                            = 210,
	CustomType211                            = 211,
	CustomType212                            = 212,
	CustomType213                            = 213,
	CustomType214                            = 214,
	CustomType215                            = 215,
	CustomType216                            = 216,
	CustomType217                            = 217,
	CustomType218                            = 218,
	CustomType219                            = 219,
	CustomType220                            = 220,
	CustomType221                            = 221,
	CustomType222                            = 222,
	CustomType223                            = 223,
	CustomType224                            = 224,
	CustomType225                            = 225,
	CustomType226                            = 226,
	CustomType227                            = 227,
	CustomType228                            = 228,
	CustomType229                            = 229,
	CustomType230                            = 230,
	CustomType231                            = 231,
	CustomType232                            = 232,
	CustomType233                            = 233,
	CustomType234                            = 234,
	CustomType235                            = 235,
	CustomType236                            = 236,
	CustomType237                            = 237,
	CustomType238                            = 238,
	CustomType239                            = 239,
	CustomType240                            = 240,
	CustomType241                            = 241,
	CustomType242                            = 242,
	CustomType243                            = 243,
	CustomType244                            = 244,
	CustomType245                            = 245,
	CustomType246                            = 246,
	CustomType247                            = 247,
	CustomType248                            = 248,
	CustomType249                            = 249,
	CustomType250                            = 250,
	CustomType251                            = 251,
	CustomType252                            = 252,
	CustomType253                            = 253,
	CustomType254                            = 254,
	Max                                      = 255,
};

// Enum ALSV4_CPP.ECyWeaponType
// NumValues: 0x0016
enum class ECyWeaponType : uint8
{
	None                                     = 0,
	GunMin                                   = 1,
	SR                                       = 2,
	AR                                       = 3,
	SMG                                      = 4,
	SG                                       = 5,
	PT                                       = 6,
	LMG                                      = 7,
	Ejector                                  = 8,
	DMR                                      = 9,
	GunMax                                   = 10,
	MeleeMin                                 = 11,
	Blade                                    = 12,
	Knife                                    = 13,
	Fist                                     = 14,
	MeleeMax                                 = 15,
	Grenade                                  = 16,
	Launcher                                 = 17,
	Device                                   = 18,
	Tool                                     = 19,
	ToolMax                                  = 20,
	MAX                                      = 21,
};

// Enum ALSV4_CPP.ECyCharacterUIActionType
// NumValues: 0x0008
enum class ECyCharacterUIActionType : uint8
{
	None                                     = 0,
	MatchBeginPose                           = 1,
	MatchBeginJump                           = 2,
	MatchBeginOutOfWall                      = 3,
	MatchEnd                                 = 4,
	MatchEndLoop                             = 5,
	MatchEnd2Loop                            = 6,
	ECyCharacterUIActionType_MAX             = 7,
};

// Enum ALSV4_CPP.ECyCharacterActionType
// NumValues: 0x000A
enum class ECyCharacterActionType : uint8
{
	None                                     = 0,
	Rescue                                   = 1,
	RescueByRobot                            = 2,
	ActiveSkillBegin                         = 3,
	ActiveSkillEnd                           = 4,
	UltimateSkillReady                       = 5,
	UltimateSkillBegin                       = 6,
	UltimateSkillEnd                         = 7,
	SideTo3D                                 = 8,
	ECyCharacterActionType_MAX               = 9,
};

// Enum ALSV4_CPP.ECyWeaponActionType
// NumValues: 0x002B
enum class ECyWeaponActionType : uint8
{
	None                                     = 0,
	Attack                                   = 1,
	ADSAttack                                = 2,
	AimingAttack                             = 3,
	MeleeFirst                               = 4,
	MeleeSecond                              = 5,
	Smite                                    = 6,
	SmiteBegin                               = 7,
	SmiteMove                                = 8,
	MeleeDash                                = 9,
	SmiteEnd                                 = 10,
	Reload                                   = 11,
	ReloadStart                              = 12,
	SecondReloadStart                        = 13,
	ReloadLoop                               = 14,
	ReloadEnd                                = 15,
	PullBolt                                 = 16,
	EnterSwitchAttackType                    = 17,
	LeaveSwitchAttackType                    = 18,
	FirstEquip                               = 19,
	Equip                                    = 20,
	UnEquip                                  = 21,
	Use                                      = 22,
	UseBegin                                 = 23,
	UseLoop                                  = 24,
	UseEnd                                   = 25,
	Work                                     = 26,
	SecondWork                               = 27,
	ThirdWork                                = 28,
	WorkEnd                                  = 29,
	UnWork                                   = 30,
	BeginADS                                 = 31,
	BeginCustom                              = 32,
	EndCustom                                = 33,
	CustomAttack                             = 34,
	ThrowBeginHigh                           = 35,
	ThrowEndHigh                             = 36,
	ThrowBeginLow                            = 37,
	ThrowEndLow                              = 38,
	MeleeBlockStart                          = 39,
	MeleeBlockLoop                           = 40,
	MeleeBlockEnd                            = 41,
	ECyWeaponActionType_MAX                  = 42,
};

// ScriptStruct ALSV4_CPP.AnimSequencePose
// 0x0010 (0x0010 - 0x0000)
struct FAnimSequencePose final
{
public:
	class UAnimSequenceBase*                      Sequence;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ExplicitTime;                                      // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FAnimSequencePose;

// ScriptStruct ALSV4_CPP.ALSAnimConfiguration
// 0x0048 (0x0048 - 0x0000)
struct FALSAnimConfiguration final
{
public:
	float                                         AnimatedWalkSpeed;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedRunSpeed;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedSprintSpeed;                               // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedCrouchSpeed;                               // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedSpeedScaledLR;                             // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedSpeedScaledB;                              // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         VelocityBlendInterpSpeed;                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         GroundedLeanInterpSpeed;                           // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InAirLeanInterpSpeed;                              // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothedAimingRotationInterpSpeed;                 // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         SmoothedAimingCorrectInterpSpeed;                  // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputYawOffsetInterpSpeed;                         // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         TriggerPivotSpeedLimit;                            // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         DynamicTransitionThreshold;                        // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableTrace;                                      // 0x0038(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FootHeight;                                        // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IK_TraceDistanceAboveFoot;                         // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IK_TraceDistanceBelowFoot;                         // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimConfiguration;

// ScriptStruct ALSV4_CPP.ALSTurnInPlaceAsset
// 0x0010 (0x0010 - 0x0000)
struct FALSTurnInPlaceAsset final
{
public:
	class UAnimMontage*                           Animation;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AnimatedAngle;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PlayRate;                                          // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSTurnInPlaceAsset;

// ScriptStruct ALSV4_CPP.ALSAnimRotateInPlace
// 0x0060 (0x0060 - 0x0000)
struct FALSAnimRotateInPlace final
{
public:
	float                                         ElapsedDelayTime;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateMinThreshold;                                // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RotateMaxThreshold;                                // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawRateMinRange;                                // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawRateMaxRange;                                // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinPlayRate;                                       // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxPlayRate;                                       // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FALSTurnInPlaceAsset                   N_RotateIP_L90;                                    // 0x0020(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_RotateIP_R90;                                    // 0x0030(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   C_RotateIP_L90;                                    // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   C_RotateIP_R90;                                    // 0x0050(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimRotateInPlace;

// ScriptStruct ALSV4_CPP.ALSAnimTurnInPlace
// 0x0098 (0x0098 - 0x0000)
struct FALSAnimTurnInPlace final
{
public:
	float                                         TurnCheckMinAngle;                                 // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Turn180Threshold;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimYawRateLimit;                                   // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ElapsedDelayTime;                                  // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MinAngleDelay;                                     // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxAngleDelay;                                     // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_L90;                                      // 0x0018(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_R90;                                      // 0x0028(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_L180;                                     // 0x0038(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   N_TurnIP_R180;                                     // 0x0048(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   C_TurnIP_L90;                                      // 0x0058(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   C_TurnIP_R90;                                      // 0x0068(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   C_TurnIP_L180;                                     // 0x0078(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FALSTurnInPlaceAsset                   C_TurnIP_R180;                                     // 0x0088(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimTurnInPlace;

// ScriptStruct ALSV4_CPP.ALSAnimGraphFootIK
// 0x009C (0x009C - 0x0000)
struct FALSAnimGraphFootIK final
{
public:
	float                                         FootLock_L_Alpha;                                  // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FootLock_R_Alpha;                                  // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootLock_L_Location;                               // 0x0008(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TargetFootLock_R_Location;                         // 0x0014(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootLock_R_Location;                               // 0x0020(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               TargetFootLock_L_Rotation;                         // 0x002C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FootLock_L_Rotation;                               // 0x0038(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               TargetFootLock_R_Rotation;                         // 0x0044(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FootLock_R_Rotation;                               // 0x0050(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                FootOffset_L_Location;                             // 0x005C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                FootOffset_R_Location;                             // 0x0068(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               FootOffset_L_Rotation;                             // 0x0074(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               FootOffset_R_Rotation;                             // 0x0080(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                PelvisOffset;                                      // 0x008C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         PelvisAlpha;                                       // 0x0098(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimGraphFootIK;

// ScriptStruct ALSV4_CPP.ALSAnimGraphLayerBlending
// 0x0034 (0x0034 - 0x0000)
struct FALSAnimGraphLayerBlending final
{
public:
	EALSOverlayOverrideState                      OverlayOverrideState;                              // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EnableAimOffset;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePose_N;                                        // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePose_CLF;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BasePose_K;                                        // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_LS;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_MS;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_LS;                                          // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_MS;                                          // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hand_L;                                            // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Hand_R;                                            // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnableHandIK_L;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         EnableHandIK_R;                                    // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimGraphLayerBlending;

// ScriptStruct ALSV4_CPP.ALSAnimGraphOverlaySlot
// 0x0010 (0x0010 - 0x0000)
struct FALSAnimGraphOverlaySlot final
{
public:
	float                                         AimUpWeight;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimCenterWeight;                                   // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimDownWeight;                                     // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandRunWeight;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimGraphOverlaySlot;

// ScriptStruct ALSV4_CPP.ALSModifyCurve
// 0x0058 (0x0058 - 0x0000)
struct FALSModifyCurve final
{
public:
	bool                                          FullBodyOverride;                                  // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Pelvis;                                            // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pelvis_UseSlot;                                    // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Pelvis_Add;                                        // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Legs;                                              // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Legs_UseSlot;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Legs_Add;                                          // 0x0018(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spine;                                             // 0x001C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spine_UseSlot;                                     // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Spine_Add;                                         // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Head;                                              // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Head_UseSlot;                                      // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Head_Add;                                          // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L;                                             // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_UseSlot;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_L_Add;                                         // 0x003C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R;                                             // 0x0040(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_UseSlot;                                     // 0x0044(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Arm_R_Add;                                         // 0x0048(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloth;                                             // 0x004C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloth_UseSlot;                                     // 0x0050(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Cloth_Add;                                         // 0x0054(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSModifyCurve;

// ScriptStruct ALSV4_CPP.ALSAnimGraphAimingValues
// 0x0038 (0x0038 - 0x0000)
struct FALSAnimGraphAimingValues final
{
public:
	struct FRotator                               SmoothedAimingRotation;                            // 0x0000(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                               SpineRotation;                                     // 0x000C(0x000C)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              AimingAngle;                                       // 0x0018(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         AimSweepTime;                                      // 0x0020(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ActualAimSweepTime;                                // 0x0024(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InputYawOffsetTime;                                // 0x0028(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ForwardYawTime;                                    // 0x002C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LeftYawTime;                                       // 0x0030(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         RightYawTime;                                      // 0x0034(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimGraphAimingValues;

// ScriptStruct ALSV4_CPP.ALSAnimGraphInAir
// 0x0010 (0x0010 - 0x0000)
struct FALSAnimGraphInAir final
{
public:
	bool                                          bJumped;                                           // 0x0000(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSecondJumped;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2[0x2];                                        // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         JumpPlayRate;                                      // 0x0004(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FallSpeed;                                         // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         LandPrediction;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FALSAnimGraphInAir;

// ScriptStruct ALSV4_CPP.ALSAnimGraphGrounded
// 0x0038 (0x0038 - 0x0000)
struct FALSAnimGraphGrounded final
{
public:
	EALSHipsDirection                             TrackedHipsDirection;                              // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMove;                                       // 0x0001(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bStopQuickness;                                    // 0x0002(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCanStop;                                          // 0x0003(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRotating;                                         // 0x0004(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPivot;                                            // 0x0005(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldMoveOnKnockedDown;                          // 0x0006(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DiagonalScaleAmount;                               // 0x0008(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WalkRunBlend;                                      // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         StandingPlayRate;                                  // 0x0010(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         CrouchingPlayRate;                                 // 0x0014(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
