#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_HuiXing_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_HuiXing_Physics.AnimBP_HuiXing_Physics_C
// 0x2050 (0x2320 - 0x02D0)
class UAnimBP_HuiXing_Physics_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x03C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x05D0(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07E0(0x0068)()
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x0850(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x0A60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x18D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1AE0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1CF0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1F00(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x2110(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_73DAE80D4C869122935B52B9115720D9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_4F19E6B24BACDD77AEC3E2AE11AA9D77();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_991195C946DF9964B53B7B8D93F3379C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_56DCCD9E49FBF9D42A5BD89839C9F6E0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_59CF56A0472B9B93D0D1FAB9B9F837BF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_63616D73449F0A527555AD9D8A44EBB7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_644575CD42FD532B55582299B13EBA96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_EA1AEFEB44241D49E08EDB9095188E8C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_3B26977C41B51B99C91971824DBE121D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_BA05CF1D47916B46CE6719BED537BDCD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_FC46EE434D56FA04762CA18F9872223F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_DD46FAF2446475474F964E901B7BC062();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_C4968B62444A3E9871B8128A7984D91C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_4A0126F648921E279BD1EEAFC2E92E54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_HuiXing_Physics_AnimGraphNode_KawaiiPhysics_59BEDDFC46395A46A0E227AAD9932B89();
	void ExecuteUbergraph_AnimBP_HuiXing_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_HuiXing_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_HuiXing_Physics_C")
	}
	static class UAnimBP_HuiXing_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_HuiXing_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_HuiXing_Physics_C;

}

