#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Aika_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Aika_Physics.AnimBP_Aika_Physics_C
// 0x30D0 (0x33A0 - 0x02D0)
class UAnimBP_Aika_Physics_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0x03A0(0x0210)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x05B0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x05D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_20;                    // 0x07E0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x09F0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x0C00(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x0E10(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x1020(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x1230(0x0068)()
	uint8                                         Pad_1298[0x8];                                     // 0x1298(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x18D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x1AE0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x1CF0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x1F00(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x2110(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2320(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2530(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2740(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2950(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x2B60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x2D70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x2F80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3190(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_8AB4E27547A95C870B784785A5A3EFA9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_0A598A574519F575AEDB418BD0AD864B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_365121B946E7373A946A4C8C2A78D32C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_71C2FE86466076AC13AA94AEA42B313F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_C0D594184942C7C758C84FA117AF9D54();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_04DD0DED429DC8BBB48B02BC5172097C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_B19D370F485D5B1C23751CA3D2395868();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_A93B5AF441F146A11D6A65919A6B42EA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_7B51576E405026856321D7A7BB930700();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_C813388244F1101A24491CB6DCE24AB3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_E19FF4A641B198350B57BA843521C3C4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_AE8418A54D2D8EEF0295EB8B5CCCFBEB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_DD1434694386C9D6BF046081AA0BC392();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_C985825640AC72086EFB61A991651933();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_3C0BDDF841B51DF3EE4133AE701B1395();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_B5BF16954D1E6AEC669DF6B110B6C10A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_3A2EFF1840821A6D8CF58D8094F027F7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_41D547C8482606174B77D5892F725F14();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_690F8C4746F5F9CA944918A063BD6E13();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_AA596AB44A7C14AEBC3E278E918062EC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_A865C1664D887B7C7E18158C0E00E727();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_96F93B6748F74F70A2D589BED42DFAD8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Aika_Physics_AnimGraphNode_KawaiiPhysics_09BBB4EF4E06C267B5D45587F8F1296A();
	void ExecuteUbergraph_AnimBP_Aika_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Aika_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Aika_Physics_C")
	}
	static class UAnimBP_Aika_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Aika_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Aika_Physics_C;

}

