#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Chiyo_Cloth_Physics

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Chiyo_Cloth_Physics.AnimBP_Chiyo_Cloth_Physics_C
// 0x02A0 (0x0570 - 0x02D0)
class UAnimBP_Chiyo_Cloth_Physics_C final : public UCyClothAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0308(0x0138)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0440(0x0098)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x04D8(0x0098)()

public:
	void AnimGraph(const struct FPoseLink& BaseLayerInput, const struct FPoseLink& OverlayLayerInput, struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AnimBP_Chiyo_Cloth_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Chiyo_Cloth_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Chiyo_Cloth_Physics_C")
	}
	static class UAnimBP_Chiyo_Cloth_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Chiyo_Cloth_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Chiyo_Cloth_Physics_C;

}

