#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Meredith_Physics_S103

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Meredith_Physics_S103.AnimBP_Meredith_Physics_S103_C
// 0x1810 (0x1AE0 - 0x02D0)
class UAnimBP_Meredith_Physics_S103_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x03C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x05D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x07E0(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x09F0(0x0068)()
	uint8                                         Pad_A58[0x8];                                      // 0x0A58(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x0A60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x18D0(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_29399E4148EC0BC54AFAED8EA9F105CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_F311E8B043DF6657F72DBBAAE98CF4EF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_531D7334403A970E15DE199144DF31A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_86ED34D0438B2178687167A31FBC79FD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_EBE27B5841DAE8E6BFB44BAA02CE8B82();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_F2093F094523CBB8A83943B3F085B49C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_3AC5CABC4BA7E549B56D7884D6F8999B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_CF113D7E431002F75E6EC1B65F6C9D14();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_82268FF14F1123503CC559AB4E3F6EF7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_60E692B34DBE709DD8DB69B48AF01E19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Meredith_Physics_S103_AnimGraphNode_KawaiiPhysics_A14B22FE45AA733E4C839BB08F005848();
	void ExecuteUbergraph_AnimBP_Meredith_Physics_S103(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Meredith_Physics_S103_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Meredith_Physics_S103_C")
	}
	static class UAnimBP_Meredith_Physics_S103_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Meredith_Physics_S103_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Meredith_Physics_S103_C;

}

