#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Meredith_Physics_S103

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_Meredith_Physics_S103.AnimBP_Meredith_Physics_S103_C.AnimGraph
// 0x0020 (0x0020 - 0x0000)
struct AnimBP_Meredith_Physics_S103_C_AnimGraph final
{
public:
	struct FPoseLink                              Input;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              AnimGraph_0;                                       // 0x0010(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_AnimBP_Meredith_Physics_S103_C_AnimGraph;

// Function AnimBP_Meredith_Physics_S103.AnimBP_Meredith_Physics_S103_C.ExecuteUbergraph_AnimBP_Meredith_Physics_S103
// 0x004C (0x004C - 0x0000)
struct AnimBP_Meredith_Physics_S103_C_ExecuteUbergraph_AnimBP_Meredith_Physics_S103 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings;           // 0x0004(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_1;         // 0x001C(0x0018)(NoDestructor)
	struct FKawaiiPhysicsSettings                 K2Node_MakeStruct_KawaiiPhysicsSettings_2;         // 0x0034(0x0018)(NoDestructor)
};
DUMPER7_ASSERTS_AnimBP_Meredith_Physics_S103_C_ExecuteUbergraph_AnimBP_Meredith_Physics_S103;

}

