#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Fuchsia_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Fuchsia_Physics.AnimBP_Fuchsia_Physics_C
// 0x1600 (0x18D0 - 0x02D0)
class UAnimBP_Fuchsia_Physics_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x03C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x05D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x07E0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x09F0(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C00(0x0068)()
	uint8                                         Pad_C68[0x8];                                      // 0x0C68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x16C0(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_9424F0E34F0DD98B0ADCD0B72E6DA6BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_9CB7359641E706794042DEAA281F40E1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_E6C91F0F4962120424D73FAD0687C639();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_A15B68C9421219044C5E548825BE85D2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_E9341BCE4B066AD12CAC6E882B476436();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_74F0190A410A33FECE69CC9CBDB46CB8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_8A0C6E254149B10C8C7764B55EBDAD5E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_4CCEB6224C5ADAA97F98F19A63D8C2D5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Fuchsia_Physics_AnimGraphNode_KawaiiPhysics_812551D84ADE0FACA7E0B6A96300D544();
	void ExecuteUbergraph_AnimBP_Fuchsia_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Fuchsia_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Fuchsia_Physics_C")
	}
	static class UAnimBP_Fuchsia_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Fuchsia_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Fuchsia_Physics_C;

}

