#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Kanami_101_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Kanami_101_Physics.AnimBP_Kanami_101_Physics_C
// 0x1A20 (0x1CF0 - 0x02D0)
class UAnimBP_Kanami_101_Physics_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x03A0(0x0068)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0408(0x0020)()
	uint8                                         Pad_428[0x8];                                      // 0x0428(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x0430(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x0640(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0850(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x0A60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x18D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1AE0(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_82514A6E41CA7B51C3069F9777DF8194();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_69BA7AD9454303549FD6758976D00176();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_48AFB1C141565E24D62C79A6166661BD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_ECE8E42B4B633B12C44F7EA92E324921();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_4A0637A443F0CFB3A58B89903E72EEB9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_2D5A15F34694E3BBCDD24A827C357469();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_0856120040604F578B7001944F402E3B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_B0FA21FB4C7DDAD91C88B0B4A00C591B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_C97FDF3742C68B4FB5285FA99EE84B29();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_39A1BBC141158E9E3E63B09EA7C63A03();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_49EBF8D3427649222FAA399F5C2DBE99();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Kanami_101_Physics_AnimGraphNode_KawaiiPhysics_0F2CAF84419599A7606188B5A0962A69();
	void ExecuteUbergraph_AnimBP_Kanami_101_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Kanami_101_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Kanami_101_Physics_C")
	}
	static class UAnimBP_Kanami_101_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Kanami_101_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Kanami_101_Physics_C;

}

