#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Michele_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Michele_Physics.AnimBP_Michele_Physics_C
// 0x1500 (0x17D0 - 0x02D0)
class UAnimBP_Michele_Physics_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_2D8[0x8];                                      // 0x02D8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x02E0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x04F0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x0700(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0910(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x0B20(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x0D30(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x0F40(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1150(0x0210)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x1360(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x1380(0x0108)()
	uint8                                         Pad_1488[0x8];                                     // 0x1488(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1490(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x16A0(0x0068)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x1708(0x0098)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x17A0(0x0030)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Michele_Physics_AnimGraphNode_KawaiiPhysics_ECBA5FA24FECFBFCB72D5392F5719740();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Michele_Physics_AnimGraphNode_KawaiiPhysics_F02EB2D34DA591E633D804A1B8C98557();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Michele_Physics_AnimGraphNode_KawaiiPhysics_BC08B0464B73232BF0EA3889C1DF604A();
	void ExecuteUbergraph_AnimBP_Michele_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Michele_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Michele_Physics_C")
	}
	static class UAnimBP_Michele_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Michele_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Michele_Physics_C;

}

