#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_M82_201_LayerSetup

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AnimBP_M82_201_LayerSetup.AnimBP_M82_201_LayerSetup_C.SetupLayer
// 0x0030 (0x0030 - 0x0000)
struct AnimBP_M82_201_LayerSetup_C_SetupLayer final
{
public:
	struct FPoseLink                              BasePose;                                          // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              BlendPose;                                         // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	struct FPoseLink                              SetupLayer_0;                                      // 0x0020(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_AnimBP_M82_201_LayerSetup_C_SetupLayer;

// Function AnimBP_M82_201_LayerSetup.AnimBP_M82_201_LayerSetup_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct AnimBP_M82_201_LayerSetup_C_AnimGraph final
{
public:
	struct FPoseLink                              AnimGraph_0;                                       // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
DUMPER7_ASSERTS_AnimBP_M82_201_LayerSetup_C_AnimGraph;

// Function AnimBP_M82_201_LayerSetup.AnimBP_M82_201_LayerSetup_C.ExecuteUbergraph_AnimBP_M82_201_LayerSetup
// 0x0004 (0x0004 - 0x0000)
struct AnimBP_M82_201_LayerSetup_C_ExecuteUbergraph_AnimBP_M82_201_LayerSetup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_AnimBP_M82_201_LayerSetup_C_ExecuteUbergraph_AnimBP_M82_201_LayerSetup;

}

