#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Lawine_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Lawine_Physics.AnimBP_Lawine_Physics_C
// 0x0DC0 (0x1090 - 0x02D0)
class UAnimBP_Lawine_Physics_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x02D8(0x0020)()
	uint8                                         Pad_2F8[0x8];                                      // 0x02F8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x0300(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x0510(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x0720(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0930(0x0068)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0998(0x0098)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0A30(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x0A60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x0E80(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lawine_Physics_AnimGraphNode_KawaiiPhysics_ABBD7E324862ED1ADC833FA44228EFA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lawine_Physics_AnimGraphNode_KawaiiPhysics_CCACE4854BF0F95EEFEBFB8AF0449821();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lawine_Physics_AnimGraphNode_KawaiiPhysics_7C4EA8164E9D28DA745582B160B1346C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lawine_Physics_AnimGraphNode_KawaiiPhysics_1413BD95494EC213152FFDA1D29A2053();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Lawine_Physics_AnimGraphNode_KawaiiPhysics_2E19FA744128A21B31E663B3726AD03A();
	void ExecuteUbergraph_AnimBP_Lawine_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Lawine_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Lawine_Physics_C")
	}
	static class UAnimBP_Lawine_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Lawine_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Lawine_Physics_C;

}

