#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Yvette_Physics_206

#include "Basic.hpp"

#include "ALSV4_CPP_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Yvette_Physics_206.AnimBP_Yvette_Physics_206_C
// 0x1E40 (0x2110 - 0x02D0)
class UAnimBP_Yvette_Physics_206_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x03C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x05D0(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07E0(0x0068)()
	uint8                                         Pad_848[0x8];                                      // 0x0848(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x0850(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0A60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x18D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1AE0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1CF0(0x0210)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x1F00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x2008(0x0108)()

public:
	void AnimGraph(const struct FPoseLink& Input, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_FB616D0748E8DDFA6A66DABC32795CF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_941089C14C2AA12FA85517BD61317589();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_E7EC1DBA4718A7D8CA6605A6DEB87F73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_0BAE713449E67F3EEF4EA1AED43D7190();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_0615AD9642DDFBEB4E025F8674F03582();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_68755F414CC8F2D686E6D88EDBFFEAE5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_DA8441074C74FC56BBAB2F94553FCA45();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_1F86D8CC4E0882712589AABB98B87363();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_D9B70F9447FBCE2555BDB6A0E5B0489B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_2E0A47ED49AD5CCC01B86E8A0B9BBAF5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_C73BE2BB4C3A70385F55568A1583C8DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_C43CFEDC456369CB6A9842B3F10B167E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Yvette_Physics_206_AnimGraphNode_KawaiiPhysics_5F9E8B4B4067F8FC5687949A188783EB();
	void ExecuteUbergraph_AnimBP_Yvette_Physics_206(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Yvette_Physics_206_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Yvette_Physics_206_C")
	}
	static class UAnimBP_Yvette_Physics_206_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Yvette_Physics_206_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Yvette_Physics_206_C;

}

