#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Leona_Physics_105

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Leona_Physics_105.AnimBP_Leona_Physics_105_C
// 0x2050 (0x2320 - 0x02D0)
class UAnimBP_Leona_Physics_105_C final : public UCyLobbyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0308(0x0020)()
	uint8                                         Pad_328[0x8];                                      // 0x0328(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x0330(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x0540(0x0210)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0750(0x0098)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x07E8(0x0068)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x0850(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x0A60(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x18D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x1AE0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1CF0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1F00(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x2110(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_3BB11767477697EFCCCDDFB4E3FFC234();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_D24BA644424FDCCD8EFBB89F3D3E8C4E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_8B6151384F009F1E35F9E497B49E035B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_BB506DEA41B90E8D7565F8B2838754DD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_912F7B7C4383E63C54D52BB49A84600F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_9E7945DC44DC42459BEDFCB52236DEC8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_A59A351942A948134EC6ED9B5624EF73();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_B4DE783446096BFD9B07C282551FB63C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_6518B1344298452816615C9E70C6444A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_9CA01263476961C8EE17DAB3D09C25F8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_048E72C34A7C61694390958245A4A11A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_EA58F9CA40BDFC4EC945CF9A12DDD2B6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_CFBB3A6C458ACE358D6A9784DFB88ADA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_CF729B404D3F9208A06F6EB0FAEBA282();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Leona_Physics_105_AnimGraphNode_KawaiiPhysics_15D07F8F4FDFEB8A5BAC4CBFF67FD4E1();
	void ExecuteUbergraph_AnimBP_Leona_Physics_105(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Leona_Physics_105_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Leona_Physics_105_C")
	}
	static class UAnimBP_Leona_Physics_105_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Leona_Physics_105_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Leona_Physics_105_C;

}

