#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_M82_201_LayerSetup

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_M82_201_LayerSetup.AnimBP_M82_201_LayerSetup_C
// 0x02D0 (0x05A0 - 0x02D0)
class UAnimBP_M82_201_LayerSetup_C final : public UAnimInstance
{
public:
	uint8                                         Pad_2C8[0x8];                                      // 0x02C8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_1;                   // 0x0308(0x0098)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x03A0(0x0098)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend;                    // 0x0438(0x0138)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0570(0x0030)()

public:
	void SetupLayer(const struct FPoseLink& BasePose, const struct FPoseLink& BlendPose, struct FPoseLink* SetupLayer_0);
	void AnimGraph(struct FPoseLink* AnimGraph_0);
	void ExecuteUbergraph_AnimBP_M82_201_LayerSetup(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_M82_201_LayerSetup_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_M82_201_LayerSetup_C")
	}
	static class UAnimBP_M82_201_LayerSetup_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_M82_201_LayerSetup_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_M82_201_LayerSetup_C;

}

