#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AnimBP_Chiyo_Physics

#include "Basic.hpp"

#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "ALSV4_CPP_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_Chiyo_Physics.AnimBP_Chiyo_Physics_C
// 0x1E40 (0x2110 - 0x02D0)
class UAnimBP_Chiyo_Physics_C final : public UCyPhysicsAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x0308(0x0098)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03A0(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x03C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x05D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x07E0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x09F0(0x0210)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0C00(0x0068)()
	uint8                                         Pad_C68[0x8];                                      // 0x0C68(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x0C70(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x0E80(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x1090(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x12A0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x14B0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x16C0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x18D0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x1AE0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x1CF0(0x0210)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x1F00(0x0210)()

public:
	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph_0);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_20B7D63842CF0510D538BEA1152BE1F5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_A3C7A7394631053CB332A08257EA95C5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_E83D2A43470FB45467E04CB12E360E2E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_3A7975644B5566F35A6D5AAF400CF258();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_AB24240348ED56A182511C94C6F8BA71();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_0CE1C8A843C3FE973E750CBAF1C55DB9();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_D58D3AF24A8FD44935A809BD81133658();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_0C59ADCE48B170E8C5C11798D71091CB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_F259EA094AF4C17937208988A8156176();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_2D6EB44543ED645B48BE9BBDA86EF52D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_7D6FEA6447977DE4487D26A5DA8026DA();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_2387029C481879BFBEAC668A36F944B1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_6B718B934A63A2C926EDE9B698A25B5A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AnimBP_Chiyo_Physics_AnimGraphNode_KawaiiPhysics_52D8FFED468ED75171C22A84272D8D19();
	void ExecuteUbergraph_AnimBP_Chiyo_Physics(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("AnimBP_Chiyo_Physics_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"AnimBP_Chiyo_Physics_C")
	}
	static class UAnimBP_Chiyo_Physics_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_Chiyo_Physics_C>();
	}
};
DUMPER7_ASSERTS_UAnimBP_Chiyo_Physics_C;

}

