#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Character_Yugiri

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_PMCharacterBase_V3_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Character_Yugiri.BP_Character_Yugiri_C
// 0x0030 (0x1DE0 - 0x1DB0)
class ABP_Character_Yugiri_C final : public ABP_PMCharacterBase_V3_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1DB0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCySearchTargetsComponent*              CySearchTargets;                                   // 0x1DB8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_WeaponManager_Yugiri_C*             BP_WeaponManager_Yugiri;                           // 0x1DC0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySceneMapSummonMaskComponent*         CySceneMapSummonMask;                              // 0x1DC8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Blinking______0_C7DBF9DA487821BCABD7EDAA4AED8786;  // 0x1DD0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Blinking__Direction_C7DBF9DA487821BCABD7EDAA4AED8786; // 0x1DD4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD5[0x3];                                     // 0x1DD5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Blinking;                                          // 0x1DD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Blinking__FinishedFunc();
	void Blinking__UpdateFunc();
	void ExecuteUbergraph_BP_Character_Yugiri(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Character_Yugiri_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Character_Yugiri_C")
	}
	static class ABP_Character_Yugiri_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Character_Yugiri_C>();
	}
};
DUMPER7_ASSERTS_ABP_Character_Yugiri_C;

}

