#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Pickup15205001

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Pickup15205001.BP_Pickup15205001_C
// 0x0028 (0x0750 - 0x0728)
class ABP_Pickup15205001_C final : public ACyPickupCapsuleActor
{
public:
	class UBP_CommonOverheadComponent_C*          BP_CommonOverhead_PickUp15205001;                  // 0x0728(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySceneMapMaskComponent*               CySceneMapPickUp15205001;                          // 0x0730(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyPickupWeapon*                        CyPickupWeapon;                                    // 0x0738(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPB_PickMovement_C*                     PB_PickMovement;                                   // 0x0740(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                 Mesh;                                              // 0x0748(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_Pickup15205001_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_Pickup15205001_C")
	}
	static class ABP_Pickup15205001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Pickup15205001_C>();
	}
};
DUMPER7_ASSERTS_ABP_Pickup15205001_C;

}

