#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PMGameState_TeamMatch

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PMGameState_TeamMatch.BP_PMGameState_TeamMatch_C
// 0x0038 (0x1B60 - 0x1B28)
class ABP_PMGameState_TeamMatch_C final : public APMGameState_TeamDeath_Two
{
public:
	class UBP_GameGrowthComponent_C*              BP_GameGrowthComponent;                            // 0x1B28(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyCustomModeGameComponent*             CyCustomModeGame;                                  // 0x1B30(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyInGameDataTrack*                     CyInGameDataTrack;                                 // 0x1B38(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyGStateMonitor*                       CyGStateMonitorFightDelayRespawn;                  // 0x1B40(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyGSMonitorTeamStartFinalStage*        CyGSMonitorTeamStartFinalStage;                    // 0x1B48(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyGStatePrepare*                       CyGStatePrepare;                                   // 0x1B50(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x1B58(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("BP_PMGameState_TeamMatch_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"BP_PMGameState_TeamMatch_C")
	}
	static class ABP_PMGameState_TeamMatch_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PMGameState_TeamMatch_C>();
	}
};
DUMPER7_ASSERTS_ABP_PMGameState_TeamMatch_C;

}

