#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_S_JQ_Envi_Laboratory_desk_004

#include "Basic.hpp"

#include "PMGame_structs.hpp"


namespace SDK::Params
{

// Function BP_S_JQ_Envi_Laboratory_desk_004.BP_S_JQ_Envi_Laboratory_desk_004_C.ExecuteUbergraph_BP_S_JQ_Envi_Laboratory_desk_004
// 0x0628 (0x0628 - 0x0000)
struct BP_S_JQ_Envi_Laboratory_desk_004_C_ExecuteUbergraph_BP_S_JQ_Envi_Laboratory_desk_004 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map;            // 0x0008(0x0050)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton;                  // 0x0058(0x0090)(ContainsInstancedReference)
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map_1;          // 0x00E8(0x0050)(ContainsInstancedReference)
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map_2;          // 0x0138(0x0050)(ContainsInstancedReference)
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map_3;          // 0x0188(0x0050)(ContainsInstancedReference)
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map_4;          // 0x01D8(0x0050)(ContainsInstancedReference)
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map_5;          // 0x0228(0x0050)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton_1;                // 0x0278(0x0090)(ContainsInstancedReference)
	TMap<class UParticleSystemComponent*, struct FButtonParticleProp> K2Node_MakeMap_Map_6;          // 0x0308(0x0050)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton_2;                // 0x0358(0x0090)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton_3;                // 0x03E8(0x0090)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton_4;                // 0x0478(0x0090)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton_5;                // 0x0508(0x0090)(ContainsInstancedReference)
	struct FParticleButton                        K2Node_MakeStruct_ParticleButton_6;                // 0x0598(0x0090)(ContainsInstancedReference)
};
DUMPER7_ASSERTS_BP_S_JQ_Envi_Laboratory_desk_004_C_ExecuteUbergraph_BP_S_JQ_Envi_Laboratory_desk_004;

}

