#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HotPatcherRuntime

#include "Basic.hpp"

#include "HotPatcherRuntime_structs.hpp"


namespace SDK::Params
{

// Function HotPatcherRuntime.FlibAssetManageHelper.CombineAssetDependencies
// 0x00F0 (0x00F0 - 0x0000)
struct FlibAssetManageHelper_CombineAssetDependencies final
{
public:
	struct FAssetDependenciesInfo                 A;                                                 // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 B;                                                 // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 ReturnValue;                                       // 0x00A0(0x0050)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_CombineAssetDependencies;

// Function HotPatcherRuntime.FlibAssetManageHelper.CombineAssetsDetailAsFAssetDepenInfo
// 0x0068 (0x0068 - 0x0000)
struct FlibAssetManageHelper_CombineAssetsDetailAsFAssetDepenInfo final
{
public:
	TArray<struct FAssetDetail>                   InAssetsDetailList;                                // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 OutAssetInfo;                                      // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_CombineAssetsDetailAsFAssetDepenInfo;

// Function HotPatcherRuntime.FlibAssetManageHelper.ConvLongPackageNameToCookedPath
// 0x0068 (0x0068 - 0x0000)
struct FlibAssetManageHelper_ConvLongPackageNameToCookedPath final
{
public:
	class FString                                 InProjectAbsDir;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlatformName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InLongPackageName;                                 // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutCookedAssetPath;                                // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutCookedAssetRelativePath;                        // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OverrideCookedDir;                                 // 0x0050(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_ConvLongPackageNameToCookedPath;

// Function HotPatcherRuntime.FlibAssetManageHelper.ConvRelativeDirToAbsDir
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_ConvRelativeDirToAbsDir final
{
public:
	class FString                                 InRelativePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutAbsPath;                                        // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_ConvRelativeDirToAbsDir;

// Function HotPatcherRuntime.FlibAssetManageHelper.ExportCookPakCommandToFile
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_ExportCookPakCommandToFile final
{
public:
	TArray<class FString>                         InCommand;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InFile;                                            // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_ExportCookPakCommandToFile;

// Function HotPatcherRuntime.FlibAssetManageHelper.FilenameToPackagePath
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_FilenameToPackagePath final
{
public:
	class FString                                 InAbsPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutPackagePath;                                    // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_FilenameToPackagePath;

// Function HotPatcherRuntime.FlibAssetManageHelper.FilterNoRefAssets
// 0x0030 (0x0030 - 0x0000)
struct FlibAssetManageHelper_FilterNoRefAssets final
{
public:
	TArray<struct FAssetDetail>                   InAssetsDetail;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   OutHasRefAssetsDetail;                             // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   OutDontHasRefAssetsDetail;                         // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_FilterNoRefAssets;

// Function HotPatcherRuntime.FlibAssetManageHelper.FilterNoRefAssetsWithIgnoreFilter
// 0x0040 (0x0040 - 0x0000)
struct FlibAssetManageHelper_FilterNoRefAssetsWithIgnoreFilter final
{
public:
	TArray<struct FAssetDetail>                   InAssetsDetail;                                    // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         InIgnoreFilters;                                   // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   OutHasRefAssetsDetail;                             // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   OutDontHasRefAssetsDetail;                         // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_FilterNoRefAssetsWithIgnoreFilter;

// Function HotPatcherRuntime.FlibAssetManageHelper.FindFilesRecursive
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_FindFilesRecursive final
{
public:
	class FString                                 InStartDir;                                        // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         OutFileList;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InRecursive;                                       // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_FindFilesRecursive;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetAllEnabledModuleName
// 0x0050 (0x0050 - 0x0000)
struct FlibAssetManageHelper_GetAllEnabledModuleName final
{
public:
	TMap<class FString, class FString>            OutModules;                                        // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetAllEnabledModuleName;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetAssetPackageGUID
// 0x0020 (0x0020 - 0x0000)
struct FlibAssetManageHelper_GetAssetPackageGUID final
{
public:
	class FString                                 InPackageName;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OutGUID;                                           // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetAssetPackageGUID;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetAssetReferenceEx
// 0x0040 (0x0040 - 0x0000)
struct FlibAssetManageHelper_GetAssetReferenceEx final
{
public:
	struct FAssetDetail                           InAsset;                                           // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	TArray<EAssetRegistryDependencyTypeEx>        SearchAssetDepTypes;                               // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   OutRefAsset;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetAssetReferenceEx;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetEnableModuleAbsDir
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_GetEnableModuleAbsDir final
{
public:
	class FString                                 InModuleName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutPath;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetEnableModuleAbsDir;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetModuleNameByRelativePath
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_GetModuleNameByRelativePath final
{
public:
	class FString                                 InRelativePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutModuleName;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetModuleNameByRelativePath;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetPluginModuleAbsDir
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_GetPluginModuleAbsDir final
{
public:
	class FString                                 InPluginModuleName;                                // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutPath;                                           // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetPluginModuleAbsDir;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetRedirectorList
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_GetRedirectorList final
{
public:
	TArray<class FString>                         InFilterPackagePaths;                              // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAssetDetail>                   OutRedirector;                                     // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetRedirectorList;

// Function HotPatcherRuntime.FlibAssetManageHelper.GetSpecifyAssetDetail
// 0x0030 (0x0030 - 0x0000)
struct FlibAssetManageHelper_GetSpecifyAssetDetail final
{
public:
	class FString                                 InLongPackageName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAssetDetail                           OutAssetDetail;                                    // 0x0010(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_GetSpecifyAssetDetail;

// Function HotPatcherRuntime.FlibAssetManageHelper.LoadFileToString
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_LoadFileToString final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutString;                                         // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_LoadFileToString;

// Function HotPatcherRuntime.FlibAssetManageHelper.LongPackageNameToFilename
// 0x0020 (0x0020 - 0x0000)
struct FlibAssetManageHelper_LongPackageNameToFilename final
{
public:
	class FString                                 InLongPackageName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_LongPackageNameToFilename;

// Function HotPatcherRuntime.FlibAssetManageHelper.LongPackageNameToPackagePath
// 0x0020 (0x0020 - 0x0000)
struct FlibAssetManageHelper_LongPackageNameToPackagePath final
{
public:
	class FString                                 InLongPackageName;                                 // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_LongPackageNameToPackagePath;

// Function HotPatcherRuntime.FlibAssetManageHelper.ModuleIsEnabled
// 0x0018 (0x0018 - 0x0000)
struct FlibAssetManageHelper_ModuleIsEnabled final
{
public:
	class FString                                 InModuleName;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_ModuleIsEnabled;

// Function HotPatcherRuntime.FlibAssetManageHelper.PackagePathToFilename
// 0x0020 (0x0020 - 0x0000)
struct FlibAssetManageHelper_PackagePathToFilename final
{
public:
	class FString                                 InPackagePath;                                     // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibAssetManageHelper_PackagePathToFilename;

// Function HotPatcherRuntime.FlibAssetManageHelper.SaveStringToFile
// 0x0028 (0x0028 - 0x0000)
struct FlibAssetManageHelper_SaveStringToFile final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 inString;                                          // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibAssetManageHelper_SaveStringToFile;

// Function HotPatcherRuntime.FlibPakHelper.CloseShaderbytecode
// 0x0010 (0x0010 - 0x0000)
struct FlibPakHelper_CloseShaderbytecode final
{
public:
	class FString                                 LibraryName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPakHelper_CloseShaderbytecode;

// Function HotPatcherRuntime.FlibPakHelper.CreateFileByBytes
// 0x0028 (0x0028 - 0x0000)
struct FlibPakHelper_CreateFileByBytes final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                 InBytes;                                           // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InWriteFlag;                                       // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_CreateFileByBytes;

// Function HotPatcherRuntime.FlibPakHelper.ExecMountPak
// 0x0028 (0x0028 - 0x0000)
struct FlibPakHelper_ExecMountPak final
{
public:
	class FString                                 InPakPath;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InPakOrder;                                        // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InMountPoint;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPakHelper_ExecMountPak;

// Function HotPatcherRuntime.FlibPakHelper.GetAllMountedPaks
// 0x0010 (0x0010 - 0x0000)
struct FlibPakHelper_GetAllMountedPaks final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPakHelper_GetAllMountedPaks;

// Function HotPatcherRuntime.FlibPakHelper.GetPakOrderByPakPath
// 0x0018 (0x0018 - 0x0000)
struct FlibPakHelper_GetPakOrderByPakPath final
{
public:
	class FString                                 PakFile;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_GetPakOrderByPakPath;

// Function HotPatcherRuntime.FlibPakHelper.LoadAssetRegistry
// 0x0028 (0x0028 - 0x0000)
struct FlibPakHelper_LoadAssetRegistry final
{
public:
	class FString                                 LibraryName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LibraryDir;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_LoadAssetRegistry;

// Function HotPatcherRuntime.FlibPakHelper.LoadShaderbytecode
// 0x0028 (0x0028 - 0x0000)
struct FlibPakHelper_LoadShaderbytecode final
{
public:
	class FString                                 LibraryName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LibraryDir;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_LoadShaderbytecode;

// Function HotPatcherRuntime.FlibPakHelper.LoadShaderbytecodeInDefaultDir
// 0x0018 (0x0018 - 0x0000)
struct FlibPakHelper_LoadShaderbytecodeInDefaultDir final
{
public:
	class FString                                 LibraryName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_LoadShaderbytecodeInDefaultDir;

// Function HotPatcherRuntime.FlibPakHelper.MountPak
// 0x0030 (0x0030 - 0x0000)
struct FlibPakHelper_MountPak final
{
public:
	class FString                                 PakPath;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PakOrder;                                          // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 InMountPoint;                                      // 0x0018(0x0010)(Parm, ZeroConstructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_MountPak;

// Function HotPatcherRuntime.FlibPakHelper.OpenPSO
// 0x0018 (0x0018 - 0x0000)
struct FlibPakHelper_OpenPSO final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_OpenPSO;

// Function HotPatcherRuntime.FlibPakHelper.ScanAllVersionDescribleFiles
// 0x0010 (0x0010 - 0x0000)
struct FlibPakHelper_ScanAllVersionDescribleFiles final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPakHelper_ScanAllVersionDescribleFiles;

// Function HotPatcherRuntime.FlibPakHelper.ScanExtenFilesInDirectory
// 0x0040 (0x0040 - 0x0000)
struct FlibPakHelper_ScanExtenFilesInDirectory final
{
public:
	class FString                                 InRelativePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InExtenPostfix;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InRecursively;                                     // 0x0020(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         OutFiles;                                          // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_ScanExtenFilesInDirectory;

// Function HotPatcherRuntime.FlibPakHelper.ScanExtenPakFiles
// 0x0010 (0x0010 - 0x0000)
struct FlibPakHelper_ScanExtenPakFiles final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPakHelper_ScanExtenPakFiles;

// Function HotPatcherRuntime.FlibPakHelper.ScanPlatformDirectory
// 0x0030 (0x0030 - 0x0000)
struct FlibPakHelper_ScanPlatformDirectory final
{
public:
	class FString                                 InRelativePath;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeFile;                                      // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeDir;                                       // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bRecursively;                                      // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         OutResault;                                        // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_ScanPlatformDirectory;

// Function HotPatcherRuntime.FlibPakHelper.UnMountPak
// 0x0018 (0x0018 - 0x0000)
struct FlibPakHelper_UnMountPak final
{
public:
	class FString                                 PakPath;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPakHelper_UnMountPak;

// Function HotPatcherRuntime.FlibPatchParserHelper.CloseShaderbytecode
// 0x0010 (0x0010 - 0x0000)
struct FlibPatchParserHelper_CloseShaderbytecode final
{
public:
	class FString                                 LibraryName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_CloseShaderbytecode;

// Function HotPatcherRuntime.FlibPatchParserHelper.DiffVersionAssets
// 0x0198 (0x0198 - 0x0000)
struct FlibPatchParserHelper_DiffVersionAssets final
{
public:
	struct FAssetDependenciesInfo                 InNewVersion;                                      // 0x0000(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 InBaseVersion;                                     // 0x0050(0x0050)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 OutAddAsset;                                       // 0x00A0(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 OutModifyAsset;                                    // 0x00F0(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	struct FAssetDependenciesInfo                 OutDeleteAsset;                                    // 0x0140(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0190(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_191[0x7];                                      // 0x0191(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPatchParserHelper_DiffVersionAssets;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetAllExFilesByPlatform
// 0x0048 (0x0048 - 0x0000)
struct FlibPatchParserHelper_GetAllExFilesByPlatform final
{
public:
	struct FPlatformExternAssets                  InPlatformConf;                                    // 0x0000(0x0028)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	bool                                          InGeneratedHash;                                   // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	EHashCalculator                               HashCalculator;                                    // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlatformExternFiles                   ReturnValue;                                       // 0x0030(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetAllExFilesByPlatform;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetAvailableMaps
// 0x0028 (0x0028 - 0x0000)
struct FlibPatchParserHelper_GetAvailableMaps final
{
public:
	class FString                                 GameName;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludeEngineMaps;                                 // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          IncludePluginMaps;                                 // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          Sorted;                                            // 0x0012(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_13[0x5];                                       // 0x0013(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         ReturnValue;                                       // 0x0018(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetAvailableMaps;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetCookedAssetRegistryFiles
// 0x0048 (0x0048 - 0x0000)
struct FlibPatchParserHelper_GetCookedAssetRegistryFiles final
{
public:
	class FString                                 InProjectAbsDir;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlatformName;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutFiles;                                          // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetCookedAssetRegistryFiles;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetCookedGlobalShaderCacheFiles
// 0x0030 (0x0030 - 0x0000)
struct FlibPatchParserHelper_GetCookedGlobalShaderCacheFiles final
{
public:
	class FString                                 InProjectDir;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlatformName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetCookedGlobalShaderCacheFiles;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetCookedShaderBytecodeFiles
// 0x0050 (0x0050 - 0x0000)
struct FlibPatchParserHelper_GetCookedShaderBytecodeFiles final
{
public:
	class FString                                 InProjectAbsDir;                                   // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InProjectName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlatformName;                                    // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InGalobalBytecode;                                 // 0x0030(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          InProjectBytecode;                                 // 0x0031(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_32[0x6];                                       // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         OutFiles;                                          // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetCookedShaderBytecodeFiles;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetEnabledPluginConfigs
// 0x0020 (0x0020 - 0x0000)
struct FlibPatchParserHelper_GetEnabledPluginConfigs final
{
public:
	class FString                                 InPlatformName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetEnabledPluginConfigs;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetEngineConfigs
// 0x0020 (0x0020 - 0x0000)
struct FlibPatchParserHelper_GetEngineConfigs final
{
public:
	class FString                                 InPlatformName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetEngineConfigs;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetIniConfigs
// 0x0030 (0x0030 - 0x0000)
struct FlibPatchParserHelper_GetIniConfigs final
{
public:
	class FString                                 InSearchDir;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlatformName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetIniConfigs;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetPakFileInfo
// 0x0040 (0x0040 - 0x0000)
struct FlibPatchParserHelper_GetPakFileInfo final
{
public:
	class FString                                 InFile;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPakFileInfo                           OutFileInfo;                                       // 0x0010(0x0028)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0038(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetPakFileInfo;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetProjectFilePath
// 0x0010 (0x0010 - 0x0000)
struct FlibPatchParserHelper_GetProjectFilePath final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetProjectFilePath;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetProjectIniFiles
// 0x0030 (0x0030 - 0x0000)
struct FlibPatchParserHelper_GetProjectIniFiles final
{
public:
	class FString                                 InProjectDir;                                      // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InPlatformName;                                    // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetProjectIniFiles;

// Function HotPatcherRuntime.FlibPatchParserHelper.GetProjectName
// 0x0010 (0x0010 - 0x0000)
struct FlibPatchParserHelper_GetProjectName final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_GetProjectName;

// Function HotPatcherRuntime.FlibPatchParserHelper.HashStringWithSHA1
// 0x0020 (0x0020 - 0x0000)
struct FlibPatchParserHelper_HashStringWithSHA1 final
{
public:
	class FString                                 inString;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibPatchParserHelper_HashStringWithSHA1;

// Function HotPatcherRuntime.FlibPatchParserHelper.LoadShaderbytecode
// 0x0028 (0x0028 - 0x0000)
struct FlibPatchParserHelper_LoadShaderbytecode final
{
public:
	class FString                                 LibraryName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LibraryDir;                                        // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibPatchParserHelper_LoadShaderbytecode;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.EnableLogPSO
// 0x0002 (0x0002 - 0x0000)
struct FlibShaderPipelineCacheHelper_EnableLogPSO final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_EnableLogPSO;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.EnableSaveBoundPSOLog
// 0x0002 (0x0002 - 0x0000)
struct FlibShaderPipelineCacheHelper_EnableSaveBoundPSOLog final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_EnableSaveBoundPSOLog;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.EnableShaderPipelineCache
// 0x0002 (0x0002 - 0x0000)
struct FlibShaderPipelineCacheHelper_EnableShaderPipelineCache final
{
public:
	bool                                          bEnable;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_EnableShaderPipelineCache;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.IsEnabledLogPSO
// 0x0001 (0x0001 - 0x0000)
struct FlibShaderPipelineCacheHelper_IsEnabledLogPSO final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_IsEnabledLogPSO;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.IsEnabledSaveBoundPSOLog
// 0x0001 (0x0001 - 0x0000)
struct FlibShaderPipelineCacheHelper_IsEnabledSaveBoundPSOLog final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_IsEnabledSaveBoundPSOLog;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.IsEnabledUsePSO
// 0x0001 (0x0001 - 0x0000)
struct FlibShaderPipelineCacheHelper_IsEnabledUsePSO final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_IsEnabledUsePSO;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.LoadShaderPipelineCache
// 0x0018 (0x0018 - 0x0000)
struct FlibShaderPipelineCacheHelper_LoadShaderPipelineCache final
{
public:
	class FString                                 Name_0;                                            // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_LoadShaderPipelineCache;

// Function HotPatcherRuntime.FlibShaderPipelineCacheHelper.SavePipelineFileCache
// 0x0002 (0x0002 - 0x0000)
struct FlibShaderPipelineCacheHelper_SavePipelineFileCache final
{
public:
	EPSOSaveMode                                  Mode;                                              // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FlibShaderPipelineCacheHelper_SavePipelineFileCache;

}

