#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: JLog

#include "Basic.hpp"

#include "JLog_structs.hpp"


namespace SDK::Params
{

// Function JLog.PMCliJLogApi.SerializeActivityFlow
// 0x01F8 (0x01F8 - 0x0000)
struct PMCliJLogApi_SerializeActivityFlow final
{
public:
	struct FActivityFlow                          StData;                                            // 0x0000(0x01E8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x01E8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeActivityFlow;

// Function JLog.PMCliJLogApi.SerializeBackGroundAppliedData_DLog
// 0x0150 (0x0150 - 0x0000)
struct PMCliJLogApi_SerializeBackGroundAppliedData_DLog final
{
public:
	struct FBackGroundAppliedData_DLog            StData;                                            // 0x0000(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0140(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeBackGroundAppliedData_DLog;

// Function JLog.PMCliJLogApi.SerializeClientNetDelay
// 0x00A8 (0x00A8 - 0x0000)
struct PMCliJLogApi_SerializeClientNetDelay final
{
public:
	struct FClientNetDelay                        StData;                                            // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0098(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeClientNetDelay;

// Function JLog.PMCliJLogApi.SerializeCustomEvent
// 0x01C8 (0x01C8 - 0x0000)
struct PMCliJLogApi_SerializeCustomEvent final
{
public:
	struct FCustomEvent                           StData;                                            // 0x0000(0x01B8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x01B8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeCustomEvent;

// Function JLog.PMCliJLogApi.SerializeFunnelAnalysis
// 0x01D0 (0x01D0 - 0x0000)
struct PMCliJLogApi_SerializeFunnelAnalysis final
{
public:
	struct FFunnelAnalysis                        StData;                                            // 0x0000(0x01C0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x01C0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeFunnelAnalysis;

// Function JLog.PMCliJLogApi.SerializeGameChatContent
// 0x01A0 (0x01A0 - 0x0000)
struct PMCliJLogApi_SerializeGameChatContent final
{
public:
	struct FGameChatContent                       StData;                                            // 0x0000(0x0190)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0190(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeGameChatContent;

// Function JLog.PMCliJLogApi.SerializeGameCreditScore
// 0x0150 (0x0150 - 0x0000)
struct PMCliJLogApi_SerializeGameCreditScore final
{
public:
	struct FGameCreditScore                       StData;                                            // 0x0000(0x0140)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0140(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeGameCreditScore;

// Function JLog.PMCliJLogApi.SerializeJLogCommonData
// 0x0138 (0x0138 - 0x0000)
struct PMCliJLogApi_SerializeJLogCommonData final
{
public:
	struct FJLogCommonData                        StData;                                            // 0x0000(0x0128)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0128(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeJLogCommonData;

// Function JLog.PMCliJLogApi.SerializeLoginClientFlow
// 0x00D8 (0x00D8 - 0x0000)
struct PMCliJLogApi_SerializeLoginClientFlow final
{
public:
	struct FLoginClientFlow                       StData;                                            // 0x0000(0x00C8)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x00C8(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeLoginClientFlow;

// Function JLog.PMCliJLogApi.SerializeLoginFlow
// 0x0160 (0x0160 - 0x0000)
struct PMCliJLogApi_SerializeLoginFlow final
{
public:
	struct FLoginFlow                             StData;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0150(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeLoginFlow;

// Function JLog.PMCliJLogApi.SerializeNoviceGuideTask_DLog
// 0x0198 (0x0198 - 0x0000)
struct PMCliJLogApi_SerializeNoviceGuideTask_DLog final
{
public:
	struct FNoviceGuideTask_DLog                  StData;                                            // 0x0000(0x0188)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0188(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeNoviceGuideTask_DLog;

// Function JLog.PMCliJLogApi.SerializePayAnalysis
// 0x02F0 (0x02F0 - 0x0000)
struct PMCliJLogApi_SerializePayAnalysis final
{
public:
	struct FPayAnalysis                           StData;                                            // 0x0000(0x02E0)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x02E0(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializePayAnalysis;

// Function JLog.PMCliJLogApi.SerializeUgcBuildCountData_DLog
// 0x0160 (0x0160 - 0x0000)
struct PMCliJLogApi_SerializeUgcBuildCountData_DLog final
{
public:
	struct FUgcBuildCountData_DLog                StData;                                            // 0x0000(0x0150)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0150(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeUgcBuildCountData_DLog;

// Function JLog.PMCliJLogApi.SerializeUgcCubeUsageData_DLog
// 0x0180 (0x0180 - 0x0000)
struct PMCliJLogApi_SerializeUgcCubeUsageData_DLog final
{
public:
	struct FUgcCubeUsageData_DLog                 StData;                                            // 0x0000(0x0170)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0170(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMCliJLogApi_SerializeUgcCubeUsageData_DLog;

}

