#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PMGame

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"
#include "PMGame_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "AIModule_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "ALSV4_CPP_structs.hpp"
#include "JLog_structs.hpp"
#include "AssetRegistry_structs.hpp"
#include "Slate_structs.hpp"


namespace SDK::Params
{

// Function PMGame.CyBaseAtom.DebugAtomInternal
// 0x0098 (0x0098 - 0x0000)
struct CyBaseAtom_DebugAtomInternal final
{
public:
	struct FAbilityDebugInfo                      DebugInfo;                                         // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseAtom_DebugAtomInternal;

// Function PMGame.CyGAAtom.Lua_GetAbilitySystemComponent
// 0x0010 (0x0010 - 0x0000)
struct CyGAAtom_Lua_GetAbilitySystemComponent final
{
public:
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UAbilitySystemComponent*                ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetAbilitySystemComponent;

// Function PMGame.CyGAAtom.Lua_GetCharacter
// 0x0010 (0x0010 - 0x0000)
struct CyGAAtom_Lua_GetCharacter final
{
public:
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ACharacter*                             ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetCharacter;

// Function PMGame.CyGAAtom.Lua_GetOwnerCharacter
// 0x0010 (0x0010 - 0x0000)
struct CyGAAtom_Lua_GetOwnerCharacter final
{
public:
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ACyCharacterBase*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetOwnerCharacter;

// Function PMGame.CyGAAtom.Lua_GetOwnerInventory
// 0x0010 (0x0010 - 0x0000)
struct CyGAAtom_Lua_GetOwnerInventory final
{
public:
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UCyWeaponManagerBaseComponent*          ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetOwnerInventory;

// Function PMGame.CyGAAtom.Lua_GetOwnerPlayerState
// 0x0010 (0x0010 - 0x0000)
struct CyGAAtom_Lua_GetOwnerPlayerState final
{
public:
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ACyPlayerState*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetOwnerPlayerState;

// Function PMGame.CyGAAtom.Lua_GetOwnerPMCharacter
// 0x0010 (0x0010 - 0x0000)
struct CyGAAtom_Lua_GetOwnerPMCharacter final
{
public:
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0000(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class APMCharacter*                           ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetOwnerPMCharacter;

// Function PMGame.CyGAAtom.Lua_GetOwnerWeapon
// 0x0018 (0x0018 - 0x0000)
struct CyGAAtom_Lua_GetOwnerWeapon final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class ACyWeaponBase*                          ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtom_Lua_GetOwnerWeapon;

// Function PMGame.CyGAAtom.Lua_HasAuthority
// 0x0038 (0x0038 - 0x0000)
struct CyGAAtom_Lua_HasAuthority final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtom_Lua_HasAuthority;

// Function PMGame.CyGAAtom.Lua_HasExecutePermission
// 0x0038 (0x0038 - 0x0000)
struct CyGAAtom_Lua_HasExecutePermission final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtom_Lua_HasExecutePermission;

// Function PMGame.CyGAAtom.Lua_HasNetworkAuthority
// 0x0038 (0x0038 - 0x0000)
struct CyGAAtom_Lua_HasNetworkAuthority final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtom_Lua_HasNetworkAuthority;

// Function PMGame.CyGAAtom.Lua_IsLocallyControlled
// 0x0038 (0x0038 - 0x0000)
struct CyGAAtom_Lua_IsLocallyControlled final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtom_Lua_IsLocallyControlled;

// Function PMGame.CyGAAtom.Lua_IsLocalOnly
// 0x0038 (0x0038 - 0x0000)
struct CyGAAtom_Lua_IsLocalOnly final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0008(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0010(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0030(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtom_Lua_IsLocalOnly;

// Function PMGame.CyGAAtomTrigger.CanExecuteOverride
// 0x0048 (0x0048 - 0x0000)
struct CyGAAtomTrigger_CanExecuteOverride final
{
public:
	class UCyBaseAbility*                         Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLuaGameplayEventData                  TriggerEventData;                                  // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtomTrigger_CanExecuteOverride;

// Function PMGame.CyGAAtomTrigger.ExecuteOverride
// 0x0040 (0x0040 - 0x0000)
struct CyGAAtomTrigger_ExecuteOverride final
{
public:
	class UCyBaseAbility*                         Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLuaGameplayEventData                  TriggerEventData;                                  // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtomTrigger_ExecuteOverride;

// Function PMGame.CyGAAtomTrigger.TryExecuteOverride
// 0x0040 (0x0040 - 0x0000)
struct CyGAAtomTrigger_TryExecuteOverride final
{
public:
	class UCyBaseAbility*                         Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLuaGameplayEventData                  TriggerEventData;                                  // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtomTrigger_TryExecuteOverride;

// Function PMGame.CyBaseComponent.OnAttributeSkinIDChangedOverride
// 0x0004 (0x0004 - 0x0000)
struct CyBaseComponent_OnAttributeSkinIDChangedOverride final
{
public:
	int32                                         InSkinID;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_OnAttributeSkinIDChangedOverride;

// Function PMGame.CyBaseComponent.OnRestartPlayerAfterOverride
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_OnRestartPlayerAfterOverride final
{
public:
	class AController*                            NewPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_OnRestartPlayerAfterOverride;

// Function PMGame.CyBaseComponent.OnRestartPlayerBeforeOverride
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_OnRestartPlayerBeforeOverride final
{
public:
	class AController*                            NewPlayer;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_OnRestartPlayerBeforeOverride;

// Function PMGame.CyBaseComponent.SetDefaultsOverride
// 0x0001 (0x0001 - 0x0000)
struct CyBaseComponent_SetDefaultsOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_SetDefaultsOverride;

// Function PMGame.CyBaseComponent.GetAbilitySystem
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_GetAbilitySystem final
{
public:
	class UCyAbilitySystemComponent*              ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetAbilitySystem;

// Function PMGame.CyBaseComponent.GetActorInstigator
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_GetActorInstigator final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetActorInstigator;

// Function PMGame.CyBaseComponent.GetActorInstigatorRole
// 0x0001 (0x0001 - 0x0000)
struct CyBaseComponent_GetActorInstigatorRole final
{
public:
	ENetRole                                      ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetActorInstigatorRole;

// Function PMGame.CyBaseComponent.GetActorOwner
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_GetActorOwner final
{
public:
	class AActor*                                 ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetActorOwner;

// Function PMGame.CyBaseComponent.GetAttributeLevel
// 0x0004 (0x0004 - 0x0000)
struct CyBaseComponent_GetAttributeLevel final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetAttributeLevel;

// Function PMGame.CyBaseComponent.GetAttributeTeamID
// 0x0001 (0x0001 - 0x0000)
struct CyBaseComponent_GetAttributeTeamID final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetAttributeTeamID;

// Function PMGame.CyBaseComponent.GetBaseAttributeSet
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_GetBaseAttributeSet final
{
public:
	class UCyBaseAttributeSet*                    ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetBaseAttributeSet;

// Function PMGame.CyBaseComponent.GetInstigatorPlayerState
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_GetInstigatorPlayerState final
{
public:
	class ACyPlayerState*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetInstigatorPlayerState;

// Function PMGame.CyBaseComponent.GetSkinComponent
// 0x0008 (0x0008 - 0x0000)
struct CyBaseComponent_GetSkinComponent final
{
public:
	class UCyBaseSkinComponent*                   ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyBaseComponent_GetSkinComponent;

// Function PMGame.CyGAAtomActivator.OnActivateAbilityOverride
// 0x0040 (0x0040 - 0x0000)
struct CyGAAtomActivator_OnActivateAbilityOverride final
{
public:
	class UCyBaseAbility*                         Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLuaGameplayEventData                  TriggerEventData;                                  // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyGAAtomActivator_OnActivateAbilityOverride;

// Function PMGame.CyGAAtomActivator.OnEndAbilityOverride
// 0x0040 (0x0040 - 0x0000)
struct CyGAAtomActivator_OnEndAbilityOverride final
{
public:
	class UCyBaseAbility*                         Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bReplicateEndAbility;                              // 0x0038(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bWasCancelled;                                     // 0x0039(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtomActivator_OnEndAbilityOverride;

// Function PMGame.CyGAAtomActivator.CanActivateAbilityOverride
// 0x0048 (0x0048 - 0x0000)
struct CyGAAtomActivator_CanActivateAbilityOverride final
{
public:
	class UCyBaseAbility*                         Ability;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLuaGameplayEventData                  TriggerEventData;                                  // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGAAtomActivator_CanActivateAbilityOverride;

// Function PMGame.CyGATriggerCheck.CanExecuteOverride
// 0x0048 (0x0048 - 0x0000)
struct CyGATriggerCheck_CanExecuteOverride final
{
public:
	const class UCyBaseAbility*                   Ability;                                           // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAbilitySpecHandle             Handle;                                            // 0x0008(0x0008)(ConstParm, Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLuaGameplayAbilityActorInfo           ActorInfo;                                         // 0x0010(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FGameplayAbilityActivationInfo         ActivationInfo;                                    // 0x0018(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FLuaGameplayEventData                  TriggerEventData;                                  // 0x0038(0x0008)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0040(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyGATriggerCheck_CanExecuteOverride;

// Function PMGame.CyWeaponComponent.GetMachine
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetMachine final
{
public:
	class UCyFMachine*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetMachine;

// Function PMGame.CyWeaponComponent.SetDefaultsOverride
// 0x0001 (0x0001 - 0x0000)
struct CyWeaponComponent_SetDefaultsOverride final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_SetDefaultsOverride;

// Function PMGame.CyWeaponComponent.GetCharacterAkComponent
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetCharacterAkComponent final
{
public:
	class UAkComponent*                           ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetCharacterAkComponent;

// Function PMGame.CyWeaponComponent.GetCharacterMachine
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetCharacterMachine final
{
public:
	class UCyCMachine*                            ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetCharacterMachine;

// Function PMGame.CyWeaponComponent.GetGameState
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetGameState final
{
public:
	class APMGameState*                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetGameState;

// Function PMGame.CyWeaponComponent.GetOwnerAbilitySystemComponent
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetOwnerAbilitySystemComponent final
{
public:
	class UAbilitySystemComponent*                ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetOwnerAbilitySystemComponent;

// Function PMGame.CyWeaponComponent.GetOwnerCharacter
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetOwnerCharacter final
{
public:
	class ACyCharacterBase*                       ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetOwnerCharacter;

// Function PMGame.CyWeaponComponent.GetOwnerController
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetOwnerController final
{
public:
	class ACyPlayerController*                    ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetOwnerController;

// Function PMGame.CyWeaponComponent.GetOwnerPawn
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetOwnerPawn final
{
public:
	class APawn*                                  ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetOwnerPawn;

// Function PMGame.CyWeaponComponent.GetOwnerWeapon
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetOwnerWeapon final
{
public:
	class ACyWeaponBase*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetOwnerWeapon;

// Function PMGame.CyWeaponComponent.GetWeaponManager
// 0x0008 (0x0008 - 0x0000)
struct CyWeaponComponent_GetWeaponManager final
{
public:
	class UCyWeaponManagerBaseComponent*          ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_GetWeaponManager;

// Function PMGame.CyWeaponComponent.IsComponentEnabled
// 0x0001 (0x0001 - 0x0000)
struct CyWeaponComponent_IsComponentEnabled final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyWeaponComponent_IsComponentEnabled;

// Function PMGame.CyFState.DebugFStateInternal
// 0x0098 (0x0098 - 0x0000)
struct CyFState_DebugFStateInternal final
{
public:
	struct FAbilityDebugInfo                      DebugInfo;                                         // 0x0000(0x0098)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFState_DebugFStateInternal;

// Function PMGame.CyFSwitcher.ServerEmptyToState
// 0x0018 (0x0018 - 0x0000)
struct CyFSwitcher_ServerEmptyToState final
{
public:
	struct FNetStateData                          InStateData;                                       // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFSwitcher_ServerEmptyToState;

// Function PMGame.CyFSwitcher.ServerGotoState
// 0x0018 (0x0018 - 0x0000)
struct CyFSwitcher_ServerGotoState final
{
public:
	struct FNetStateData                          InStateData;                                       // 0x0000(0x0018)(ConstParm, Parm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFSwitcher_ServerGotoState;

// Function PMGame.CyFSwitcher.ServerGotoStates
// 0x0018 (0x0018 - 0x0000)
struct CyFSwitcher_ServerGotoStates final
{
public:
	TArray<struct FNetStateData>                  InStatesData;                                      // 0x0000(0x0010)(ConstParm, Parm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEmpty;                                            // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_CyFSwitcher_ServerGotoStates;

// Function PMGame.CyFAttackSwitcher.CanStartAttack
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_CanStartAttack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_CanStartAttack;

// Function PMGame.CyFAttackSwitcher.CanStopAttack
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_CanStopAttack final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_CanStopAttack;

// Function PMGame.CyFAttackSwitcher.GetSwitchAttackTypeInInfoMap
// 0x0002 (0x0002 - 0x0000)
struct CyFAttackSwitcher_GetSwitchAttackTypeInInfoMap final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EFAttackType                                  ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetSwitchAttackTypeInInfoMap;

// Function PMGame.CyFAttackSwitcher.HandleConsume
// 0x0002 (0x0002 - 0x0000)
struct CyFAttackSwitcher_HandleConsume final
{
public:
	bool                                          bPredict;                                          // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_HandleConsume;

// Function PMGame.CyFAttackSwitcher.HasEnoughAmmoInMagazine
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_HasEnoughAmmoInMagazine final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_HasEnoughAmmoInMagazine;

// Function PMGame.CyFAttackSwitcher.IsAttackableState
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_IsAttackableState final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_IsAttackableState;

// Function PMGame.CyFAttackSwitcher.IsKeepAttacking
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_IsKeepAttacking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_IsKeepAttacking;

// Function PMGame.CyFAttackSwitcher.SetDefaultAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_SetDefaultAttackType final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_SetDefaultAttackType;

// Function PMGame.CyFAttackSwitcher.SetMobileDefaultAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_SetMobileDefaultAttackType final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_SetMobileDefaultAttackType;

// Function PMGame.CyFAttackSwitcher.SetSwitchedAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_SetSwitchedAttackType final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_SetSwitchedAttackType;

// Function PMGame.CyFAttackSwitcher.TestHandleConsume
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_TestHandleConsume final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_TestHandleConsume;

// Function PMGame.CyFAttackSwitcher.CheckSwitchAttackTypeInInfoMap
// 0x0002 (0x0002 - 0x0000)
struct CyFAttackSwitcher_CheckSwitchAttackTypeInInfoMap final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_CheckSwitchAttackTypeInInfoMap;

// Function PMGame.CyFAttackSwitcher.ContainsAttackType
// 0x0002 (0x0002 - 0x0000)
struct CyFAttackSwitcher_ContainsAttackType final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_ContainsAttackType;

// Function PMGame.CyFAttackSwitcher.GetAttackCount
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetAttackCount final
{
public:
	uint8                                         ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetAttackCount;

// Function PMGame.CyFAttackSwitcher.GetAttackPartMagazine
// 0x0008 (0x0008 - 0x0000)
struct CyFAttackSwitcher_GetAttackPartMagazine final
{
public:
	class UCyPartMagazine*                        ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetAttackPartMagazine;

// Function PMGame.CyFAttackSwitcher.GetAttackSwitchByAttackType
// 0x0010 (0x0010 - 0x0000)
struct CyFAttackSwitcher_GetAttackSwitchByAttackType final
{
public:
	EFAttackType                                  InAttackType;                                      // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCyFAttackSwitch*                       ReturnValue;                                       // 0x0008(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetAttackSwitchByAttackType;

// Function PMGame.CyFAttackSwitcher.GetAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetAttackType final
{
public:
	EFAttackType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetAttackType;

// Function PMGame.CyFAttackSwitcher.GetAttackTypeCustom
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetAttackTypeCustom final
{
public:
	EFAttackType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetAttackTypeCustom;

// Function PMGame.CyFAttackSwitcher.GetCurrentDefaultAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetCurrentDefaultAttackType final
{
public:
	EFAttackType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetCurrentDefaultAttackType;

// Function PMGame.CyFAttackSwitcher.GetDefaultAttackSwitch
// 0x0008 (0x0008 - 0x0000)
struct CyFAttackSwitcher_GetDefaultAttackSwitch final
{
public:
	class UCyFAttackSwitch*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetDefaultAttackSwitch;

// Function PMGame.CyFAttackSwitcher.GetDefaultAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetDefaultAttackType final
{
public:
	EFAttackType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetDefaultAttackType;

// Function PMGame.CyFAttackSwitcher.GetRunningAttackSwitch
// 0x0008 (0x0008 - 0x0000)
struct CyFAttackSwitcher_GetRunningAttackSwitch final
{
public:
	class UCyFAttackSwitch*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetRunningAttackSwitch;

// Function PMGame.CyFAttackSwitcher.GetSwitchedAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetSwitchedAttackType final
{
public:
	EFAttackType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetSwitchedAttackType;

// Function PMGame.CyFAttackSwitcher.GetSwitchedOrDefaultAttackSwitch
// 0x0008 (0x0008 - 0x0000)
struct CyFAttackSwitcher_GetSwitchedOrDefaultAttackSwitch final
{
public:
	class UCyFAttackSwitch*                       ReturnValue;                                       // 0x0000(0x0008)(ExportObject, Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetSwitchedOrDefaultAttackSwitch;

// Function PMGame.CyFAttackSwitcher.GetSwitchedOrDefaultAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_GetSwitchedOrDefaultAttackType final
{
public:
	EFAttackType                                  ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_GetSwitchedOrDefaultAttackType;

// Function PMGame.CyFAttackSwitcher.IsAutoLeaveAttackType
// 0x0001 (0x0001 - 0x0000)
struct CyFAttackSwitcher_IsAutoLeaveAttackType final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_CyFAttackSwitcher_IsAutoLeaveAttackType;

// Function PMGame.PMBaseUserWidget.SetWidgetVisible
// 0x0010 (0x0010 - 0x0000)
struct PMBaseUserWidget_SetWidgetVisible final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	ESlateVisibility                              InVisibility;                                      // 0x0008(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0009(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PMBaseUserWidget_SetWidgetVisible;

// Function PMGame.PMBaseUserWidget.CustomHandleAnalogStickAction
// 0x0010 (0x0010 - 0x0000)
struct PMBaseUserWidget_CustomHandleAnalogStickAction final
{
public:
	struct FPMAnalogStickEvent                    AnalogStickEvent;                                  // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FPMAnalogStickResponses                Response;                                          // 0x000C(0x0001)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PMBaseUserWidget_CustomHandleAnalogStickAction;

// Function PMGame.PMBaseUserWidget.CustomHandleNavAction
// 0x0058 (0x0058 - 0x0000)
struct PMBaseUserWidget_CustomHandleNavAction final
{
public:
	struct FUINavActionReply                      Reply;                                             // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PMBaseUserWidget_CustomHandleNavAction;

// Function PMGame.PMBaseUserWidget.GetAnimation
// 0x0010 (0x0010 - 0x0000)
struct PMBaseUserWidget_GetAnimation final
{
public:
	class FName                                   AnimationName;                                     // 0x0000(0x0008)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetAnimation*                       ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GetAnimation;

// Function PMGame.PMBaseUserWidget.GetColorFromHex
// 0x0020 (0x0020 - 0x0000)
struct PMBaseUserWidget_GetColorFromHex final
{
public:
	class FString                                 HexString;                                         // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GetColorFromHex;

// Function PMGame.PMBaseUserWidget.GetCurrentWatchTeamID
// 0x0008 (0x0008 - 0x0000)
struct PMBaseUserWidget_GetCurrentWatchTeamID final
{
public:
	int32                                         TeamIDForObSpectator;                              // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0004(0x0004)(ConstParm, Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GetCurrentWatchTeamID;

// Function PMGame.PMBaseUserWidget.GetFriendSpectatorRivalWatchTeamId
// 0x0004 (0x0004 - 0x0000)
struct PMBaseUserWidget_GetFriendSpectatorRivalWatchTeamId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GetFriendSpectatorRivalWatchTeamId;

// Function PMGame.PMBaseUserWidget.GetFriendSpectatorWatchPlayerId
// 0x0004 (0x0004 - 0x0000)
struct PMBaseUserWidget_GetFriendSpectatorWatchPlayerId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GetFriendSpectatorWatchPlayerId;

// Function PMGame.PMBaseUserWidget.GetFriendSpectatorWatchTeamId
// 0x0004 (0x0004 - 0x0000)
struct PMBaseUserWidget_GetFriendSpectatorWatchTeamId final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GetFriendSpectatorWatchTeamId;

// Function PMGame.PMBaseUserWidget.GMHidePage
// 0x0001 (0x0001 - 0x0000)
struct PMBaseUserWidget_GMHidePage final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_GMHidePage;

// Function PMGame.PMBaseUserWidget.HideUWidget
// 0x0008 (0x0008 - 0x0000)
struct PMBaseUserWidget_HideUWidget final
{
public:
	class UWidget*                                Wiget;                                             // 0x0000(0x0008)(Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_HideUWidget;

// Function PMGame.PMBaseUserWidget.IsPlayingLocalReplayFile
// 0x0001 (0x0001 - 0x0000)
struct PMBaseUserWidget_IsPlayingLocalReplayFile final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_IsPlayingLocalReplayFile;

// Function PMGame.PMBaseUserWidget.K2_PostAkEvent
// 0x0010 (0x0010 - 0x0000)
struct PMBaseUserWidget_K2_PostAkEvent final
{
public:
	class UAkAudioEvent*                          InAkEvent;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bInStopOnClose;                                    // 0x0008(0x0001)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PMBaseUserWidget_K2_PostAkEvent;

// Function PMGame.PMBaseUserWidget.K2_StopAkEvent
// 0x0008 (0x0008 - 0x0000)
struct PMBaseUserWidget_K2_StopAkEvent final
{
public:
	class UAkAudioEvent*                          InAkEvent;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_K2_StopAkEvent;

// Function PMGame.PMBaseUserWidget.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct PMBaseUserWidget_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_PMBaseUserWidget_LuaHandleKeyEvent;

// Function PMGame.PMBaseUserWidget.LuaOnNavigation
// 0x0002 (0x0002 - 0x0000)
struct PMBaseUserWidget_LuaOnNavigation final
{
public:
	EUINavigation                                 UINavigationType;                                  // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_LuaOnNavigation;

// Function PMGame.PMBaseUserWidget.NativeGetOpenData
// 0x0008 (0x0008 - 0x0000)
struct PMBaseUserWidget_NativeGetOpenData final
{
public:
	class UPageOpenData*                          ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_NativeGetOpenData;

// Function PMGame.PMBaseUserWidget.OnAnimationFinishedAfterUpdateCanTick
// 0x0008 (0x0008 - 0x0000)
struct PMBaseUserWidget_OnAnimationFinishedAfterUpdateCanTick final
{
public:
	const class UWidgetAnimation*                 Animation;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_OnAnimationFinishedAfterUpdateCanTick;

// Function PMGame.PMBaseUserWidget.OnGMHidePage
// 0x0001 (0x0001 - 0x0000)
struct PMBaseUserWidget_OnGMHidePage final
{
public:
	bool                                          bHide;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PMBaseUserWidget_OnGMHidePage;

// Function PMGame.PMBaseUserWidget.PlayFSlateSound
// 0x0018 (0x0018 - 0x0000)
struct PMBaseUserWidget_PlayFSlateSound final
{
public:
	struct FSlateSound                            Sound;                                             // 0x0000(0x0018)(Parm, OutParm, NoDestructor, NativeAccessSpecifierPublic)
};
