#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Preview_Q_Mara

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Preview_Q_Mara.Preview_Q_Mara_C
// 0x0030 (0x07C0 - 0x0790)
class APreview_Q_Mara_C final : public ACySummonActor
{
public:
	class UCySceneMapTwoPointLineComponent*       CySceneMapTwoPointLine;                            // 0x0790(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySkinComponent*                       CySkin;                                            // 0x0798(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyPreviewComponent*                    CyPreview;                                         // 0x07A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   PreviewMesh;                                       // 0x07A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x07B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Preview_Q_Mara_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Preview_Q_Mara_C")
	}
	static class APreview_Q_Mara_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<APreview_Q_Mara_C>();
	}
};
DUMPER7_ASSERTS_APreview_Q_Mara_C;

}

