#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Projectile_E_Ming_Escort2

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Projectile_E_Ming_Escort2.Projectile_E_Ming_Escort2_C
// 0x0028 (0x0AF0 - 0x0AC8)
class AProjectile_E_Ming_Escort2_C final : public ACyProjectileBlastBome
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AC8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCyAIMachine*                           CyAIMachine;                                       // 0x0AD0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySceneMapSummonMaskComponent*         CySceneMapMingE;                                   // 0x0AD8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyRetainComponent*                     CyRetain;                                          // 0x0AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           Ak;                                                // 0x0AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_Projectile_E_Ming_Escort2(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Projectile_E_Ming_Escort2_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Projectile_E_Ming_Escort2_C")
	}
	static class AProjectile_E_Ming_Escort2_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AProjectile_E_Ming_Escort2_C>();
	}
};
DUMPER7_ASSERTS_AProjectile_E_Ming_Escort2_C;

}

