#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeMeshComponent

#include "Basic.hpp"

#include "RuntimeMeshComponent_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.AddIndex
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_AddIndex final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewIndex;                                          // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_AddIndex;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.AddTriangle
// 0x0018 (0x0018 - 0x0000)
struct RuntimeBlueprintMeshBuilder_AddTriangle final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index0;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index1;                                            // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index2;                                            // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0014(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_AddTriangle;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.AddVertex
// 0x0050 (0x0050 - 0x0000)
struct RuntimeBlueprintMeshBuilder_AddVertex final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InPosition;                                        // 0x0008(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0014(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTangent                    Tangent;                                           // 0x0020(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0;                                               // 0x0030(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0038(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_AddVertex;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.EmptyIndices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_EmptyIndices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Slack;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_EmptyIndices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.EmptyVertices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_EmptyVertices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Slack;                                             // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_EmptyVertices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.GetColor
// 0x0020 (0x0020 - 0x0000)
struct RuntimeBlueprintMeshBuilder_GetColor final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           ReturnValue;                                       // 0x000C(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_GetColor;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.GetIndex
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_GetIndex final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x000C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_GetIndex;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.GetNormal
// 0x0020 (0x0020 - 0x0000)
struct RuntimeBlueprintMeshBuilder_GetNormal final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_GetNormal;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.GetPosition
// 0x0018 (0x0018 - 0x0000)
struct RuntimeBlueprintMeshBuilder_GetPosition final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_GetPosition;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.GetTangent
// 0x0018 (0x0018 - 0x0000)
struct RuntimeBlueprintMeshBuilder_GetTangent final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                ReturnValue;                                       // 0x000C(0x000C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_GetTangent;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.GetUV
// 0x0018 (0x0018 - 0x0000)
struct RuntimeBlueprintMeshBuilder_GetUV final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_GetUV;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.IsReadonly
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_IsReadonly final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_IsReadonly;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.IsUsing32BitIndices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_IsUsing32BitIndices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_IsUsing32BitIndices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.IsUsingHighPrecisionTangents
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_IsUsingHighPrecisionTangents final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_IsUsingHighPrecisionTangents;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.IsUsingHighPrecisionUVs
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_IsUsingHighPrecisionUVs final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_IsUsingHighPrecisionUVs;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.NumIndices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_NumIndices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_NumIndices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.NumUVChannels
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_NumUVChannels final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_NumUVChannels;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.NumVertices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_NumVertices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0008(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_NumVertices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetColor
// 0x0020 (0x0020 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetColor final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Value;                                             // 0x000C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetColor;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetIndex
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetIndex final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Value;                                             // 0x000C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetIndex;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetNormal
// 0x0030 (0x0030 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetNormal final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Value;                                             // 0x0010(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0xC];                                       // 0x0024(0x000C)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetNormal;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetNormalTangent
// 0x0030 (0x0030 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetNormalTangent final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTangent                    Tangent;                                           // 0x0018(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0028(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetNormalTangent;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetNumIndices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetNumIndices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewNum;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetNumIndices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetNumVertices
// 0x0010 (0x0010 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetNumVertices final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         NewNum;                                            // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetNumVertices;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetPosition
// 0x0020 (0x0020 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetPosition final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Value;                                             // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetPosition;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetTangent
// 0x0020 (0x0020 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetTangent final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTangent                    Value;                                             // 0x000C(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetTangent;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetTangents
// 0x0038 (0x0038 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetTangents final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TangentX;                                          // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TangentY;                                          // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                TangentZ;                                          // 0x0024(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetTangents;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetUV
// 0x0020 (0x0020 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetUV final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Value;                                             // 0x000C(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Channel;                                           // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetUV;

// Function RuntimeMeshComponent.RuntimeBlueprintMeshBuilder.SetVertex
// 0x0050 (0x0050 - 0x0000)
struct RuntimeBlueprintMeshBuilder_SetVertex final
{
public:
	class URuntimeBlueprintMeshBuilder*           OutMeshBuilder;                                    // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Index_0;                                           // 0x0008(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                InPosition;                                        // 0x000C(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x0018(0x000C)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTangent                    Tangent;                                           // 0x0024(0x0010)(Parm, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0;                                               // 0x0034(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x003C(0x0010)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x004C(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeBlueprintMeshBuilder_SetVertex;

// Function RuntimeMeshComponent.RuntimeMesh.AddCollisionBox
// 0x0028 (0x0028 - 0x0000)
struct RuntimeMesh_AddCollisionBox final
{
public:
	struct FRuntimeMeshCollisionBox               NewBox;                                            // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_AddCollisionBox;

// Function RuntimeMeshComponent.RuntimeMesh.AddCollisionCapsule
// 0x0024 (0x0024 - 0x0000)
struct RuntimeMesh_AddCollisionCapsule final
{
public:
	struct FRuntimeMeshCollisionCapsule           NewCapsule;                                        // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_AddCollisionCapsule;

// Function RuntimeMeshComponent.RuntimeMesh.AddCollisionSphere
// 0x0014 (0x0014 - 0x0000)
struct RuntimeMesh_AddCollisionSphere final
{
public:
	struct FRuntimeMeshCollisionSphere            NewSphere;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_AddCollisionSphere;

// Function RuntimeMeshComponent.RuntimeMesh.AddConvexCollisionSection
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMesh_AddConvexCollisionSection final
{
public:
	TArray<struct FVector>                        ConvexVerts;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_AddConvexCollisionSection;

// Function RuntimeMeshComponent.RuntimeMesh.ClearConvexCollisionSection
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMesh_ClearConvexCollisionSection final
{
public:
	int32                                         ConvexSectionIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_ClearConvexCollisionSection;

// Function RuntimeMeshComponent.RuntimeMesh.ClearMeshCollisionSection
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMesh_ClearMeshCollisionSection final
{
public:
	int32                                         CollisionSectionIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_ClearMeshCollisionSection;

// Function RuntimeMeshComponent.RuntimeMesh.ClearMeshSection
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMesh_ClearMeshSection final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_ClearMeshSection;

// Function RuntimeMeshComponent.RuntimeMesh.CreateMeshSection_Blueprint
// 0x0080 (0x0080 - 0x0000)
struct RuntimeMesh_CreateMeshSection_Blueprint final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Vertices;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeMeshTangent>            Tangents;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV0;                                               // 0x0048(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector2D>                      UV1;                                               // 0x0058(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                   Colors;                                            // 0x0068(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateCollision;                                  // 0x0078(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCalculateNormalTangent;                           // 0x0079(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCreateHardTangents;                         // 0x007A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateTessellationTriangles;                    // 0x007B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateFrequency                              UpdateFrequency;                                   // 0x007C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionTangents;                         // 0x007D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionUVs;                              // 0x007E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_7F[0x1];                                       // 0x007F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_CreateMeshSection_Blueprint;

// Function RuntimeMeshComponent.RuntimeMesh.CreateMeshSectionFromBuilder
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMesh_CreateMeshSectionFromBuilder final
{
public:
	int32                                         SectionID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URuntimeBlueprintMeshBuilder*           MeshData;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateCollision;                                  // 0x0010(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateFrequency                              UpdateFrequency;                                   // 0x0011(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_CreateMeshSectionFromBuilder;

// Function RuntimeMeshComponent.RuntimeMesh.CreateMeshSectionPacked_Blueprint
// 0x0030 (0x0030 - 0x0000)
struct RuntimeMesh_CreateMeshSectionPacked_Blueprint final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FRuntimeMeshBlueprintVertexSimple> Vertices;                                       // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCreateCollision;                                  // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bCalculateNormalTangent;                           // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bShouldCreateHardTangents;                         // 0x002A(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bGenerateTessellationTriangles;                    // 0x002B(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EUpdateFrequency                              UpdateFrequency;                                   // 0x002C(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionTangents;                         // 0x002D(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bUseHighPrecisionUVs;                              // 0x002E(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2F[0x1];                                       // 0x002F(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_CreateMeshSectionPacked_Blueprint;

// Function RuntimeMeshComponent.RuntimeMesh.GetSectionBoundingBox
// 0x0020 (0x0020 - 0x0000)
struct RuntimeMesh_GetSectionBoundingBox final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBox                                   ReturnValue;                                       // 0x0004(0x001C)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_GetSectionBoundingBox;

// Function RuntimeMeshComponent.RuntimeMesh.GetSectionMaterial
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMesh_GetSectionMaterial final
{
public:
	int32                                         SectionID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_GetSectionMaterial;

// Function RuntimeMeshComponent.RuntimeMesh.IsCollisionUsingAsyncCooking
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_IsCollisionUsingAsyncCooking final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_IsCollisionUsingAsyncCooking;

// Function RuntimeMeshComponent.RuntimeMesh.IsCollisionUsingComplexAsSimple
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_IsCollisionUsingComplexAsSimple final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_IsCollisionUsingComplexAsSimple;

// Function RuntimeMeshComponent.RuntimeMesh.IsMeshSectionCollisionEnabled
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_IsMeshSectionCollisionEnabled final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0004(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_IsMeshSectionCollisionEnabled;

// Function RuntimeMeshComponent.RuntimeMesh.RemoveCollisionBox
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMesh_RemoveCollisionBox final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_RemoveCollisionBox;

// Function RuntimeMeshComponent.RuntimeMesh.RemoveCollisionCapsule
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMesh_RemoveCollisionCapsule final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_RemoveCollisionCapsule;

// Function RuntimeMeshComponent.RuntimeMesh.RemoveCollisionSphere
// 0x0004 (0x0004 - 0x0000)
struct RuntimeMesh_RemoveCollisionSphere final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_RemoveCollisionSphere;

// Function RuntimeMeshComponent.RuntimeMesh.SetCollisionBoxes
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMesh_SetCollisionBoxes final
{
public:
	TArray<struct FRuntimeMeshCollisionBox>       NewBoxes;                                          // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetCollisionBoxes;

// Function RuntimeMeshComponent.RuntimeMesh.SetCollisionCapsules
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMesh_SetCollisionCapsules final
{
public:
	TArray<struct FRuntimeMeshCollisionCapsule>   NewCapsules;                                       // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetCollisionCapsules;

// Function RuntimeMeshComponent.RuntimeMesh.SetCollisionMode
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_SetCollisionMode final
{
public:
	ERuntimeMeshCollisionCookingMode              NewMode;                                           // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetCollisionMode;

// Function RuntimeMeshComponent.RuntimeMesh.SetCollisionSpheres
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMesh_SetCollisionSpheres final
{
public:
	TArray<struct FRuntimeMeshCollisionSphere>    NewSpheres;                                        // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetCollisionSpheres;

// Function RuntimeMeshComponent.RuntimeMesh.SetCollisionUseAsyncCooking
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_SetCollisionUseAsyncCooking final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetCollisionUseAsyncCooking;

// Function RuntimeMeshComponent.RuntimeMesh.SetCollisionUseComplexAsSimple
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_SetCollisionUseComplexAsSimple final
{
public:
	bool                                          bNewValue;                                         // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetCollisionUseComplexAsSimple;

// Function RuntimeMeshComponent.RuntimeMesh.SetConvexCollisionSection
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMesh_SetConvexCollisionSection final
{
public:
	int32                                         ConvexSectionIndex;                                // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        ConvexVerts;                                       // 0x0008(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetConvexCollisionSection;

// Function RuntimeMeshComponent.RuntimeMesh.SetMeshCollisionSection
// 0x0028 (0x0028 - 0x0000)
struct RuntimeMesh_SetMeshCollisionSection final
{
public:
	int32                                         CollisionSectionIndex;                             // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Vertices;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetMeshCollisionSection;

// Function RuntimeMeshComponent.RuntimeMesh.SetMeshSectionCastsShadow
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_SetMeshSectionCastsShadow final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewCastsShadow;                                   // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_SetMeshSectionCastsShadow;

// Function RuntimeMeshComponent.RuntimeMesh.SetMeshSectionCollisionEnabled
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_SetMeshSectionCollisionEnabled final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewCollisionEnabled;                              // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_SetMeshSectionCollisionEnabled;

// Function RuntimeMeshComponent.RuntimeMesh.SetMeshSectionVisible
// 0x0008 (0x0008 - 0x0000)
struct RuntimeMesh_SetMeshSectionVisible final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bNewVisibility;                                    // 0x0004(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_RuntimeMesh_SetMeshSectionVisible;

// Function RuntimeMeshComponent.RuntimeMesh.SetSectionMaterial
// 0x0010 (0x0010 - 0x0000)
struct RuntimeMesh_SetSectionMaterial final
{
public:
	int32                                         SectionID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     Material;                                          // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetSectionMaterial;

// Function RuntimeMeshComponent.RuntimeMesh.SetSectionTessellationTriangles
// 0x0018 (0x0018 - 0x0000)
struct RuntimeMesh_SetSectionTessellationTriangles final
{
public:
	int32                                         SectionID;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 Triangles;                                         // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetSectionTessellationTriangles;

// Function RuntimeMeshComponent.RuntimeMesh.SetShouldSerializeMeshData
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_SetShouldSerializeMeshData final
{
public:
	bool                                          bShouldSerialize;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_SetShouldSerializeMeshData;

// Function RuntimeMeshComponent.RuntimeMesh.ShouldSerializeMeshData
// 0x0001 (0x0001 - 0x0000)
struct RuntimeMesh_ShouldSerializeMeshData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_RuntimeMesh_ShouldSerializeMeshData;

// Function RuntimeMeshComponent.RuntimeMesh.UpdateMeshSection_Blueprint
// 0x0080 (0x0080 - 0x0000)
struct RuntimeMesh_UpdateMeshSection_Blueprint final
{
public:
	int32                                         SectionIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FVector>                        Vertices;                                          // 0x0008(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                 Triangles;                                         // 0x0018(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVector>                        Normals;                                           // 0x0028(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FRuntimeMeshTangent>            Tangents;                                          // 0x0038(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
