#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: RuntimeMeshComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum RuntimeMeshComponent.ERuntimeMeshSetAction
// NumValues: 0x0005
enum class ERuntimeMeshSetAction : uint8
{
	Create                                   = 0,
	Update                                   = 1,
	Remove                                   = 2,
	None                                     = 3,
	ERuntimeMeshSetAction_MAX                = 4,
};

// Enum RuntimeMeshComponent.ERuntimeMeshCollisionCookingMode
// NumValues: 0x0003
enum class ERuntimeMeshCollisionCookingMode : uint8
{
	CollisionPerformance                     = 0,
	CookingPerformance                       = 1,
	ERuntimeMeshCollisionCookingMode_MAX     = 2,
};

// Enum RuntimeMeshComponent.EUpdateFrequency
// NumValues: 0x0004
enum class EUpdateFrequency : uint8
{
	Average                                  = 0,
	Frequent                                 = 1,
	Infrequent                               = 2,
	EUpdateFrequency_MAX                     = 3,
};

// Enum RuntimeMeshComponent.ERuntimeMeshMobility
// NumValues: 0x0004
enum class ERuntimeMeshMobility : uint8
{
	Movable                                  = 0,
	Stationary                               = 1,
	Static                                   = 2,
	ERuntimeMeshMobility_MAX                 = 3,
};

// Enum RuntimeMeshComponent.ERuntimeMeshSlicerCapOption
// NumValues: 0x0004
enum class ERuntimeMeshSlicerCapOption : uint8
{
	NoCap                                    = 0,
	CreateNewSectionForCap                   = 1,
	UseLastSectionForCap                     = 2,
	ERuntimeMeshSlicerCapOption_MAX          = 3,
};

// ScriptStruct RuntimeMeshComponent.RuntimeMeshTangent
// 0x0010 (0x0010 - 0x0000)
struct FRuntimeMeshTangent final
{
public:
	struct FVector                                TangentX;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bFlipTangentY;                                     // 0x000C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_FRuntimeMeshTangent;

// ScriptStruct RuntimeMeshComponent.RuntimeMeshBlueprintVertexSimple
// 0x0040 (0x0040 - 0x0000)
struct FRuntimeMeshBlueprintVertexSimple final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Normal;                                            // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeMeshTangent                    Tangent;                                           // 0x0018(0x0010)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FLinearColor                           Color;                                             // 0x0028(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              UV0;                                               // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuntimeMeshBlueprintVertexSimple;

// ScriptStruct RuntimeMeshComponent.RuntimeMeshCollisionCapsule
// 0x0020 (0x0020 - 0x0000)
struct FRuntimeMeshCollisionCapsule final
{
public:
	struct FVector                                Center;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Length;                                            // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuntimeMeshCollisionCapsule;

// ScriptStruct RuntimeMeshComponent.RuntimeMeshCollisionBox
// 0x0024 (0x0024 - 0x0000)
struct FRuntimeMeshCollisionBox final
{
public:
	struct FVector                                Center;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                                Extents;                                           // 0x0018(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuntimeMeshCollisionBox;

// ScriptStruct RuntimeMeshComponent.RuntimeMeshCollisionSphere
// 0x0010 (0x0010 - 0x0000)
struct FRuntimeMeshCollisionSphere final
{
public:
	struct FVector                                Center;                                            // 0x0000(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Radius;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_FRuntimeMeshCollisionSphere;

}

