#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Startup

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function Startup.Startup_C.HideMobileBackground
// 0x0001 (0x0001 - 0x0000)
struct Startup_C_HideMobileBackground final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Startup_C_HideMobileBackground;

// Function Startup.Startup_C.ShowMobileBackground
// 0x0018 (0x0018 - 0x0000)
struct Startup_C_ShowMobileBackground final
{
public:
	int32                                         CallFunc_GetPlatform_ReturnValue;                  // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Create_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_Startup_C_ShowMobileBackground;

// Function Startup.Startup_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct Startup_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Startup_C_ReceiveEndPlay;

// Function Startup.Startup_C.ExecuteUbergraph_Startup
// 0x0008 (0x0008 - 0x0000)
struct Startup_C_ExecuteUbergraph_Startup final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_Startup_C_ExecuteUbergraph_Startup;

}

