#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubAnimBP_Rifle

#include "Basic.hpp"

#include "ALSV4_CPP_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// DynamicClass SubAnimBP_Rifle.SubAnimBP_Rifle_C
// 0x4430 (0x4B20 - 0x06F0)
class USubAnimBP_Rifle_C final : public UCySubAnimInstanceRifle
{
public:
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x06E8(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x0718(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x0740(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x0768(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_21;                 // 0x0790(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_20;                 // 0x07B8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_19;                 // 0x07E0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_18;                 // 0x0808(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_17;                 // 0x0830(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_16;                 // 0x0858(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_15;                 // 0x0880(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_14;                 // 0x08A8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_13;                 // 0x08D0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_12;                 // 0x08F8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_11;                 // 0x0920(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_10;                 // 0x0948(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_9;                  // 0x0970(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_8;                  // 0x0998(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_7;                  // 0x09C0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_6;                  // 0x09E8(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_5;                  // 0x0A10(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0A38(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_46;                // 0x0A60(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_9;                   // 0x0AB0(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_45;                // 0x0B50(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_44;                // 0x0BA0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_22;                      // 0x0BF0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_21;                      // 0x0CB8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_43;                // 0x0D80(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_42;                // 0x0DD0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_13;                   // 0x0E20(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_5;                     // 0x0EA0(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_20;                      // 0x0F88(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_41;                // 0x1050(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_7;            // 0x10A0(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_8;                       // 0x1198(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_6;            // 0x11C8(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_40;                // 0x12C0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_39;                // 0x1310(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_5;                      // 0x1360(0x0018)(NativeAccessSpecifierPublic)
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_4;                      // 0x1378(0x0018)(NativeAccessSpecifierPublic)
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_3;                     // 0x1390(0x0058)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_38;                // 0x13E8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_8;                   // 0x1438(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_37;                // 0x14D8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_36;                // 0x1528(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_19;                      // 0x1578(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_18;                      // 0x1640(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_35;                // 0x1708(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_34;                // 0x1758(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_12;                   // 0x17A8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1828(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_17;                      // 0x1910(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_33;                // 0x19D8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x1A28(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_7;                       // 0x1B20(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_3;                      // 0x1B50(0x0018)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_7;                   // 0x1B68(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_32;                // 0x1C08(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_6;                   // 0x1C58(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_11;                   // 0x1CF8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_16;                      // 0x1D78(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_31;                // 0x1E40(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_30;                // 0x1E90(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_15;                      // 0x1EE0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_14;                      // 0x1FA8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_29;                // 0x2070(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_28;                // 0x20C0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_10;                   // 0x2110(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x2190(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_13;                      // 0x2278(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_27;                // 0x2340(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x2390(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_6;                       // 0x2488(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_26;                // 0x24B8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_5;                   // 0x2508(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_25;                // 0x25A8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x25F8(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_24;                // 0x26F0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_23;                // 0x2740(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_12;                      // 0x2790(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_11;                      // 0x2858(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_22;                // 0x2920(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_21;                // 0x2970(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_9;                    // 0x29C0(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_2;                     // 0x2A40(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_10;                      // 0x2B28(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_5;                       // 0x2BF0(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x2C20(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_20;                // 0x2D18(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_19;                // 0x2D68(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_2;                      // 0x2DB8(0x0018)(NativeAccessSpecifierPublic)
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose_1;                      // 0x2DD0(0x0018)(NativeAccessSpecifierPublic)
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_2;                     // 0x2DE8(0x0058)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_18;                // 0x2E40(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_4;                   // 0x2E90(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_17;                // 0x2F30(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_16;                // 0x2F80(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_9;                       // 0x2FD0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_8;                       // 0x3098(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_15;                // 0x3160(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_14;                // 0x31B0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_8;                    // 0x3200(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_1;                     // 0x3280(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_7;                       // 0x3368(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_13;                // 0x3430(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x3480(0x00F8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_4;                       // 0x3578(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_3;                   // 0x35A8(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_12;                // 0x3648(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_11;                // 0x3698(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_10;                // 0x36E8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_9;                 // 0x3738(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend_1;                     // 0x3788(0x0058)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_7;                    // 0x37E0(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_6;                       // 0x3860(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_2;                   // 0x3928(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_6;                    // 0x39C8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_8;                 // 0x3A48(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x3A98(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_7;                 // 0x3B38(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3B88(0x00A0)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_6;                 // 0x3C28(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_5;                 // 0x3C78(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x3CC8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x3D18(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x3D68(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x3DB8(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x3E08(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_5;                       // 0x3E58(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_4;                       // 0x3F20(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_5;                    // 0x3FE8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x4068(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_MultiWayBlend                AnimGraphNode_MultiWayBlend;                       // 0x4150(0x0058)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_4;                    // 0x41A8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_3;                    // 0x4228(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_2;                    // 0x42A8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_3;                       // 0x4328(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x43F0(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x44B8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x4580(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_3;                       // 0x4648(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_1;                      // 0x4678(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x4728(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x4750(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x4778(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x47A0(0x0028)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x47C8(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x4848(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x4878(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x48F8(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_RefPose                      AnimGraphNode_IdentityPose;                        // 0x4928(0x0018)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x4940(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x4970(0x00B0)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyMeshSpaceAdditive       AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x4A20(0x00F8)(NativeAccessSpecifierPublic)
	uint8                                         Pad_4B18[0x8];                                     // 0x4B18(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SubAnimBP_Rifle_AnimGraphNode_TransitionResult_C75BEEAF487D09AD3586E097ED374CAD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SubAnimBP_Rifle_AnimGraphNode_TransitionResult_8ACC14E242C3E0BCE079DBAF191A2C07();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SubAnimBP_Rifle_AnimGraphNode_TransitionResult_613C7BB9413EDE3BF7BC3D8538DFAC19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SubAnimBP_Rifle_AnimGraphNode_TransitionResult_225177DA48800BF631F7688605199D96();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SubAnimBP_Rifle_AnimGraphNode_TransitionResult_0C4B42B643D0641AE57A6199B5E8FAB6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SubAnimBP_Rifle_AnimGraphNode_TransitionResult_02491F1A48EFFA7BB47F09AE3B42DD2D();
	void AnimGraph(struct FPoseLink* bpp__AnimGraph__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubAnimBP_Rifle_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubAnimBP_Rifle_C")
	}
	static class USubAnimBP_Rifle_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubAnimBP_Rifle_C>();
	}
};
DUMPER7_ASSERTS_USubAnimBP_Rifle_C;

}

