#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SubAnimBP_Default

#include "Basic.hpp"

#include "ALSV4_CPP_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// DynamicClass SubAnimBP_Default.SubAnimBP_Default_C
// 0x0620 (0x0B60 - 0x0540)
class USubAnimBP_Default_C final : public UCySubAnimInstanceDefault
{
public:
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0540(0x0030)(NativeAccessSpecifierPublic)
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive;                       // 0x0570(0x00E8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_2;                       // 0x0658(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend_1;                       // 0x0720(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_TwoWayBlend                  AnimGraphNode_TwoWayBlend;                         // 0x07E8(0x00C8)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x08B0(0x0080)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_4;                 // 0x0930(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_3;                 // 0x0980(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_2;                 // 0x09D0(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator_1;                 // 0x0A20(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_SequenceEvaluator            AnimGraphNode_SequenceEvaluator;                   // 0x0A70(0x0050)(NativeAccessSpecifierPublic)
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x0AC0(0x00A0)(NativeAccessSpecifierPublic)

public:
	void ExecuteUbergraph_SubAnimBP_Default(int32 bpp__EntryPoint__pf);
	void AnimGraph(struct FPoseLink* bpp__AnimGraph__pf);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("SubAnimBP_Default_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"SubAnimBP_Default_C")
	}
	static class USubAnimBP_Default_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USubAnimBP_Default_C>();
	}
};
DUMPER7_ASSERTS_USubAnimBP_Default_C;

}

