#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ThreeDModleDisplayActor

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass 3DModleDisplayActor.3DModleDisplayActor_C
// 0x0060 (0x0540 - 0x04E0)
class AThreeDModleDisplayActor_C final : public APM3DModelDisplayActor
{
public:
	class UCyVehicleSkinDisplayComponent*         CyVehicleSkinDisplay;                              // 0x04E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyLobbyDrawCardPackDisplayComponent*   CyLobbyDrawCardPackDisplay;                        // 0x04E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyCharacterMascotHeadDisplayComponent* CyCharacterMascotHeadDisplay;                      // 0x04F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyApartmentGarageKitsDisplayComponent* CyApartmentGarageKitsDisplay;                      // 0x04F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyHQDecalDisplayComponent*             CyHQDecalDisplay;                                  // 0x0500(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyHQWeaponDisplayComponent*            CyHQWeaponDisplay;                                 // 0x0508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyHQCharacterDisplayComponent*         CyHQCharacterDisplay;                              // 0x0510(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFlyEffectDisplayComponent*           CyFlyEffectDisplay;                                // 0x0518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPMDecalDisplayComponent*               PMDecalDisplay;                                    // 0x0520(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPMCharacterDisplayComponent*           PMCharacterDisplay;                                // 0x0528(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPMWeaponDisplayComponent*              PMWeaponDisplay;                                   // 0x0530(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("3DModleDisplayActor_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"3DModleDisplayActor_C")
	}
	static class AThreeDModleDisplayActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AThreeDModleDisplayActor_C>();
	}
};
DUMPER7_ASSERTS_AThreeDModleDisplayActor_C;

}

