#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"


namespace SDK::Params
{

// LuaFunction Transient.LUA_OVERRIDES_CyConditionGameInstanceSubsystem_2147482536.CreateLuaUObject
// 0x0028 (0x0028 - 0x0000)
struct LUA_OVERRIDES_CyConditionGameInstanceSubsystem_2147482536_CreateLuaUObject final
{
public:
	class UObject*                                OuterObj;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Classtype;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaModuleName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_CyConditionGameInstanceSubsystem_2147482536_CreateLuaUObject;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaReceiveSessionCmd
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaReceiveSessionCmd final
{
public:
	int32                                         cmd_id;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaReceiveSessionCmd;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaSessionOpen
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionOpen final
{
public:
	int32                                         ErrCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionOpen;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaSessionReOpen
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionReOpen final
{
public:
	int32                                         ErrCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionReOpen;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaSessionClose
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionClose final
{
public:
	int32                                         ErrCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionClose;

// LuaFunction Transient.LUA_OVERRIDES_WBP_LoginPage_C_2147482236.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_LoginPage_C_2147482236_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_LoginPage_C_2147482236_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_PMLuaBridgeObject_2147482336.TickLuaBridge
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMLuaBridgeObject_2147482336_TickLuaBridge final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMLuaBridgeObject_2147482336_TickLuaBridge;

}

