#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Transient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "SlateCore_structs.hpp"
#include "UMG_structs.hpp"
#include "PMGame_structs.hpp"


namespace SDK::Params
{

// LuaFunction Transient.LUA_OVERRIDES_WBP_GameKeyTipsAwakeningItem_C_2147434798.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_GameKeyTipsAwakeningItem_C_2147434798_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GameKeyTipsAwakeningItem_C_2147434798_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_CyConditionGameInstanceSubsystem_2147482536.CreateLuaUObject
// 0x0028 (0x0028 - 0x0000)
struct LUA_OVERRIDES_CyConditionGameInstanceSubsystem_2147482536_CreateLuaUObject final
{
public:
	class UObject*                                OuterObj;                                          // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Classtype;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 LuaModuleName;                                     // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_CyConditionGameInstanceSubsystem_2147482536_CreateLuaUObject;

// LuaFunction Transient.LUA_OVERRIDES_WBP_AddFriendButton_C_2147434773.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_AddFriendButton_C_2147434773_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_AddFriendButton_C_2147434773_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaSessionReOpen
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionReOpen final
{
public:
	int32                                         ErrCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionReOpen;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaSessionOpen
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionOpen final
{
public:
	int32                                         ErrCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionOpen;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaReceiveSessionCmd
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaReceiveSessionCmd final
{
public:
	int32                                         cmd_id;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaReceiveSessionCmd;

// LuaFunction Transient.LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338.OnLuaSessionClose
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionClose final
{
public:
	int32                                         ErrCode;                                           // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMOnlineServiceHandle_Lua_2147482338_OnLuaSessionClose;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GameFinishRewardPage_AchievementPanel_C_2147434771.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_GameFinishRewardPage_AchievementPanel_C_2147434771_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GameFinishRewardPage_AchievementPanel_C_2147434771_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ContentPage_FriendsRoom_C_2147481987.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_ContentPage_FriendsRoom_C_2147481987_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ContentPage_FriendsRoom_C_2147481987_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectPlayerShowSelf_C_2147434839.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectPlayerShowSelf_C_2147434839_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectPlayerShowSelf_C_2147434839_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_LoadingAssetPage_C_2147482163.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_LoadingAssetPage_C_2147482163_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_LoadingAssetPage_C_2147482163_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_LoginPage_C_2147482236.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_LoginPage_C_2147482236_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_LoginPage_C_2147482236_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_PMLuaBridgeObject_2147482336.TickLuaBridge
// 0x0004 (0x0004 - 0x0000)
struct LUA_OVERRIDES_PMLuaBridgeObject_2147482336_TickLuaBridge final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_PMLuaBridgeObject_2147482336_TickLuaBridge;

// LuaFunction Transient.LUA_OVERRIDES_WBP_NetItem_C_2147466260.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_NetItem_C_2147466260_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_NetItem_C_2147466260_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_NetItem_C_2147466260.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_NetItem_C_2147466260_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_NetItem_C_2147466260_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_NavigationBarPanel3_C_2147481861.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct LUA_OVERRIDES_WBP_NavigationBarPanel3_C_2147481861_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_NavigationBarPanel3_C_2147481861_OnMouseLeave;

// LuaFunction Transient.LUA_OVERRIDES_WBP_NavigationBarPanel3_C_2147481861.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct LUA_OVERRIDES_WBP_NavigationBarPanel3_C_2147481861_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_NavigationBarPanel3_C_2147481861_OnMouseEnter;

// LuaFunction Transient.LUA_OVERRIDES_WBP_TeamScoreCustom_PlayerDateItem_C_2147434788.Tick
// 0x003C (0x003C - 0x0000)
struct LUA_OVERRIDES_WBP_TeamScoreCustom_PlayerDateItem_C_2147434788_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_TeamScoreCustom_PlayerDateItem_C_2147434788_Tick;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleWeaponPanel_C_2147434828.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleWeaponPanel_C_2147434828_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleWeaponPanel_C_2147434828_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_EscortResultPage_ScoreListItem_C_2147434741.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_EscortResultPage_ScoreListItem_C_2147434741_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_EscortResultPage_ScoreListItem_C_2147434741_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_BigHeadResultPage_ScoreListItem_C_2147434734.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_BigHeadResultPage_ScoreListItem_C_2147434734_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_BigHeadResultPage_ScoreListItem_C_2147434734_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SharingClan_C_2147482001.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SharingClan_C_2147482001_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SharingClan_C_2147482001_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_BombResultPage_ScoreListItem_C_2147434735.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_BombResultPage_ScoreListItem_C_2147434735_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_BombResultPage_ScoreListItem_C_2147434735_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_BombPassResultPage_ScoreListItem_C_2147434736.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_BombPassResultPage_ScoreListItem_C_2147434736_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_BombPassResultPage_ScoreListItem_C_2147434736_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleCustomSkinPanel_C_2147434739.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleCustomSkinPanel_C_2147434739_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleCustomSkinPanel_C_2147434739_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleChangeSkinListItem_C_2147434740.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleChangeSkinListItem_C_2147434740_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleChangeSkinListItem_C_2147434740_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ChatTextTeamCard_C_2147481993.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_ChatTextTeamCard_C_2147481993_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ChatTextTeamCard_C_2147481993_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ChatText_C_2147434802.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ChatText_C_2147434802_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ChatText_C_2147434802_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GunGameResultPage_ScoreListItem_C_2147434742.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_GunGameResultPage_ScoreListItem_C_2147434742_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GunGameResultPage_ScoreListItem_C_2147434742_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_Growth_EquipWeaponList1_Item_C_2147462433.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_Growth_EquipWeaponList1_Item_C_2147462433_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_Growth_EquipWeaponList1_Item_C_2147462433_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_HotZoneResultPage_ScoreListItem_C_2147434743.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_HotZoneResultPage_ScoreListItem_C_2147434743_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_HotZoneResultPage_ScoreListItem_C_2147434743_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_KnifeFightResultPage_ScoreListItem_C_2147434744.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_KnifeFightResultPage_ScoreListItem_C_2147434744_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_KnifeFightResultPage_ScoreListItem_C_2147434744_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998_BP_OnItemSelectionChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ChatChannelListItem_C_2147481998_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_MineResultPage_ScoreListItem_C_2147434745.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_MineResultPage_ScoreListItem_C_2147434745_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_MineResultPage_ScoreListItem_C_2147434745_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ChatClanPage_C_2147481982.OnRemovedFromFocusPath
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ChatClanPage_C_2147481982_OnRemovedFromFocusPath final
{
public:
	struct FFocusEvent                            InFocusEvent;                                      // 0x0000(0x0008)(Parm, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ChatClanPage_C_2147481982_OnRemovedFromFocusPath;

// LuaFunction Transient.LUA_OVERRIDES_WBP_TeamResultPage_ScoreListItem_C_2147434746.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_TeamResultPage_ScoreListItem_C_2147434746_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_TeamResultPage_ScoreListItem_C_2147434746_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_TeamThreeResultPage_ScoreListItem_C_2147434747.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_TeamThreeResultPage_ScoreListItem_C_2147434747_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_TeamThreeResultPage_ScoreListItem_C_2147434747_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768.OnDragDetected
// 0x00B0 (0x00B0 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_OnDragDetected;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoletChangeSkinPanelListItem_C_2147434768_BP_OnItemSelectionChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ZombieResultPage_ScoreListItem_C_2147434748.OnMouseButtonDown
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_ZombieResultPage_ScoreListItem_C_2147434748_OnMouseButtonDown final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ZombieResultPage_ScoreListItem_C_2147434748_OnMouseButtonDown;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ScoreRoundResultBomb_C_2147434849.OnRoundResultChanged
// 0x0010 (0x0010 - 0x0000)
struct LUA_OVERRIDES_WBP_ScoreRoundResultBomb_C_2147434849_OnRoundResultChanged final
{
public:
	TArray<struct FMatchRoundResult>              MatchRoundResult;                                  // 0x0000(0x0010)(ConstParm, Parm, OutParm, ReferenceParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ScoreRoundResultBomb_C_2147434849_OnRoundResultChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ScoreRoundResultBomb_C_2147434849.OnBombOwnerTeamChanged
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ScoreRoundResultBomb_C_2147434849_OnBombOwnerTeamChanged final
{
public:
	const class APMGameState_Bomb*                GameState;                                         // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ScoreRoundResultBomb_C_2147434849_OnBombOwnerTeamChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821.OnMouseMove
// 0x0160 (0x0160 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_OnMouseMove final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
	struct FEventReply                            ReturnValue;                                       // 0x00A8(0x00B8)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_OnMouseMove;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821.LuaOnNavigation
// 0x0002 (0x0002 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_LuaOnNavigation final
{
public:
	EUINavigation                                 UINavigationType;                                  // 0x0000(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0001(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_LuaOnNavigation;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821.HideOrShowAllPage
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_HideOrShowAllPage final
{
public:
	bool                                          bShowCharacterOnly;                                // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleBombPage_C_2147434821_HideOrShowAllPage;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CampusActivities_ResultTag_C_2147434770.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_CampusActivities_ResultTag_C_2147434770_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CampusActivities_ResultTag_C_2147434770_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CampusActivities_ResultTag_C_2147434770.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_CampusActivities_ResultTag_C_2147434770_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CampusActivities_ResultTag_C_2147434770_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ScorePlayerTeam_C_2147434787.Tick
// 0x003C (0x003C - 0x0000)
struct LUA_OVERRIDES_WBP_ScorePlayerTeam_C_2147434787_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ScorePlayerTeam_C_2147434787_Tick;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852.K2_OnLastCharacterOut
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852_K2_OnLastCharacterOut final
{
public:
	const class AActor*                           LastViewTarget;                                    // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852_K2_OnLastCharacterOut;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852.K2_OnNewCharacterIn
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852_K2_OnNewCharacterIn final
{
public:
	const class AActor*                           InViewTarget;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852_K2_OnNewCharacterIn;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GrowthRetrofitPanel_C_2147434852_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ResultLeisureCupPage_C_2147434775.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_ResultLeisureCupPage_C_2147434775_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ResultLeisureCupPage_C_2147434775_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CompetitionProgress_C_2147481850.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_CompetitionProgress_C_2147481850_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CompetitionProgress_C_2147481850_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CompetitionProgress_C_2147481850.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_CompetitionProgress_C_2147481850_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CompetitionProgress_C_2147481850_BP_OnItemSelectionChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_RoomOperations_C_2147466254.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_RoomOperations_C_2147466254_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_RoomOperations_C_2147466254_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ClanInfoCard_C_2147481990.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_ClanInfoCard_C_2147481990_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ClanInfoCard_C_2147481990_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleLoadingItem_C_2147434767.UpdateFriendIcon
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleLoadingItem_C_2147434767_UpdateFriendIcon final
{
public:
	class APMPlayerState*                         PlayerState;                                       // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleLoadingItem_C_2147434767_UpdateFriendIcon;

// LuaFunction Transient.LUA_OVERRIDES_WBP_SelectRoleLoadingItem_C_2147434767.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_SelectRoleLoadingItem_C_2147434767_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_SelectRoleLoadingItem_C_2147434767_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ResultRolePanel_C_2147434769.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ResultRolePanel_C_2147434769_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ResultRolePanel_C_2147434769_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_ResultBPTaskItemPanel_C_2147434772.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_ResultBPTaskItemPanel_C_2147434772_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_ResultBPTaskItemPanel_C_2147434772_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_TacticWheelPanel_C_2147434791.ConfirmItem
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_TacticWheelPanel_C_2147434791_ConfirmItem final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_TacticWheelPanel_C_2147434791_ConfirmItem;

// LuaFunction Transient.LUA_OVERRIDES_WBP_TacticWheelPanel_C_2147434791.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_TacticWheelPanel_C_2147434791_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_TacticWheelPanel_C_2147434791_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_TacticWheelItem_C_2147434792.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_TacticWheelItem_C_2147434792_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_TacticWheelItem_C_2147434792_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_BombRoundResultPage_C_2147434793.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_BombRoundResultPage_C_2147434793_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_BombRoundResultPage_C_2147434793_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534.BP_OnItemSelectionChanged
// 0x0001 (0x0001 - 0x0000)
struct LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_BP_OnItemSelectionChanged final
{
public:
	bool                                          bIsSelected;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_BP_OnItemSelectionChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534.OnMouseLeave
// 0x0070 (0x0070 - 0x0000)
struct LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_OnMouseLeave final
{
public:
	struct FPointerEvent                          MouseEvent;                                        // 0x0000(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_OnMouseLeave;

// LuaFunction Transient.LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534.OnMouseEnter
// 0x00A8 (0x00A8 - 0x0000)
struct LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_OnMouseEnter final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(Parm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FPointerEvent                          MouseEvent;                                        // 0x0038(0x0070)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_CareerRankComboItem_C_2147480534_OnMouseEnter;

// LuaFunction Transient.LUA_OVERRIDES_WBP_EquipRoomStory_ChapterItem_C_2147478682.OnListItemObjectSet
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_EquipRoomStory_ChapterItem_C_2147478682_OnListItemObjectSet final
{
public:
	class UObject*                                ListItemObject;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_EquipRoomStory_ChapterItem_C_2147478682_OnListItemObjectSet;

// LuaFunction Transient.LUA_OVERRIDES_WBP_MarkWheelPanel_C_2147434795.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_MarkWheelPanel_C_2147434795_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_MarkWheelPanel_C_2147434795_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_MarkWheelItem_C_2147434796.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_MarkWheelItem_C_2147434796_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_MarkWheelItem_C_2147434796_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797.K2_OnSelectRoleIDReplicated
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797_K2_OnSelectRoleIDReplicated final
{
public:
	const class ACyPlayerState*                   CyPlayerState;                                     // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797_K2_OnSelectRoleIDReplicated;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797.K2_OnViewTargetChanged
// 0x0008 (0x0008 - 0x0000)
struct LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797_K2_OnViewTargetChanged final
{
public:
	const class AActor*                           InViewTarget;                                      // 0x0000(0x0008)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797_K2_OnViewTargetChanged;

// LuaFunction Transient.LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_GameKeyTipsNewPage_C_2147434797_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_RoomModeSelectPage_C_2147466596.LuaHandleKeyEvent
// 0x0020 (0x0020 - 0x0000)
struct LUA_OVERRIDES_WBP_RoomModeSelectPage_C_2147466596_LuaHandleKeyEvent final
{
public:
	struct FKey                                   Key;                                               // 0x0000(0x0018)(Parm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EInputEvent                                   InputEvent;                                        // 0x0018(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0019(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_RoomModeSelectPage_C_2147466596_LuaHandleKeyEvent;

// LuaFunction Transient.LUA_OVERRIDES_WBP_RoomModeSelectPage_C_2147466596.CustomHandleNavAction
// 0x0058 (0x0058 - 0x0000)
struct LUA_OVERRIDES_WBP_RoomModeSelectPage_C_2147466596_CustomHandleNavAction final
{
public:
	struct FUINavActionReply                      Reply;                                             // 0x0000(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LUA_OVERRIDES_WBP_RoomModeSelectPage_C_2147466596_CustomHandleNavAction;

