#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UGC

#include "Basic.hpp"

#include "UGC_structs.hpp"


namespace SDK::Params
{

// Function UGC.UGCBlockVolumeActor.ChangeSize
// 0x0008 (0x0008 - 0x0000)
struct UGCBlockVolumeActor_ChangeSize final
{
public:
	float                                         XMaxSize;                                          // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         YMaxSize;                                          // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCBlockVolumeActor_ChangeSize;

// Function UGC.UGCBlueprintFunctionLibrary.GetActorQuantity
// 0x0068 (0x0068 - 0x0000)
struct UGCBlueprintFunctionLibrary_GetActorQuantity final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<uint16, int32>                           ActorQuantity;                                     // 0x0010(0x0050)(Parm, OutParm, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0060(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCBlueprintFunctionLibrary_GetActorQuantity;

// Function UGC.UGCBlueprintFunctionLibrary.GetMapTileSizeName
// 0x0018 (0x0018 - 0x0000)
struct UGCBlueprintFunctionLibrary_GetMapTileSizeName final
{
public:
	EUGCMapSizeByTile                             UGCMapSizeByTile;                                  // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0008(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCBlueprintFunctionLibrary_GetMapTileSizeName;

// Function UGC.UGCBlueprintFunctionLibrary.LoadUGCMap
// 0x0020 (0x0020 - 0x0000)
struct UGCBlueprintFunctionLibrary_LoadUGCMap final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCBlueprintFunctionLibrary_LoadUGCMap;

// Function UGC.UGCBlueprintFunctionLibrary.VerifyMapFileHash
// 0x0018 (0x0018 - 0x0000)
struct UGCBlueprintFunctionLibrary_VerifyMapFileHash final
{
public:
	class FString                                 Filename;                                          // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         GameMode;                                          // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0011(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_UGCBlueprintFunctionLibrary_VerifyMapFileHash;

// Function UGC.UGCTriggerActor.ActorOverlapBegin
// 0x0010 (0x0010 - 0x0000)
struct UGCTriggerActor_ActorOverlapBegin final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCTriggerActor_ActorOverlapBegin;

// Function UGC.UGCTriggerActor.ActorOverlapEnd
// 0x0010 (0x0010 - 0x0000)
struct UGCTriggerActor_ActorOverlapEnd final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UGCTriggerActor_ActorOverlapEnd;

}

