#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UGC

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"
#include "Engine_classes.hpp"
#include "UGC_structs.hpp"


namespace SDK
{

// Class UGC.UGCBaseActor
// 0x0070 (0x0340 - 0x02D0)
class AUGCBaseActor : public AActor
{
public:
	class USceneComponent*                        UGCRoot;                                           // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   VisibleUseComponent;                               // 0x02D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UMaterialInterface*>             PreviewRightMaterial;                              // 0x02E0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>             PreviewErrorMaterial;                              // 0x02F0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         bIgnoreOverlap : 1;                                // 0x0300(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bExclusive : 1;                                    // 0x0300(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         bConflict : 1;                                     // 0x0300(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected))
	uint8                                         Pad_301[0x27];                                     // 0x0301(0x0027)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ItemId;                                            // 0x0328(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         UID;                                               // 0x032C(0x0004)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                                Color;                                             // 0x0330(0x000C)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                         ConnectItemID;                                     // 0x033C(0x0004)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	void OnRep_Color();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCBaseActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCBaseActor")
	}
	static class AUGCBaseActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCBaseActor>();
	}
};
DUMPER7_ASSERTS_AUGCBaseActor;

// Class UGC.UGCAtomActor
// 0x0008 (0x0348 - 0x0340)
class AUGCAtomActor : public AUGCBaseActor
{
public:
	class UStaticMeshComponent*                   AtomComponent;                                     // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCAtomActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCAtomActor")
	}
	static class AUGCAtomActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCAtomActor>();
	}
};
DUMPER7_ASSERTS_AUGCAtomActor;

// Class UGC.UGCVolumeActor
// 0x0008 (0x02D8 - 0x02D0)
class AUGCVolumeActor : public AActor
{
public:
	class UStaticMeshComponent*                   VolumeComponent;                                   // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCVolumeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCVolumeActor")
	}
	static class AUGCVolumeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCVolumeActor>();
	}
};
DUMPER7_ASSERTS_AUGCVolumeActor;

// Class UGC.UGCBlockVolumeActor
// 0x0000 (0x02D8 - 0x02D8)
class AUGCBlockVolumeActor final : public AUGCVolumeActor
{
public:
	void ChangeSize(float XMaxSize, float YMaxSize);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCBlockVolumeActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCBlockVolumeActor")
	}
	static class AUGCBlockVolumeActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCBlockVolumeActor>();
	}
};
DUMPER7_ASSERTS_AUGCBlockVolumeActor;

// Class UGC.UGCBlueprintFunctionLibrary
// 0x0000 (0x0028 - 0x0028)
class UUGCBlueprintFunctionLibrary final : public UBlueprintFunctionLibrary
{
public:
	static bool GetActorQuantity(const class FString& Filename, TMap<uint16, int32>* ActorQuantity);
	static class FString GetMapTileSizeName(EUGCMapSizeByTile UGCMapSizeByTile);
	static class FString LoadUGCMap(const class FString& Filename);
	static bool VerifyMapFileHash(const class FString& Filename, uint8* GameMode);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCBlueprintFunctionLibrary")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCBlueprintFunctionLibrary")
	}
	static class UUGCBlueprintFunctionLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCBlueprintFunctionLibrary>();
	}
};
DUMPER7_ASSERTS_UUGCBlueprintFunctionLibrary;

// Class UGC.UGCBoxSelectActor
// 0x0010 (0x0350 - 0x0340)
class AUGCBoxSelectActor final : public AUGCBaseActor
{
public:
	class UInstancedStaticMeshComponent*          ExtendComponent;                                   // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ULineBatchComponent*                    RangeBoxComponent;                                 // 0x0348(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCBoxSelectActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCBoxSelectActor")
	}
	static class AUGCBoxSelectActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCBoxSelectActor>();
	}
};
DUMPER7_ASSERTS_AUGCBoxSelectActor;

// Class UGC.UGCExtendEditView
// 0x0010 (0x02E0 - 0x02D0)
class AUGCExtendEditView : public AActor
{
public:
	class USceneComponent*                        ExtendRootComponent;                               // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   ExtendComponent;                                   // 0x02D8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCExtendEditView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCExtendEditView")
	}
	static class AUGCExtendEditView* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCExtendEditView>();
	}
};
DUMPER7_ASSERTS_AUGCExtendEditView;

// Class UGC.UGCPlaneActor
// 0x0008 (0x0348 - 0x0340)
class AUGCPlaneActor : public AUGCBaseActor
{
public:
	class UStaticMeshComponent*                   PlaneComponent;                                    // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPlaneActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPlaneActor")
	}
	static class AUGCPlaneActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPlaneActor>();
	}
};
DUMPER7_ASSERTS_AUGCPlaneActor;

// Class UGC.UGCGroudActor
// 0x0000 (0x0348 - 0x0348)
class AUGCGroudActor final : public AUGCPlaneActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCGroudActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCGroudActor")
	}
	static class AUGCGroudActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCGroudActor>();
	}
};
DUMPER7_ASSERTS_AUGCGroudActor;

// Class UGC.UGCInstaceStaticMeshActor
// 0x0008 (0x02D8 - 0x02D0)
class AUGCInstaceStaticMeshActor final : public AActor
{
public:
	class UInstancedStaticMeshComponent*          InstancedStaticMeshComponent;                      // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCInstaceStaticMeshActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCInstaceStaticMeshActor")
	}
	static class AUGCInstaceStaticMeshActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCInstaceStaticMeshActor>();
	}
};
DUMPER7_ASSERTS_AUGCInstaceStaticMeshActor;

// Class UGC.UGCPlaneEditView
// 0x0020 (0x02F0 - 0x02D0)
class AUGCPlaneEditView : public AActor
{
public:
	class USceneComponent*                        EditViewRootComponent;                             // 0x02D0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                            Mesh;                                              // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      NormalMaterial;                                    // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ChooseMaterial;                                    // 0x02E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPlaneEditView")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPlaneEditView")
	}
	static class AUGCPlaneEditView* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPlaneEditView>();
	}
};
DUMPER7_ASSERTS_AUGCPlaneEditView;

// Class UGC.UGCPlaneEditViewStepOne
// 0x0020 (0x0310 - 0x02F0)
class AUGCPlaneEditViewStepOne : public AUGCPlaneEditView
{
public:
	class UStaticMeshComponent*                   UpLeft;                                            // 0x02F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   UpRight;                                           // 0x02F8(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   RightDown;                                         // 0x0300(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   LeftDown;                                          // 0x0308(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPlaneEditViewStepOne")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPlaneEditViewStepOne")
	}
	static class AUGCPlaneEditViewStepOne* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPlaneEditViewStepOne>();
	}
};
DUMPER7_ASSERTS_AUGCPlaneEditViewStepOne;

// Class UGC.UGCPlaneEditViewStepTwo
// 0x0008 (0x02F8 - 0x02F0)
class AUGCPlaneEditViewStepTwo : public AUGCPlaneEditView
{
public:
	class UStaticMeshComponent*                   Middle;                                            // 0x02F0(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPlaneEditViewStepTwo")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPlaneEditViewStepTwo")
	}
	static class AUGCPlaneEditViewStepTwo* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPlaneEditViewStepTwo>();
	}
};
DUMPER7_ASSERTS_AUGCPlaneEditViewStepTwo;

// Class UGC.UGCPlaneEditViewStepThree
// 0x0000 (0x02F0 - 0x02F0)
class AUGCPlaneEditViewStepThree : public AUGCPlaneEditView
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPlaneEditViewStepThree")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPlaneEditViewStepThree")
	}
	static class AUGCPlaneEditViewStepThree* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPlaneEditViewStepThree>();
	}
};
DUMPER7_ASSERTS_AUGCPlaneEditViewStepThree;

// Class UGC.UGCPrefabActor
// 0x0000 (0x0340 - 0x0340)
class AUGCPrefabActor : public AUGCBaseActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPrefabActor")
	}
	static class AUGCPrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPrefabActor>();
	}
};
DUMPER7_ASSERTS_AUGCPrefabActor;

// Class UGC.UGCPreviewExtendActor
// 0x0018 (0x0358 - 0x0340)
class AUGCPreviewExtendActor final : public AUGCBaseActor
{
public:
	class UInstancedStaticMeshComponent*          ExtendComponent;                                   // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_348[0x10];                                     // 0x0348(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPreviewExtendActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPreviewExtendActor")
	}
	static class AUGCPreviewExtendActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPreviewExtendActor>();
	}
};
DUMPER7_ASSERTS_AUGCPreviewExtendActor;

// Class UGC.UGCPreviewPlaneStepOneActor
// 0x0038 (0x0380 - 0x0348)
class AUGCPreviewPlaneStepOneActor : public AUGCPlaneActor
{
public:
	class UStaticMesh*                            Mesh;                                              // 0x0348(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      RightMaterial;                                     // 0x0350(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                      ErrorMaterial;                                     // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   UpLeft;                                            // 0x0360(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   UpRight;                                           // 0x0368(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   RightDown;                                         // 0x0370(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                   LeftDown;                                          // 0x0378(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCPreviewPlaneStepOneActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCPreviewPlaneStepOneActor")
	}
	static class AUGCPreviewPlaneStepOneActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCPreviewPlaneStepOneActor>();
	}
};
DUMPER7_ASSERTS_AUGCPreviewPlaneStepOneActor;

// Class UGC.UGCSMPrefabActor
// 0x0008 (0x0348 - 0x0340)
class AUGCSMPrefabActor : public AUGCPrefabActor
{
public:
	class UStaticMeshComponent*                   PrefabSMComponent;                                 // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCSMPrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCSMPrefabActor")
	}
	static class AUGCSMPrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCSMPrefabActor>();
	}
};
DUMPER7_ASSERTS_AUGCSMPrefabActor;

// Class UGC.UGCReferencePrefabActor
// 0x0010 (0x0358 - 0x0348)
class AUGCReferencePrefabActor final : public AUGCSMPrefabActor
{
public:
	TArray<struct FReplaceActorConfig>            ReplaceActorClasses;                               // 0x0348(0x0010)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCReferencePrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCReferencePrefabActor")
	}
	static class AUGCReferencePrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCReferencePrefabActor>();
	}
};
DUMPER7_ASSERTS_AUGCReferencePrefabActor;

// Class UGC.UGCSKPrefabActor
// 0x0008 (0x0348 - 0x0340)
class AUGCSKPrefabActor final : public AUGCPrefabActor
{
public:
	class USkeletalMeshComponent*                 PrefabSKComponent;                                 // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCSKPrefabActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCSKPrefabActor")
	}
	static class AUGCSKPrefabActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCSKPrefabActor>();
	}
};
DUMPER7_ASSERTS_AUGCSKPrefabActor;

// Class UGC.UGCSMPrefabFunctionalActor
// 0x0000 (0x0348 - 0x0348)
class AUGCSMPrefabFunctionalActor final : public AUGCSMPrefabActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCSMPrefabFunctionalActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCSMPrefabFunctionalActor")
	}
	static class AUGCSMPrefabFunctionalActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCSMPrefabFunctionalActor>();
	}
};
DUMPER7_ASSERTS_AUGCSMPrefabFunctionalActor;

// Class UGC.UGCTriggerActor
// 0x0008 (0x0348 - 0x0340)
class AUGCTriggerActor : public AUGCBaseActor
{
public:
	class UStaticMeshComponent*                   TriggerComponent;                                  // 0x0340(0x0008)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	void ActorOverlapBegin(class AActor* OverlappedActor, class AActor* OtherActor);
	void ActorOverlapEnd(class AActor* OverlappedActor, class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCTriggerActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCTriggerActor")
	}
	static class AUGCTriggerActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUGCTriggerActor>();
	}
};
DUMPER7_ASSERTS_AUGCTriggerActor;

// Class UGC.UGCWorldSettings
// 0x0088 (0x00B0 - 0x0028)
class UUGCWorldSettings final : public UObject
{
public:
	int32                                         CanTraceMaxDistance;                               // 0x0028(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AUGCBaseActor>              PreviewActorClass;                                 // 0x0030(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         ImpactDistance;                                    // 0x0038(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MeshImportCenterTolerance;                         // 0x003C(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         BlockTolerance;                                    // 0x0040(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         MaxExtendTile;                                     // 0x0044(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AUGCExtendEditView>         ExtendEditViewClass;                               // 0x0048(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         PlaneViewNum;                                      // 0x0050(0x0004)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSubclassOf<class AUGCPlaneEditViewStepOne>   PlaneEditViewStepOneClass;                         // 0x0058(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AUGCPlaneEditViewStepTwo>   PlaneEditViewStepTwoClass;                         // 0x0060(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AUGCPlaneEditViewStepThree> PlaneEditViewStepThreeClass;                       // 0x0068(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AUGCPreviewPlaneStepOneActor> PreviewPlaneStepOneActorClass;                   // 0x0070(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AUGCExtendEditView>         SlideExtendEditViewClass;                          // 0x0078(0x0008)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                         MapSizeArray;                                      // 0x0080(0x0010)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_90[0x20];                                      // 0x0090(0x0020)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UGCWorldSettings")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UGCWorldSettings")
	}
	static class UUGCWorldSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUGCWorldSettings>();
	}
};
DUMPER7_ASSERTS_UUGCWorldSettings;

}

