#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIParticle

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "UIParticle_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class UIParticle.UIParticle
// 0x0030 (0x0140 - 0x0110)
class UUIParticle final : public UWidget
{
public:
	class UUIParticleAsset*                       Asset;                                             // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              EventOnEnd;                                        // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         bPlayParticle : 1;                                 // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          IsPlaying;                                         // 0x0129(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12A[0x16];                                     // 0x012A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Play();
	void SetPlayParticle(bool InPlayParticle);
	void Stop();
	void StopEmit();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticle")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticle")
	}
	static class UUIParticle* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticle>();
	}
};
DUMPER7_ASSERTS_UUIParticle;

// Class UIParticle.UIParticleAsset
// 0x0018 (0x0040 - 0x0028)
class UUIParticleAsset final : public UObject
{
public:
	bool                                          AutoPlay;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FUIParticleEmitterInfo>         Emitters;                                          // 0x0030(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleAsset")
	}
	static class UUIParticleAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticleAsset>();
	}
};
DUMPER7_ASSERTS_UUIParticleAsset;

// Class UIParticle.UIParticleEmitter
// 0x0030 (0x0140 - 0x0110)
class UUIParticleEmitter final : public UWidget
{
public:
	class UUIParticleEmitterAsset*                Asset;                                             // 0x0110(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMulticastInlineDelegate<void()>              EventOnEnd;                                        // 0x0118(0x0010)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                         bPlayParticle : 1;                                 // 0x0128(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	bool                                          IsPlaying;                                         // 0x0129(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_12A[0x16];                                     // 0x012A(0x0016)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Play();
	void SetPlayParticle(bool InPlayParticle);
	void Stop();
	void StopEmit();

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleEmitter")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleEmitter")
	}
	static class UUIParticleEmitter* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticleEmitter>();
	}
};
DUMPER7_ASSERTS_UUIParticleEmitter;

// Class UIParticle.UIParticleEmitterAsset
// 0xD618 (0xD640 - 0x0028)
class UUIParticleEmitterAsset final : public UObject
{
public:
	bool                                          AutoPlay;                                          // 0x0028(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         StartTimeOffset;                                   // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         SamplingTimes;                                     // 0x0030(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EEmitterType                                  EmitterType;                                       // 0x0034(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_35[0x3];                                       // 0x0035(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         EmitSeconds;                                       // 0x0038(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIParticleProperty                    MaxParticleCount;                                  // 0x0040(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    SpawnParticlePerSecond;                            // 0x0828(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    ParticleEmitAngle;                                 // 0x1010(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FRange_Vector2D                        EmitPosRange;                                      // 0x17F8(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_180C[0x4];                                     // 0x180C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPosotion_Vector2DCurve                EmitPosition;                                      // 0x1810(0x0FD0)(Edit, NativeAccessSpecifierPublic)
	bool                                          AutoEmitPosRange;                                  // 0x27E0(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          AutoScale;                                         // 0x27E1(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ScaleByX;                                          // 0x27E2(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27E3[0x1];                                     // 0x27E3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              DesignSize;                                        // 0x27E4(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          EmitAngleByWidgetAngle;                            // 0x27EC(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EPositionType                                 PositionType;                                      // 0x27ED(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_27EE[0x2];                                     // 0x27EE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIParticleProperty                    LifeSpan;                                          // 0x27F0(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    Size;                                              // 0x2FD8(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    Pivot;                                             // 0x37C0(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    RotationStart;                                     // 0x3FA8(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    RotationSpeed;                                     // 0x4790(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    Color;                                             // 0x4F78(0x07E8)(Edit, NativeAccessSpecifierPublic)
	class UObject*                                ResourceObject;                                    // 0x5760(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          RotationFollowSpeed;                               // 0x5768(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseSeparateSize;                                   // 0x5769(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_576A[0x6];                                     // 0x576A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIParticleProperty                    Gravity;                                           // 0x5770(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    StartSpeed;                                        // 0x5F58(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    AirResistance;                                     // 0x6740(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    RadialAcceleration;                                // 0x6F28(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    TangentialAcceleration;                            // 0x7710(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    Radius;                                            // 0x7EF8(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    DegreePerSecond;                                   // 0x86E0(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    PositionX;                                         // 0x8EC8(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    PositionY;                                         // 0x96B0(0x07E8)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FChildEmitter>                  ChildrenEmitters;                                  // 0x9E98(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FScalarParamCurve>              ScalarParams;                                      // 0x9EA8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FScalarParamCurve>              ScalarParamsWhenStart;                             // 0x9EB8(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EParticleDrawEffect                           DrawEffect;                                        // 0x9EC8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          UseScaleFollowSpeedDirection;                      // 0x9EC9(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9ECA[0x6];                                     // 0x9ECA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIParticleProperty                    ScaleFollowSpeedDirection;                         // 0x9ED0(0x07E8)(Edit, NativeAccessSpecifierPublic)
	bool                                          UseScaleFollowSpeedVertical;                       // 0xA6B8(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_A6B9[0x7];                                     // 0xA6B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIParticleProperty                    ScaleFollowSpeedVertical;                          // 0xA6C0(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    DirectionScale;                                    // 0xAEA8(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    VerticalDirectionScale;                            // 0xB690(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    SineDirectionStart;                                // 0xBE78(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    SineDirectionSpeed;                                // 0xC660(0x07E8)(Edit, NativeAccessSpecifierPublic)
	struct FUIParticleProperty                    SineDirectionRange;                                // 0xCE48(0x07E8)(Edit, NativeAccessSpecifierPublic)
	TArray<class UUIParticleEmitterAsset*>        LevelOfDetail;                                     // 0xD630(0x0010)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleEmitterAsset")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleEmitterAsset")
	}
	static class UUIParticleEmitterAsset* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticleEmitterAsset>();
	}
};
DUMPER7_ASSERTS_UUIParticleEmitterAsset;

// Class UIParticle.UIParticleUtility
// 0x0000 (0x0028 - 0x0028)
class UUIParticleUtility final : public UObject
{
public:
	static int32 GetLOD();
	static bool GetMultiThread();
	static void SetLOD(int32 newlod);
	static void SetMultiThread(bool Value);

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleUtility")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleUtility")
	}
	static class UUIParticleUtility* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticleUtility>();
	}
};
DUMPER7_ASSERTS_UUIParticleUtility;

}

