#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIParticle

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIParticle.UIParticle.SetPlayParticle
// 0x0001 (0x0001 - 0x0000)
struct UIParticle_SetPlayParticle final
{
public:
	bool                                          InPlayParticle;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIParticle_SetPlayParticle;

// Function UIParticle.UIParticleEmitter.SetPlayParticle
// 0x0001 (0x0001 - 0x0000)
struct UIParticleEmitter_SetPlayParticle final
{
public:
	bool                                          InPlayParticle;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIParticleEmitter_SetPlayParticle;

// Function UIParticle.UIParticleUtility.GetLOD
// 0x0004 (0x0004 - 0x0000)
struct UIParticleUtility_GetLOD final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIParticleUtility_GetLOD;

// Function UIParticle.UIParticleUtility.GetMultiThread
// 0x0001 (0x0001 - 0x0000)
struct UIParticleUtility_GetMultiThread final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIParticleUtility_GetMultiThread;

// Function UIParticle.UIParticleUtility.SetLOD
// 0x0004 (0x0004 - 0x0000)
struct UIParticleUtility_SetLOD final
{
public:
	int32                                         newlod;                                            // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIParticleUtility_SetLOD;

// Function UIParticle.UIParticleUtility.SetMultiThread
// 0x0001 (0x0001 - 0x0000)
struct UIParticleUtility_SetMultiThread final
{
public:
	bool                                          Value;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_UIParticleUtility_SetMultiThread;

}

