#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIParticleSystem

#include "Basic.hpp"

#include "UMG_classes.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// Class UIParticleSystem.ParticleSystemWidget
// 0x0030 (0x0140 - 0x0110)
class UParticleSystemWidget final : public UWidget
{
public:
	class UParticleSystem*                        ParticleSystemTemplate;                            // 0x0110(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bReactivate;                                       // 0x0118(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAbsoluteSize;                                     // 0x0119(0x0001)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_11A[0x6];                                      // 0x011A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               WorldParticleComponent;                            // 0x0120(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                 WorldParticleActor;                                // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_130[0x10];                                     // 0x0130(0x0010)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void ActivateParticles(bool bActive, bool bReset);
	void SetReactivate(bool bActivateAndReset);

	class UParticleSystemComponent* GetParticleComponent() const;

public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("ParticleSystemWidget")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"ParticleSystemWidget")
	}
	static class UParticleSystemWidget* GetDefaultObj()
	{
		return GetDefaultObjImpl<UParticleSystemWidget>();
	}
};
DUMPER7_ASSERTS_UParticleSystemWidget;

// Class UIParticleSystem.UIParticleComponent
// 0x0000 (0x0700 - 0x0700)
class UUIParticleComponent final : public UParticleSystemComponent
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleComponent")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleComponent")
	}
	static class UUIParticleComponent* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUIParticleComponent>();
	}
};
DUMPER7_ASSERTS_UUIParticleComponent;

// Class UIParticleSystem.UIParticleActor
// 0x0000 (0x02D0 - 0x02D0)
class AUIParticleActor final : public AActor
{
public:
	static class UClass* StaticClass()
	{
		STATIC_CLASS_IMPL("UIParticleActor")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"UIParticleActor")
	}
	static class AUIParticleActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUIParticleActor>();
	}
};
DUMPER7_ASSERTS_AUIParticleActor;

}

