#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnLua

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct UnLua.PropertyCollector
// 0x0008 (0x0008 - 0x0000)
struct FPropertyCollector final
{
public:
	struct FFormatArgumentData                    None;                                              // 0x0000(0x0040)(HasGetValueTypeHash)
	struct FInputAxisKeyMapping                   None_0;                                            // 0x0000(0x0028)(HasGetValueTypeHash)
	struct FIntPoint                              None_1;                                            // 0x0000(0x0008)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMonitorInfomation                     None_2;                                            // 0x0000(0x0030)(HasGetValueTypeHash)
	struct FInputActionKeyMapping                 None_3;                                            // 0x0000(0x0028)(HasGetValueTypeHash)
};
DUMPER7_ASSERTS_FPropertyCollector;

}

