#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: VariantManagerContent

#include "Basic.hpp"


namespace SDK::Params
{

// Function VariantManagerContent.PropertyValue.GetFullDisplayString
// 0x0010 (0x0010 - 0x0000)
struct PropertyValue_GetFullDisplayString final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyValue_GetFullDisplayString;

// Function VariantManagerContent.PropertyValue.GetPropertyTooltip
// 0x0018 (0x0018 - 0x0000)
struct PropertyValue_GetPropertyTooltip final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyValue_GetPropertyTooltip;

// Function VariantManagerContent.PropertyValue.HasRecordedData
// 0x0001 (0x0001 - 0x0000)
struct PropertyValue_HasRecordedData final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_PropertyValue_HasRecordedData;

// Function VariantManagerContent.LevelVariantSets.GetNumVariantSets
// 0x0004 (0x0004 - 0x0000)
struct LevelVariantSets_GetNumVariantSets final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LevelVariantSets_GetNumVariantSets;

// Function VariantManagerContent.LevelVariantSets.GetVariantSet
// 0x0010 (0x0010 - 0x0000)
struct LevelVariantSets_GetVariantSet final
{
public:
	int32                                         VariantSetIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVariantSet*                            ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LevelVariantSets_GetVariantSet;

// Function VariantManagerContent.LevelVariantSets.GetVariantSetByName
// 0x0018 (0x0018 - 0x0000)
struct LevelVariantSets_GetVariantSetByName final
{
public:
	class FString                                 VariantSetName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVariantSet*                            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LevelVariantSets_GetVariantSetByName;

// Function VariantManagerContent.LevelVariantSetsActor.GetLevelVariantSets
// 0x0010 (0x0010 - 0x0000)
struct LevelVariantSetsActor_GetLevelVariantSets final
{
public:
	bool                                          bLoad;                                             // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ULevelVariantSets*                      ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LevelVariantSetsActor_GetLevelVariantSets;

// Function VariantManagerContent.LevelVariantSetsActor.SetLevelVariantSets
// 0x0008 (0x0008 - 0x0000)
struct LevelVariantSetsActor_SetLevelVariantSets final
{
public:
	class ULevelVariantSets*                      InVariantSets;                                     // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_LevelVariantSetsActor_SetLevelVariantSets;

// Function VariantManagerContent.LevelVariantSetsActor.SwitchOnVariantByIndex
// 0x000C (0x000C - 0x0000)
struct LevelVariantSetsActor_SwitchOnVariantByIndex final
{
public:
	int32                                         VariantSetIndex;                                   // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         VariantIndex;                                      // 0x0004(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LevelVariantSetsActor_SwitchOnVariantByIndex;

// Function VariantManagerContent.LevelVariantSetsActor.SwitchOnVariantByName
// 0x0028 (0x0028 - 0x0000)
struct LevelVariantSetsActor_SwitchOnVariantByName final
{
public:
	class FString                                 VariantSetName;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 VariantName;                                       // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_LevelVariantSetsActor_SwitchOnVariantByName;

// Function VariantManagerContent.SwitchActor.SelectOption
// 0x0004 (0x0004 - 0x0000)
struct SwitchActor_SelectOption final
{
public:
	int32                                         OptionIndex;                                       // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SwitchActor_SelectOption;

// Function VariantManagerContent.SwitchActor.GetOptions
// 0x0010 (0x0010 - 0x0000)
struct SwitchActor_GetOptions final
{
public:
	TArray<class AActor*>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SwitchActor_GetOptions;

// Function VariantManagerContent.SwitchActor.GetSelectedOption
// 0x0004 (0x0004 - 0x0000)
struct SwitchActor_GetSelectedOption final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_SwitchActor_GetSelectedOption;

// Function VariantManagerContent.Variant.GetActor
// 0x0010 (0x0010 - 0x0000)
struct Variant_GetActor final
{
public:
	int32                                         ActorIndex;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Variant_GetActor;

// Function VariantManagerContent.Variant.GetNumActors
// 0x0004 (0x0004 - 0x0000)
struct Variant_GetNumActors final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Variant_GetNumActors;

// Function VariantManagerContent.Variant.GetThumbnail
// 0x0008 (0x0008 - 0x0000)
struct Variant_GetThumbnail final
{
public:
	class UTexture2D*                             ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Variant_GetThumbnail;

// Function VariantManagerContent.Variant.IsActive
// 0x0001 (0x0001 - 0x0000)
struct Variant_IsActive final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Variant_IsActive;

// Function VariantManagerContent.Variant.SetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct Variant_SetDisplayText final
{
public:
	class FText                                   NewDisplayText;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Variant_SetDisplayText;

// Function VariantManagerContent.Variant.GetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct Variant_GetDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_Variant_GetDisplayText;

// Function VariantManagerContent.VariantSet.GetNumVariants
// 0x0004 (0x0004 - 0x0000)
struct VariantSet_GetNumVariants final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VariantSet_GetNumVariants;

// Function VariantManagerContent.VariantSet.GetVariant
// 0x0010 (0x0010 - 0x0000)
struct VariantSet_GetVariant final
{
public:
	int32                                         VariantIndex;                                      // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UVariant*                               ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VariantSet_GetVariant;

// Function VariantManagerContent.VariantSet.GetVariantByName
// 0x0018 (0x0018 - 0x0000)
struct VariantSet_GetVariantByName final
{
public:
	class FString                                 VariantName;                                       // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVariant*                               ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VariantSet_GetVariantByName;

// Function VariantManagerContent.VariantSet.SetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct VariantSet_SetDisplayText final
{
public:
	class FText                                   NewDisplayText;                                    // 0x0000(0x0018)(ConstParm, Parm, OutParm, ReferenceParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VariantSet_SetDisplayText;

// Function VariantManagerContent.VariantSet.GetDisplayText
// 0x0018 (0x0018 - 0x0000)
struct VariantSet_GetDisplayText final
{
public:
	class FText                                   ReturnValue;                                       // 0x0000(0x0018)(Parm, OutParm, ReturnParm, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_VariantSet_GetDisplayText;

}

