#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_KillMessagesItemPanel

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_KillMessagesItemPanel.WBP_KillMessagesItemPanel_C
// 0x0028 (0x0A20 - 0x09F8)
class UWBP_KillMessagesItemPanel_C final : public UPMUWKillMessagesItemPanelPC
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09F8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 FadeInImg;                                         // 0x0A00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_380;                                         // 0x0A08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Grey;                                        // 0x0A10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Red;                                         // 0x0A18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent_0();
	void ExecuteUbergraph_WBP_KillMessagesItemPanel(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_KillMessagesItemPanel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_KillMessagesItemPanel_C")
	}
	static class UWBP_KillMessagesItemPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_KillMessagesItemPanel_C>();
	}
};
DUMPER7_ASSERTS_UWBP_KillMessagesItemPanel_C;

}

