#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RefereeGreenBackgroundPage

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RefereeGreenBackgroundPage.WBP_RefereeGreenBackgroundPage_C
// 0x0038 (0x0A50 - 0x0A18)
class UWBP_RefereeGreenBackgroundPage_C final : public UPMUWRefereeGreenBackgroundPage
{
public:
	class UImage*                                 Image_61;                                          // 0x0A18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RefereeEquipmentPanel_C*           WBP_RefereeEquipmentPanel;                         // 0x0A20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RefereeEquipmentPanel_1_C*         WBP_RefereeEquipmentPanel_1;                       // 0x0A28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RefereeEquipmentPanel_C*           WBP_RefereeEquipmentPanel_2;                       // 0x0A30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RefereeEquipmentPanel_C*           WBP_RefereeEquipmentPanel_3;                       // 0x0A38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RefereeEquipmentPanel_C*           WBP_RefereeEquipmentPanel_4;                       // 0x0A40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_RefereeEquipmentPanel_C*           WBP_RefereeEquipmentPanel_5;                       // 0x0A48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_RefereeGreenBackgroundPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_RefereeGreenBackgroundPage_C")
	}
	static class UWBP_RefereeGreenBackgroundPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RefereeGreenBackgroundPage_C>();
	}
};
DUMPER7_ASSERTS_UWBP_RefereeGreenBackgroundPage_C;

}

