#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ZombieResultPage_ScorePage

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ZombieResultPage_ScorePage.WBP_ZombieResultPage_ScorePage_C
// 0x0030 (0x05F8 - 0x05C8)
class UWBP_ZombieResultPage_ScorePage_C final : public UPMBaseUserWidget
{
public:
	class UDynamicEntryBox*                       DynamicEntryBox_Top;                               // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Mode;                                    // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMapName;                                       // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTimeUsed;                                      // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ResultVictoryDefeatTitlePanel_C*   WBP_ResultVictoryDefeatTitlePanel_PC;              // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ZombieResultPage_ScoreListTile_C*  WBP_Top_ScoreTitle;                                // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ZombieResultPage_ScorePage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ZombieResultPage_ScorePage_C")
	}
	static class UWBP_ZombieResultPage_ScorePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ZombieResultPage_ScorePage_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ZombieResultPage_ScorePage_C;

}

