#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GrowthPartItem_Retrofit

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GrowthPartItem_Retrofit.WBP_GrowthPartItem_Retrofit_C
// 0x0230 (0x07F8 - 0x05C8)
class UWBP_GrowthPartItem_Retrofit_C final : public UPMBaseUserWidget
{
public:
	class UImage*                                 DIsable_;                                          // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 DIsable_Buy;                                       // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Hover;                                             // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_GrowthPoint;                                   // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Normal;                                            // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPMImage*                               PMImg_Select;                                      // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Bg;                                         // 0x05F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                        Switch_Cost;                                       // 0x0600(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             Text_Cost;                                         // 0x0608(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPMTextBlock*                           Text_Desc;                                         // 0x0610(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_ScrollWidgetItem_C*                WBP_ScrollWidgetItem_PC;                           // 0x0618(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            DescColorUpgradeable;                              // 0x0620(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DescColorCannotUpgrade;                            // 0x0648(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DescColorCannotUpgradeMaxLv;                       // 0x0670(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CostColorUpgradeable;                              // 0x0698(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CostColorCannotUpgrade;                            // 0x06C0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CostColorMaxLvCanChange;                           // 0x06E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            DescColorUpgraded;                                 // 0x0710(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            CostColorUpgraded;                                 // 0x0738(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           GrowthPointColorUpgradeMaxLv;                      // 0x0760(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           GrowthPointColorNormal;                            // 0x0770(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            CostColorMaxLvCannotChange;                        // 0x0780(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, class UAkAudioEvent*>     Ak_Operate;                                        // 0x07A8(0x0050)(Edit, BlueprintVisible, Transient, DisableEditOnInstance)

public:
	bool IsInteractable() const;

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GrowthPartItem_Retrofit_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GrowthPartItem_Retrofit_C")
	}
	static class UWBP_GrowthPartItem_Retrofit_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GrowthPartItem_Retrofit_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GrowthPartItem_Retrofit_C;

}

