#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_HumanMachineModeList

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_HumanMachineModeList.WBP_HumanMachineModeList_C
// 0x0050 (0x0618 - 0x05C8)
class UWBP_HumanMachineModeList_C final : public UPMBaseUserWidget
{
public:
	class UWrapBox*                               SelectList;                                        // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HumanMachineModeListItem_C*        WBP_HumanMachineModeListItem;                      // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HumanMachineModeListItem_C*        WBP_HumanMachineModeListItem_126;                  // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_HumanMachineModeListItem_C*        WBP_HumanMachineModeListItem_264;                  // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UAkAudioEvent*                          SelectSound;                                       // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftClassPtr<class UClass>                   ModeItemClass;                                     // 0x05F0(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_HumanMachineModeList_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_HumanMachineModeList_C")
	}
	static class UWBP_HumanMachineModeList_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_HumanMachineModeList_C>();
	}
};
DUMPER7_ASSERTS_UWBP_HumanMachineModeList_C;

}

