#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_BombPassResultPage_ScorePage

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_BombPassResultPage_ScorePage.WBP_BombPassResultPage_ScorePage_C
// 0x0030 (0x05F8 - 0x05C8)
class UWBP_BombPassResultPage_ScorePage_C final : public UPMBaseUserWidget
{
public:
	class UWidgetAnimation*                       NewAnimation;                                      // 0x05C8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UDynamicEntryBox*                       DynamicEntryBox_Top;                               // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Mode;                                    // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextMapName;                                       // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextTimeUsed;                                      // 0x05E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BombPassResultPage_ScoreListTile_C* WBP_BombPassResultPage_ScoreListTile;             // 0x05F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_BombPassResultPage_ScorePage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_BombPassResultPage_ScorePage_C")
	}
	static class UWBP_BombPassResultPage_ScorePage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_BombPassResultPage_ScorePage_C>();
	}
};
DUMPER7_ASSERTS_UWBP_BombPassResultPage_ScorePage_C;

}

