#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_ADSChargePage_Xueqiu

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_ADSChargePage_Xueqiu.WBP_ADSChargePage_Xueqiu_C
// 0x0028 (0x0900 - 0x08D8)
class UWBP_ADSChargePage_Xueqiu_C final : public UPMUWADSCharge
{
public:
	class UWidgetAnimation*                       Start;                                             // 0x08D8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 M_UI_xq_0004;                                      // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_RankBadge7n1_wjh_014;                           // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_UI_AbilityQIcon_wjh_001;                        // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 MI_Ui_Cbn_019;                                     // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_ADSChargePage_Xueqiu_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_ADSChargePage_Xueqiu_C")
	}
	static class UWBP_ADSChargePage_Xueqiu_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_ADSChargePage_Xueqiu_C>();
	}
};
DUMPER7_ASSERTS_UWBP_ADSChargePage_Xueqiu_C;

}

