#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_FeedBackSets_Count

#include "Basic.hpp"


namespace SDK::Params
{

// Function WBP_FeedBackSets_Count.WBP_FeedBackSets_Count_C.GetCurveSpeed
// 0x0010 (0x0010 - 0x0000)
struct WBP_FeedBackSets_Count_C_GetCurveSpeed final
{
public:
	float                                         InX;                                               // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Percent;                                           // 0x0004(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_FeedBackSets_Count_C_GetCurveSpeed;

// Function WBP_FeedBackSets_Count.WBP_FeedBackSets_Count_C.ExecuteUbergraph_WBP_FeedBackSets_Count
// 0x0004 (0x0004 - 0x0000)
struct WBP_FeedBackSets_Count_C_ExecuteUbergraph_WBP_FeedBackSets_Count final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
DUMPER7_ASSERTS_WBP_FeedBackSets_Count_C_ExecuteUbergraph_WBP_FeedBackSets_Count;

}

