#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_SelectRoleChangeListPanel

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_SelectRoleChangeListPanel.WBP_SelectRoleChangeListPanel_C
// 0x0050 (0x0618 - 0x05C8)
class UWBP_SelectRoleChangeListPanel_C final : public UPMBaseUserWidget
{
public:
	class UListView*                              ListView_Items;                                    // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                         InitItemNum;                                       // 0x05D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D4[0x4];                                      // 0x05D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   PanelNameCN;                                       // 0x05D8(0x0018)(Edit, BlueprintVisible)
	class FText                                   PanelNameEN;                                       // 0x05F0(0x0018)(Edit, BlueprintVisible)
	class UClass*                                 EntryModelClass;                                   // 0x0608(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ColumnNum;                                         // 0x0610(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_SelectRoleChangeListPanel_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_SelectRoleChangeListPanel_C")
	}
	static class UWBP_SelectRoleChangeListPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_SelectRoleChangeListPanel_C>();
	}
};
DUMPER7_ASSERTS_UWBP_SelectRoleChangeListPanel_C;

}

