#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GameChatInputPage

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GameChatInputPage.WBP_GameChatInputPage_C
// 0x0040 (0x0910 - 0x08D0)
class UWBP_GameChatInputPage_C final : public UPMGameChatPage
{
public:
	TSoftClassPtr<class UClass>                   ChatTextPanelClass;                                // 0x08D0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                         TimeInterval;                                      // 0x08F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeCoolDown;                                      // 0x08FC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TimeCount;                                         // 0x0900(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MsgLimit;                                          // 0x0904(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         MaxPrivateChatNum;                                 // 0x0908(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GameChatInputPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GameChatInputPage_C")
	}
	static class UWBP_GameChatInputPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GameChatInputPage_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GameChatInputPage_C;

}

