#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_AbilitySummonEnergy_Yvette

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_AbilitySummonEnergy_Yvette.WBP_AbilitySummonEnergy_Yvette_C
// 0x0030 (0x0DC0 - 0x0D90)
class UWBP_AbilitySummonEnergy_Yvette_C final : public UPMUWAbilityProgressYvetteQ
{
public:
	class UImage*                                 ProgressTag_1;                                     // 0x0D90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ProgressTag_2;                                     // 0x0D98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           SkillProgress_0;                                   // 0x0DA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           SkillProgress_1;                                   // 0x0DA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                           SkillProgress_2;                                   // 0x0DB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_AbilitySummonEnergy_Yvette_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_AbilitySummonEnergy_Yvette_C")
	}
	static class UWBP_AbilitySummonEnergy_Yvette_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_AbilitySummonEnergy_Yvette_C>();
	}
};
DUMPER7_ASSERTS_UWBP_AbilitySummonEnergy_Yvette_C;

}

