#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RankScoreProgress

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WBP_RankScoreProgress.WBP_RankScoreProgress_C.ExecuteUbergraph_WBP_RankScoreProgress
// 0x0038 (0x0038 - 0x0000)
struct WBP_RankScoreProgress_C_ExecuteUbergraph_WBP_RankScoreProgress final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
};
DUMPER7_ASSERTS_WBP_RankScoreProgress_C_ExecuteUbergraph_WBP_RankScoreProgress;

// Function WBP_RankScoreProgress.WBP_RankScoreProgress_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_RankScoreProgress_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
DUMPER7_ASSERTS_WBP_RankScoreProgress_C_PreConstruct;

}

