#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TriTeamMatchPage

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TriTeamMatchPage.WBP_TriTeamMatchPage_C
// 0x0030 (0x08F0 - 0x08C0)
class UWBP_TriTeamMatchPage_C final : public UPMUserWidget
{
public:
	class UWBP_GameModeCommonPage_C*              GameModeCommon;                                    // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TeamChangeRoleTips_C*              TeamChangeRoleTips;                                // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_FeedbackManagerPage_C*             WBP_FeedbackManagerPage;                           // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TeamTriScoreInfoPanel_C*           WBP_TeamTriScoreInfoPanel_PC;                      // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_TriTeamRoundPanel_C*               WBP_TriTeamRoundPanel_PC;                          // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_WarmUpScreenPanel_C*               WBP_WarmUpScreenPanel;                             // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TriTeamMatchPage_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TriTeamMatchPage_C")
	}
	static class UWBP_TriTeamMatchPage_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TriTeamMatchPage_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TriTeamMatchPage_C;

}

