#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_RankBadgeLvEff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_RankBadgeLvEff.WBP_RankBadgeLvEff_C
// 0x0030 (0x0290 - 0x0260)
class UWBP_RankBadgeLvEff_C final : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0260(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       LvDowngrade;                                       // 0x0268(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       LvUpgrade;                                         // 0x0270(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemWidget*                  lizi01;                                            // 0x0278(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnLvChanged;                                       // 0x0280(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

public:
	void ExecuteUbergraph_WBP_RankBadgeLvEff(int32 EntryPoint);
	void ChangeLevel();
	void SequenceEvent__ENTRYPOINTWBP_RankBadgeLvEff_0();
	void SequenceEvent__ENTRYPOINTWBP_RankBadgeLvEff_1();

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_RankBadgeLvEff_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_RankBadgeLvEff_C")
	}
	static class UWBP_RankBadgeLvEff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_RankBadgeLvEff_C>();
	}
};
DUMPER7_ASSERTS_UWBP_RankBadgeLvEff_C;

}

