#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_GrowthLevelNumInfo

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_GrowthLevelNumInfo.WBP_GrowthLevelNumInfo_C
// 0x0118 (0x06E0 - 0x05C8)
class UWBP_GrowthLevelNumInfo_C final : public UPMBaseUserWidget
{
public:
	class UHorizontalBox*                         HorizontalBox_NextLevelInfo;                       // 0x05C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Img_Arrow;                                         // 0x05D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_NextLevelNum;                            // 0x05D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_Num;                                     // 0x05E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                            ColorUpgrade;                                      // 0x05E8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ColorUnUpgrade;                                    // 0x0610(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            ColorDownUpgrade;                                  // 0x0638(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                           ArrowUpgrade;                                      // 0x0660(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ArrowUnUpgrade;                                    // 0x0670(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           ArrowDownUpgrade;                                  // 0x0680(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            OriginColorUpgrade;                                // 0x0690(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                            OriginColorUnUpgrade;                              // 0x06B8(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_GrowthLevelNumInfo_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_GrowthLevelNumInfo_C")
	}
	static class UWBP_GrowthLevelNumInfo_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_GrowthLevelNumInfo_C>();
	}
};
DUMPER7_ASSERTS_UWBP_GrowthLevelNumInfo_C;

}

