#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WBP_TriTeamOverview

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WBP_TriTeamOverview.WBP_TriTeamOverview_C
// 0x0028 (0x0998 - 0x0970)
class UWBP_TriTeamOverview_C final : public UCyUWTriTeamOverviewRankingPanelPC
{
public:
	class UWBP_GameBuffDisplaySlider_C*           BuffSlide0;                                        // 0x0970(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameBuffDisplaySlider_C*           BuffSlide1;                                        // 0x0978(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_GameBuffDisplaySlider_C*           BuffSlide2;                                        // 0x0980(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_268;                                         // 0x0988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           Panel_Root;                                        // 0x0990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("WBP_TriTeamOverview_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"WBP_TriTeamOverview_C")
	}
	static class UWBP_TriTeamOverview_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWBP_TriTeamOverview_C>();
	}
};
DUMPER7_ASSERTS_UWBP_TriTeamOverview_C;

}

