#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_E_Leona

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_E_Leona.Weapon_E_Leona_C
// 0x0020 (0x11B0 - 0x1190)
class AWeapon_E_Leona_C final : public ACyWeaponThrow
{
public:
	uint8                                         Pad_1188[0x8];                                     // 0x1188(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           Ak;                                                // 0x1190(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFStateMonitor*                       CyFStateMonitor;                                   // 0x1198(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyRecordBoolComponent*                 CyRecordBool;                                      // 0x11A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySearchLocationComponent*             CySearchLocation;                                  // 0x11A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon_E_Leona_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_E_Leona_C")
	}
	static class AWeapon_E_Leona_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon_E_Leona_C>();
	}
};
DUMPER7_ASSERTS_AWeapon_E_Leona_C;

}

