#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_X_Huixing_0

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_X_Huixing.Weapon_X_Huixing_C
// 0x0030 (0x11C0 - 0x1190)
class Weapon_X_Huixing_0::AWeapon_X_Huixing_C final : public ACyWeaponQuickThrow
{
public:
	class UCySearchUIComponent*                   CySearchUI;                                        // 0x1190(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySkinComponent*                       CySkin;                                            // 0x1198(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyActuatorSpaceTeleportCompnent*       CyActuatorSpaceTeleportCompnent;                   // 0x11A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFStateMonitor*                       CyFMonitor_UnEquip;                                // 0x11A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFAttackStateMonitor*                 CyFAttackMonitor_Work;                             // 0x11B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySpawnManagerComponent*               CySpawnManager;                                    // 0x11B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("BlueprintGeneratedClass Weapon_X_Huixing.Weapon_X_Huixing_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_X_Huixing_C")
	}
	static class Weapon_X_Huixing_0::AWeapon_X_Huixing_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Weapon_X_Huixing_0::AWeapon_X_Huixing_C>();
	}
};
DUMPER7_ASSERTS_Weapon_X_Huixing_0__AWeapon_X_Huixing_C;

}

