#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon10403001

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon10403001.Weapon10403001_C
// 0x0030 (0x11F0 - 0x11C0)
class AWeapon10403001_C final : public ACyWeaponShelfRifle
{
public:
	class UCyFSecondStartReloadState*             StateSecondStartReload;                            // 0x11C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFEndReloadState*                     StateEndReload;                                    // 0x11C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFStartReloadState*                   StateStartReload;                                  // 0x11D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFStateMonitor*                       CyFStateMonitor_BarrelParticle;                    // 0x11D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFStateMonitor*                       CyFStateMonitor_BarrelMat;                         // 0x11E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySpawnManagerComponent*               CySpawnManager;                                    // 0x11E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL("Weapon10403001_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon10403001_C")
	}
	static class AWeapon10403001_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeapon10403001_C>();
	}
};
DUMPER7_ASSERTS_AWeapon10403001_C;

}

