#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Castling_Galatea_0

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Castling_Galatea.Weapon_Castling_Galatea_C
// 0x0030 (0x13D0 - 0x13A0)
class Weapon_Castling_Galatea_0::AWeapon_Castling_Galatea_C final : public ACyWeaponCustom
{
public:
	class UCySearchLocationComponent*             CySearchLocation;                                  // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySearchTargetsComponent*              CySearchTargets;                                   // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFSecondWorkState*                    CyFSecondWorkState;                                // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyTargetActorsComponent*               CyTargetActors;                                    // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFWorkState*                          CyFWorkState;                                      // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("BlueprintGeneratedClass Weapon_Castling_Galatea.Weapon_Castling_Galatea_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_Castling_Galatea_C")
	}
	static class Weapon_Castling_Galatea_0::AWeapon_Castling_Galatea_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Weapon_Castling_Galatea_0::AWeapon_Castling_Galatea_C>();
	}
};
DUMPER7_ASSERTS_Weapon_Castling_Galatea_0__AWeapon_Castling_Galatea_C;

}

