#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_Q_MoBai

#include "Basic.hpp"

#include "PMGame_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Weapon_Q_MoBai.Weapon_Q_MoBai_C
// 0x0030 (0x13D0 - 0x13A0)
class Weapon_Q_MoBai::AWeapon_Q_MoBai_C final : public ACyWeaponCustom
{
public:
	class UCyFWorkEndState*                       CyFWorkEndState;                                   // 0x13A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyWeaponControlModeComponent*          CyWeaponControlMode;                               // 0x13A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCySearchTargetsComponent*              CySearchTargets;                                   // 0x13B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFFinishState*                        CyFFinishState;                                    // 0x13B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCyFWorkState*                          CyFWorkState;                                      // 0x13C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		BP_STATIC_CLASS_IMPL_FULLNAME("BlueprintGeneratedClass Weapon_Q_MoBai.Weapon_Q_MoBai_C")
	}
	static const class FName& StaticName()
	{
		STATIC_NAME_IMPL(L"Weapon_Q_MoBai_C")
	}
	static class Weapon_Q_MoBai::AWeapon_Q_MoBai_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<Weapon_Q_MoBai::AWeapon_Q_MoBai_C>();
	}
};
DUMPER7_ASSERTS_Weapon_Q_MoBai__AWeapon_Q_MoBai_C;

}

