#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WwiseResourceLoader

#include "Basic.hpp"

#include "WwiseResourceLoader_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WwiseResourceLoader.WwiseEventInfoLibrary.BreakStruct
// 0x0050 (0x0050 - 0x0000)
struct WwiseEventInfoLibrary_BreakStruct final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OutWwiseGuid;                                      // 0x0024(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutWwiseShortId;                                   // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 OutWwiseName;                                      // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventSwitchContainerLoading             OutSwitchContainerLoading;                         // 0x0048(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventDestroyOptions                     OutDestroyOptions;                                 // 0x0049(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         OutHardCodedSoundBankShortId;                      // 0x004C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_BreakStruct;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.GetDestroyOptions
// 0x0028 (0x0028 - 0x0000)
struct WwiseEventInfoLibrary_GetDestroyOptions final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventDestroyOptions                     ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_GetDestroyOptions;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.GetHardCodedSoundBankShortId
// 0x0028 (0x0028 - 0x0000)
struct WwiseEventInfoLibrary_GetHardCodedSoundBankShortId final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_GetHardCodedSoundBankShortId;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.GetSwitchContainerLoading
// 0x0028 (0x0028 - 0x0000)
struct WwiseEventInfoLibrary_GetSwitchContainerLoading final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventSwitchContainerLoading             ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_GetSwitchContainerLoading;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.GetWwiseGuid
// 0x0034 (0x0034 - 0x0000)
struct WwiseEventInfoLibrary_GetWwiseGuid final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0024(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_GetWwiseGuid;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.GetWwiseName
// 0x0038 (0x0038 - 0x0000)
struct WwiseEventInfoLibrary_GetWwiseName final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_GetWwiseName;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.GetWwiseShortID
// 0x0028 (0x0028 - 0x0000)
struct WwiseEventInfoLibrary_GetWwiseShortID final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_GetWwiseShortID;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.MakeStruct
// 0x0058 (0x0058 - 0x0000)
struct WwiseEventInfoLibrary_MakeStruct final
{
public:
	struct FGuid                                  WwiseGuid;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WwiseShortId;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WwiseName;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventSwitchContainerLoading             SwitchContainerLoading;                            // 0x0028(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventDestroyOptions                     DestroyOptions;                                    // 0x0029(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_2A[0x2];                                       // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         HardCodedSoundBankShortId;                         // 0x002C(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0030(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_MakeStruct;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.SetDestroyOptions
// 0x004C (0x004C - 0x0000)
struct WwiseEventInfoLibrary_SetDestroyOptions final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventDestroyOptions                     DestroyOptions;                                    // 0x0024(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_SetDestroyOptions;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.SetHardCodedSoundBankShortId
// 0x004C (0x004C - 0x0000)
struct WwiseEventInfoLibrary_SetHardCodedSoundBankShortId final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HardCodedSoundBankShortId;                         // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_SetHardCodedSoundBankShortId;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.SetSwitchContainerLoading
// 0x004C (0x004C - 0x0000)
struct WwiseEventInfoLibrary_SetSwitchContainerLoading final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EWwiseEventSwitchContainerLoading             SwitchContainerLoading;                            // 0x0024(0x0001)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_25[0x3];                                       // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_SetSwitchContainerLoading;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.SetWwiseGuid
// 0x0058 (0x0058 - 0x0000)
struct WwiseEventInfoLibrary_SetWwiseGuid final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  WwiseGuid;                                         // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0034(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_SetWwiseGuid;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.SetWwiseName
// 0x0060 (0x0060 - 0x0000)
struct WwiseEventInfoLibrary_SetWwiseName final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WwiseName;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0038(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_SetWwiseName;

// Function WwiseResourceLoader.WwiseEventInfoLibrary.SetWwiseShortId
// 0x004C (0x004C - 0x0000)
struct WwiseEventInfoLibrary_SetWwiseShortId final
{
public:
	struct FWwiseEventInfo                        Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WwiseShortId;                                      // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseEventInfo                        ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseEventInfoLibrary_SetWwiseShortId;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.BreakStruct
// 0x0050 (0x0050 - 0x0000)
struct WwiseGroupValueInfoLibrary_BreakStruct final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OutAssetGuid;                                      // 0x0024(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutGroupShortId;                                   // 0x0034(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutWwiseShortId;                                   // 0x0038(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutWwiseName;                                      // 0x0040(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_BreakStruct;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.GetAssetGuid
// 0x0034 (0x0034 - 0x0000)
struct WwiseGroupValueInfoLibrary_GetAssetGuid final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0024(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_GetAssetGuid;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.GetGroupShortId
// 0x0028 (0x0028 - 0x0000)
struct WwiseGroupValueInfoLibrary_GetGroupShortId final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_GetGroupShortId;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.GetWwiseName
// 0x0038 (0x0038 - 0x0000)
struct WwiseGroupValueInfoLibrary_GetWwiseName final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 ReturnValue;                                       // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_GetWwiseName;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.GetWwiseShortID
// 0x0028 (0x0028 - 0x0000)
struct WwiseGroupValueInfoLibrary_GetWwiseShortID final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0024(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_GetWwiseShortID;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.MakeStruct
// 0x0050 (0x0050 - 0x0000)
struct WwiseGroupValueInfoLibrary_MakeStruct final
{
public:
	struct FGuid                                  AssetGuid;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupShortId;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WwiseShortId;                                      // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseName;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseGroupValueInfo                   ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_MakeStruct;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.SetAssetGuid
// 0x0058 (0x0058 - 0x0000)
struct WwiseGroupValueInfoLibrary_SetAssetGuid final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  AssetGuid;                                         // 0x0024(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseGroupValueInfo                   ReturnValue;                                       // 0x0034(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_SetAssetGuid;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.SetGroupShortId
// 0x004C (0x004C - 0x0000)
struct WwiseGroupValueInfoLibrary_SetGroupShortId final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         GroupShortId;                                      // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseGroupValueInfo                   ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_SetGroupShortId;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.SetWwiseName
// 0x0060 (0x0060 - 0x0000)
struct WwiseGroupValueInfoLibrary_SetWwiseName final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WwiseName;                                         // 0x0028(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseGroupValueInfo                   ReturnValue;                                       // 0x0038(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_SetWwiseName;

// Function WwiseResourceLoader.WwiseGroupValueInfoLibrary.SetWwiseShortId
// 0x004C (0x004C - 0x0000)
struct WwiseGroupValueInfoLibrary_SetWwiseShortId final
{
public:
	struct FWwiseGroupValueInfo                   Ref;                                               // 0x0000(0x0024)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WwiseShortId;                                      // 0x0024(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseGroupValueInfo                   ReturnValue;                                       // 0x0028(0x0024)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseGroupValueInfoLibrary_SetWwiseShortId;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.BreakStruct
// 0x0050 (0x0050 - 0x0000)
struct WwiseObjectInfoLibrary_BreakStruct final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(Parm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  OutWwiseGuid;                                      // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutWwiseShortId;                                   // 0x0030(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 OutWwiseName;                                      // 0x0038(0x0010)(Parm, OutParm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         OutHardCodedSoundBankShortId;                      // 0x0048(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_BreakStruct;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.GetHardCodedSoundBankShortId
// 0x0024 (0x0024 - 0x0000)
struct WwiseObjectInfoLibrary_GetHardCodedSoundBankShortId final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_GetHardCodedSoundBankShortId;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.GetWwiseGuid
// 0x0030 (0x0030 - 0x0000)
struct WwiseObjectInfoLibrary_GetWwiseGuid final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_GetWwiseGuid;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.GetWwiseName
// 0x0030 (0x0030 - 0x0000)
struct WwiseObjectInfoLibrary_GetWwiseName final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 ReturnValue;                                       // 0x0020(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_GetWwiseName;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.GetWwiseShortID
// 0x0024 (0x0024 - 0x0000)
struct WwiseObjectInfoLibrary_GetWwiseShortID final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         ReturnValue;                                       // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_GetWwiseShortID;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.MakeStruct
// 0x0050 (0x0050 - 0x0000)
struct WwiseObjectInfoLibrary_MakeStruct final
{
public:
	struct FGuid                                  WwiseGuid;                                         // 0x0000(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WwiseShortId;                                      // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 WwiseName;                                         // 0x0018(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HardCodedSoundBankShortId;                         // 0x0028(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseObjectInfo                       ReturnValue;                                       // 0x002C(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_MakeStruct;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.SetHardCodedSoundBankShortId
// 0x0044 (0x0044 - 0x0000)
struct WwiseObjectInfoLibrary_SetHardCodedSoundBankShortId final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         HardCodedSoundBankShortId;                         // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseObjectInfo                       ReturnValue;                                       // 0x0024(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_SetHardCodedSoundBankShortId;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.SetWwiseGuid
// 0x0050 (0x0050 - 0x0000)
struct WwiseObjectInfoLibrary_SetWwiseGuid final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                  WwiseGuid;                                         // 0x0020(0x0010)(ConstParm, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseObjectInfo                       ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_SetWwiseGuid;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.SetWwiseName
// 0x0050 (0x0050 - 0x0000)
struct WwiseObjectInfoLibrary_SetWwiseName final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 WwiseName;                                         // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseObjectInfo                       ReturnValue;                                       // 0x0030(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_SetWwiseName;

// Function WwiseResourceLoader.WwiseObjectInfoLibrary.SetWwiseShortId
// 0x0044 (0x0044 - 0x0000)
struct WwiseObjectInfoLibrary_SetWwiseShortId final
{
public:
	struct FWwiseObjectInfo                       Ref;                                               // 0x0000(0x0020)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         WwiseShortId;                                      // 0x0020(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWwiseObjectInfo                       ReturnValue;                                       // 0x0024(0x0020)(Parm, OutParm, ReturnParm, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
DUMPER7_ASSERTS_WwiseObjectInfoLibrary_SetWwiseShortId;

}

